// @AnubisCheatz
//
// sdk genrated by @crusher_14
//
// https://t.me/AnubisCheatz

#pragma once

namespace SDK
{

// Object: Class AndroidRuntimeSettings.AndroidRuntimeSettings
// Size: 0x2C8 (Inherited: 0x28)
struct UAndroidRuntimeSettings : UObject
{
	struct FString PackageName; // 0x28(0x10)
	int32_t StoreVersion; // 0x38(0x4)
	int32_t StoreVersionOffsetArmV7; // 0x3C(0x4)
	int32_t StoreVersionOffsetArm64; // 0x40(0x4)
	int32_t StoreVersionOffsetX8664; // 0x44(0x4)
	struct FString ApplicationDisplayName; // 0x48(0x10)
	struct FString VersionDisplayName; // 0x58(0x10)
	int32_t MinSDKVersion; // 0x68(0x4)
	int32_t TargetSDKVersion; // 0x6C(0x4)
	uint8_t InstallLocation; // 0x70(0x1)
	bool bEnableGradle; // 0x71(0x1)
	bool bEnableLint; // 0x72(0x1)
	bool bPackageDataInsideApk; // 0x73(0x1)
	bool bCreateAllPlatformsInstall; // 0x74(0x1)
	bool bDisableVerifyOBBOnStartUp; // 0x75(0x1)
	bool bForceSmallOBBFiles; // 0x76(0x1)
	bool bAllowLargeOBBFiles; // 0x77(0x1)
	bool bAllowPatchOBBFile; // 0x78(0x1)
	bool bForcePackageAllChunks; // 0x79(0x1)
	bool bUseExternalFilesDir; // 0x7A(0x1)
	bool bPublicLogFiles; // 0x7B(0x1)
	uint8_t Orientation; // 0x7C(0x1)
	uint8_t Pad_0x7D[0x3]; // 0x7D(0x3)
	float MaxAspectRatio; // 0x80(0x4)
	bool bUseDisplayCutout; // 0x84(0x1)
	bool bRestoreNotificationsOnReboot; // 0x85(0x1)
	bool bFullScreen; // 0x86(0x1)
	bool bEnableNewKeyboard; // 0x87(0x1)
	uint8_t DepthBufferPreference; // 0x88(0x1)
	bool bValidateTextureFormats; // 0x89(0x1)
	bool bEnableBundle; // 0x8A(0x1)
	bool bEnableUniversalAPK; // 0x8B(0x1)
	bool bBundleABISplit; // 0x8C(0x1)
	bool bBundleLanguageSplit; // 0x8D(0x1)
	bool bBundleDensitySplit; // 0x8E(0x1)
	uint8_t Pad_0x8F[0x1]; // 0x8F(0x1)
	struct TArray<struct FString> ExtraManifestNodeTags; // 0x90(0x10)
	struct TArray<struct FString> ExtraApplicationNodeTags; // 0xA0(0x10)
	struct FString ExtraApplicationSettings; // 0xB0(0x10)
	struct TArray<struct FString> ExtraActivityNodeTags; // 0xC0(0x10)
	struct FString ExtraActivitySettings; // 0xD0(0x10)
	struct TArray<struct FString> ExtraPermissions; // 0xE0(0x10)
	bool bAndroidVoiceEnabled; // 0xF0(0x1)
	uint8_t Pad_0xF1[0x7]; // 0xF1(0x7)
	struct TArray<uint8_t> PackageForOculusMobile; // 0xF8(0x10)
	bool bRemoveOSIG; // 0x108(0x1)
	uint8_t Pad_0x109[0x7]; // 0x109(0x7)
	struct TArray<uint8_t> GoogleVRCaps; // 0x110(0x10)
	bool bGoogleVRSustainedPerformance; // 0x120(0x1)
	uint8_t Pad_0x121[0x7]; // 0x121(0x7)
	struct FString KeyStore; // 0x128(0x10)
	struct FString KeyAlias; // 0x138(0x10)
	struct FString KeyStorePassword; // 0x148(0x10)
	struct FString KeyPassword; // 0x158(0x10)
	bool bBuildForArmV7; // 0x168(0x1)
	bool bBuildForArm64; // 0x169(0x1)
	bool bBuildForX8664; // 0x16A(0x1)
	bool bBuildForES31; // 0x16B(0x1)
	bool bSupportsVulkan; // 0x16C(0x1)
	bool bSupportsVulkanSM5; // 0x16D(0x1)
	uint8_t ClangSanitizer; // 0x16E(0x1)
	bool bDetectVulkanByDefault; // 0x16F(0x1)
	bool bBuildWithHiddenSymbolVisibility; // 0x170(0x1)
	bool bSaveSymbols; // 0x171(0x1)
	bool bForceLDLinker; // 0x172(0x1)
	bool bEnableGooglePlaySupport; // 0x173(0x1)
	bool bUseGetAccounts; // 0x174(0x1)
	uint8_t Pad_0x175[0x3]; // 0x175(0x3)
	struct FString GamesAppID; // 0x178(0x10)
	struct TArray<struct FGooglePlayAchievementMapping> AchievementMap; // 0x188(0x10)
	struct TArray<struct FGooglePlayLeaderboardMapping> LeaderboardMap; // 0x198(0x10)
	bool bEnableSnapshots; // 0x1A8(0x1)
	bool bSupportAdMob; // 0x1A9(0x1)
	uint8_t Pad_0x1AA[0x6]; // 0x1AA(0x6)
	struct FString AdMobAdUnitID; // 0x1B0(0x10)
	struct TArray<struct FString> AdMobAdUnitIDs; // 0x1C0(0x10)
	struct FString GooglePlayLicenseKey; // 0x1D0(0x10)
	struct FString GCMClientSenderID; // 0x1E0(0x10)
	bool bShowLaunchImage; // 0x1F0(0x1)
	bool bShowSplashScreenImage; // 0x1F1(0x1)
	bool bReplaceSplashThemeWithBlackTheme; // 0x1F2(0x1)
	bool bShowPhotosensitiveWarning; // 0x1F3(0x1)
	int32_t PhotosensitiveShowTime; // 0x1F4(0x4)
	bool bPlaySplashVideo; // 0x1F8(0x1)
	bool bEnableDeepLink; // 0x1F9(0x1)
	bool bAllowIMU; // 0x1FA(0x1)
	bool bAllowControllers; // 0x1FB(0x1)
	bool bBlockAndroidKeysOnControllers; // 0x1FC(0x1)
	bool bControllersBlockDeviceFeedback; // 0x1FD(0x1)
	uint8_t AndroidAudio; // 0x1FE(0x1)
	uint8_t Pad_0x1FF[0x1]; // 0x1FF(0x1)
	int32_t AudioSampleRate; // 0x200(0x4)
	int32_t AudioCallbackBufferFrameSize; // 0x204(0x4)
	int32_t AudioNumBuffersToEnqueue; // 0x208(0x4)
	int32_t AudioMaxChannels; // 0x20C(0x4)
	int32_t AudioNumSourceWorkers; // 0x210(0x4)
	uint8_t Pad_0x214[0x4]; // 0x214(0x4)
	struct FString SpatializationPlugin; // 0x218(0x10)
	struct FString ReverbPlugin; // 0x228(0x10)
	struct FString OcclusionPlugin; // 0x238(0x10)
	struct FPlatformRuntimeAudioCompressionOverrides CompressionOverrides; // 0x248(0x10)
	bool bUseAudioStreamCaching; // 0x258(0x1)
	uint8_t Pad_0x259[0x3]; // 0x259(0x3)
	int32_t CacheSizeKB; // 0x25C(0x4)
	bool bResampleForDevice; // 0x260(0x1)
	uint8_t Pad_0x261[0x3]; // 0x261(0x3)
	int32_t SoundCueCookQualityIndex; // 0x264(0x4)
	float MaxSampleRate; // 0x268(0x4)
	float HighSampleRate; // 0x26C(0x4)
	float MedSampleRate; // 0x270(0x4)
	float LowSampleRate; // 0x274(0x4)
	float MinSampleRate; // 0x278(0x4)
	float CompressionQualityModifier; // 0x27C(0x4)
	float AutoStreamingThreshold; // 0x280(0x4)
	uint8_t AndroidGraphicsDebugger; // 0x284(0x1)
	uint8_t Pad_0x285[0x3]; // 0x285(0x3)
	struct FDirectoryPath MaliGraphicsDebuggerPath; // 0x288(0x10)
	bool bMultiTargetFormat_ETC2; // 0x298(0x1)
	bool bMultiTargetFormat_DXT; // 0x299(0x1)
	bool bMultiTargetFormat_ASTC; // 0x29A(0x1)
	uint8_t Pad_0x29B[0x1]; // 0x29B(0x1)
	float TextureFormatPriority_ETC2; // 0x29C(0x4)
	float TextureFormatPriority_DXT; // 0x2A0(0x4)
	float TextureFormatPriority_ASTC; // 0x2A4(0x4)
	struct FString SDKAPILevelOverride; // 0x2A8(0x10)
	struct FString NDKAPILevelOverride; // 0x2B8(0x10)
};

} // namespace SDK
