// @AnubisCheatz
//
// sdk genrated by @crusher_14
//
// https://t.me/AnubisCheatz

#pragma once

namespace SDK
{

// Object: Class Engine.BlueprintFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBlueprintFunctionLibrary : UObject
{
};

// Object: Class Engine.ActorComponent
// Size: 0xD8 (Inherited: 0x28)
struct UActorComponent : UObject
{
	uint8_t Pad_0x28[0x20]; // 0x28(0x20)
	struct FActorComponentTickFunction PrimaryComponentTick; // 0x48(0x30)
	struct TArray<struct FName> ComponentTags; // 0x78(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x88(0x10)
	uint8_t Pad_0x98[0x4]; // 0x98(0x4)
	int32_t UCSSerializationIndex; // 0x9C(0x4)
	uint8_t BitPad_0xA0_0 : 3; // 0xA0(0x1)
	uint8_t bNetAddressable : 1; // 0xA0(0x1), Mask(0x8)
	uint8_t bSupportAggregationTick : 1; // 0xA0(0x1), Mask(0x10)
	uint8_t BitPad_0xA0_5 : 3; // 0xA0(0x1)
	uint8_t Pad_0xA1[0xB]; // 0xA1(0xB)
	uint8_t bReplicates : 1; // 0xAC(0x1), Mask(0x1)
	uint8_t BitPad_0xAC_1 : 7; // 0xAC(0x1)
	uint8_t BitPad_0xAD_0 : 3; // 0xAD(0x1)
	uint8_t bAutoActivate : 1; // 0xAD(0x1), Mask(0x8)
	uint8_t bIsActive : 1; // 0xAD(0x1), Mask(0x10)
	uint8_t bEditableWhenInherited : 1; // 0xAD(0x1), Mask(0x20)
	uint8_t BitPad_0xAD_6 : 1; // 0xAD(0x1)
	uint8_t bCanEverAffectNavigation : 1; // 0xAD(0x1), Mask(0x80)
	uint8_t BitPad_0xAE_0 : 1; // 0xAE(0x1)
	uint8_t bIsEditorOnly : 1; // 0xAE(0x1), Mask(0x2)
	uint8_t BitPad_0xAE_2 : 6; // 0xAE(0x1)
	uint8_t Pad_0xAF[0x1]; // 0xAF(0x1)
	enum class EComponentCreationMethod CreationMethod; // 0xB0(0x1)
	struct FMulticastSparseDelegate OnComponentActivated; // 0xB1(0x1)
	struct FMulticastSparseDelegate OnComponentDeactivated; // 0xB2(0x1)
	uint8_t Pad_0xB3[0x5]; // 0xB3(0x5)
	struct TArray<struct FSimpleMemberReference> UCSModifiedProperties; // 0xB8(0x10)
	uint8_t Pad_0xC8[0x10]; // 0xC8(0x10)


	// Object: Function Engine.ActorComponent.ToggleActive
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa46d9e4
	// Params: [ Num(0) Size(0x0) ]
	void ToggleActive();

	// Object: Function Engine.ActorComponent.SetTickGroup
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa46d488
	// Params: [ Num(1) Size(0x1) ]
	void SetTickGroup(uint8_t NewTickGroup);

	// Object: Function Engine.ActorComponent.SetTickableWhenPaused
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa46d85c
	// Params: [ Num(1) Size(0x1) ]
	void SetTickableWhenPaused(bool bTickableWhenPaused);

	// Object: Function Engine.ActorComponent.SetIsReplicated
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa46d7ac
	// Params: [ Num(1) Size(0x1) ]
	void SetIsReplicated(bool ShouldReplicate);

	// Object: Function Engine.ActorComponent.SetComponentTickInterval
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa46d60c
	// Params: [ Num(1) Size(0x4) ]
	void SetComponentTickInterval(float TickInterval);

	// Object: Function Engine.ActorComponent.SetComponentTickEnabled
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa46d6f4
	// Params: [ Num(1) Size(0x1) ]
	void SetComponentTickEnabled(bool bEnabled);

	// Object: Function Engine.ActorComponent.SetAutoActivate
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa46d90c
	// Params: [ Num(1) Size(0x1) ]
	void SetAutoActivate(bool bNewAutoActivate);

	// Object: Function Engine.ActorComponent.SetActive
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa46da00
	// Params: [ Num(2) Size(0x2) ]
	void SetActive(bool bNewActive, bool bReset);

	// Object: Function Engine.ActorComponent.RemoveTickPrerequisiteComponent
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa46d1c8
	// Params: [ Num(1) Size(0x8) ]
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent);

	// Object: Function Engine.ActorComponent.RemoveTickPrerequisiteActor
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa46d278
	// Params: [ Num(1) Size(0x8) ]
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor);

	// Object: Function Engine.ActorComponent.ReceiveTick
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x4) ]
	void ReceiveTick(float DeltaSeconds);

	// Object: Function Engine.ActorComponent.ReceiveEndPlay
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x1) ]
	void ReceiveEndPlay(uint8_t EndPlayReason);

	// Object: Function Engine.ActorComponent.ReceiveBeginPlay
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void ReceiveBeginPlay();

	// Object: Function Engine.ActorComponent.OnRep_IsActive
	// Flags: [Native|Public]
	// Offset: 0xa46dca4
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_IsActive();

	// Object: Function Engine.ActorComponent.K2_DestroyComponent
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa46d530
	// Params: [ Num(1) Size(0x8) ]
	void K2_DestroyComponent(struct UObject* Object);

	// Object: Function Engine.ActorComponent.IsComponentTickEnabled
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa46d6b4
	// Params: [ Num(1) Size(0x1) ]
	bool IsComponentTickEnabled();

	// Object: Function Engine.ActorComponent.IsBeingDestroyed
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa46dcc0
	// Params: [ Num(1) Size(0x1) ]
	bool IsBeingDestroyed();

	// Object: Function Engine.ActorComponent.IsActive
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa46d9c4
	// Params: [ Num(1) Size(0x1) ]
	bool IsActive();

	// Object: Function Engine.ActorComponent.GetOwner
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa46dc88
	// Params: [ Num(1) Size(0x8) ]
	struct AActor* GetOwner();

	// Object: Function Engine.ActorComponent.GetComponentTickInterval
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa46d5d8
	// Params: [ Num(1) Size(0x4) ]
	float GetComponentTickInterval();

	// Object: Function Engine.ActorComponent.Deactivate
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa46db00
	// Params: [ Num(0) Size(0x0) ]
	void Deactivate();

	// Object: Function Engine.ActorComponent.ComponentHasTag
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa46dbd4
	// Params: [ Num(2) Size(0x9) ]
	bool ComponentHasTag(struct FName Tag);

	// Object: Function Engine.ActorComponent.AddTickPrerequisiteComponent
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa46d328
	// Params: [ Num(1) Size(0x8) ]
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent);

	// Object: Function Engine.ActorComponent.AddTickPrerequisiteActor
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa46d3d8
	// Params: [ Num(1) Size(0x8) ]
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor);

	// Object: Function Engine.ActorComponent.Activate
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa46db1c
	// Params: [ Num(1) Size(0x1) ]
	void Activate(bool bReset);
};

// Object: Class Engine.SceneComponent
// Size: 0x350 (Inherited: 0xD8)
struct USceneComponent : UActorComponent
{
	uint8_t Pad_0xD8[0x8]; // 0xD8(0x8)
	struct TWeakObjectPtr<struct APhysicsVolume> PhysicsVolume; // 0xE0(0x8)
	struct USceneComponent* AttachParent; // 0xE8(0x8)
	struct FName AttachSocketName; // 0xF0(0x8)
	struct TArray<struct USceneComponent*> AttachChildren; // 0xF8(0x10)
	struct TArray<struct USceneComponent*> ClientAttachedChildren; // 0x108(0x10)
	uint8_t Pad_0x118[0x34]; // 0x118(0x34)
	struct FVector RelativeLocation; // 0x14C(0xC)
	struct FRotator RelativeRotation; // 0x158(0xC)
	struct FVector RelativeScale3D; // 0x164(0xC)
	struct FVector ComponentVelocity; // 0x170(0xC)
	uint8_t bComponentToWorldUpdated : 1; // 0x17C(0x1), Mask(0x1)
	uint8_t BitPad_0x17C_1 : 1; // 0x17C(0x1)
	uint8_t bAbsoluteLocation : 1; // 0x17C(0x1), Mask(0x4)
	uint8_t bAbsoluteRotation : 1; // 0x17C(0x1), Mask(0x8)
	uint8_t bAbsoluteScale : 1; // 0x17C(0x1), Mask(0x10)
	uint8_t bVisible : 1; // 0x17C(0x1), Mask(0x20)
	uint8_t bShouldBeAttached : 1; // 0x17C(0x1), Mask(0x40)
	uint8_t bShouldSnapLocationWhenAttached : 1; // 0x17C(0x1), Mask(0x80)
	uint8_t bShouldSnapRotationWhenAttached : 1; // 0x17D(0x1), Mask(0x1)
	uint8_t bShouldUpdatePhysicsVolume : 1; // 0x17D(0x1), Mask(0x2)
	uint8_t bHiddenInGame : 1; // 0x17D(0x1), Mask(0x4)
	uint8_t bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x17D(0x1), Mask(0x8)
	uint8_t bUseAttachParentBound : 1; // 0x17D(0x1), Mask(0x10)
	uint8_t bDisableUpdateComponentToWorldIfNotVisiable : 1; // 0x17D(0x1), Mask(0x20)
	uint8_t bDisableUpdateComponentToWorldIfTickStateCoolingDown : 1; // 0x17D(0x1), Mask(0x40)
	uint8_t bDisableDeferredUpdateComponent : 1; // 0x17D(0x1), Mask(0x80)
	uint8_t Pad_0x17E[0x3]; // 0x17E(0x3)
	uint8_t Mobility; // 0x181(0x1)
	uint8_t DetailMode; // 0x182(0x1)
	struct FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0x183(0x1)
	uint8_t Pad_0x184[0x1CC]; // 0x184(0x1CC)


	// Object: Function Engine.SceneComponent.ToggleVisibility
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa678614
	// Params: [ Num(1) Size(0x1) ]
	void ToggleVisibility(bool bPropagateToChildren);

	// Object: Function Engine.SceneComponent.SnapTo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa678ff8
	// Params: [ Num(3) Size(0x11) ]
	bool SnapTo(struct USceneComponent* InParent, struct FName InSocketName);

	// Object: Function Engine.SceneComponent.SetWorldScale3D
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa67a0f8
	// Params: [ Num(1) Size(0xC) ]
	void SetWorldScale3D(struct FVector NewScale);

	// Object: Function Engine.SceneComponent.SetVisibility
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa6786e4
	// Params: [ Num(3) Size(0x8) ]
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren, int32_t Flag);

	// Object: Function Engine.SceneComponent.SetShouldUpdatePhysicsVolume
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa67b488
	// Params: [ Num(1) Size(0x1) ]
	void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume);

	// Object: Function Engine.SceneComponent.SetRelativeScale3D
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa67ad40
	// Params: [ Num(1) Size(0xC) ]
	void SetRelativeScale3D(struct FVector NewScale3D);

	// Object: Function Engine.SceneComponent.SetMobility
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa677f2c
	// Params: [ Num(1) Size(0x1) ]
	void SetMobility(uint8_t NewMobility);

	// Object: Function Engine.SceneComponent.SetHiddenInGame
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa678518
	// Params: [ Num(2) Size(0x2) ]
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren);

	// Object: Function Engine.SceneComponent.SetAbsolute
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6781bc
	// Params: [ Num(3) Size(0x3) ]
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale);

	// Object: Function Engine.SceneComponent.ResetRelativeTransform
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa67ade8
	// Params: [ Num(0) Size(0x0) ]
	void ResetRelativeTransform();

	// Object: Function Engine.SceneComponent.OnRep_Visibility
	// Flags: [Final|Native|Private]
	// Offset: 0xa67b388
	// Params: [ Num(1) Size(0x1) ]
	void OnRep_Visibility(bool OldValue);

	// Object: Function Engine.SceneComponent.OnRep_Transform
	// Flags: [Final|Native|Private]
	// Offset: 0xa67b474
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_Transform();

	// Object: Function Engine.SceneComponent.OnRep_AttachSocketName
	// Flags: [Final|Native|Private]
	// Offset: 0xa67b438
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_AttachSocketName();

	// Object: Function Engine.SceneComponent.OnRep_AttachParent
	// Flags: [Final|Native|Private]
	// Offset: 0xa67b460
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_AttachParent();

	// Object: Function Engine.SceneComponent.OnRep_AttachChildren
	// Flags: [Final|Native|Private]
	// Offset: 0xa67b44c
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_AttachChildren();

	// Object: Function Engine.SceneComponent.K2_SetWorldTransform
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa679f18
	// Params: [ Num(4) Size(0xBD) ]
	void K2_SetWorldTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_SetWorldRotation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa67a1a0
	// Params: [ Num(4) Size(0x99) ]
	void K2_SetWorldRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_SetWorldLocationAndRotation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa677fdc
	// Params: [ Num(5) Size(0xA5) ]
	void K2_SetWorldLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_SetWorldLocation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa67a340
	// Params: [ Num(4) Size(0x99) ]
	void K2_SetWorldLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_SetRelativeTransform
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa67ae68
	// Params: [ Num(4) Size(0xBD) ]
	void K2_SetRelativeTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_SetRelativeRotation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa67b048
	// Params: [ Num(4) Size(0x99) ]
	void K2_SetRelativeRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_SetRelativeLocationAndRotation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa678304
	// Params: [ Num(5) Size(0xA5) ]
	void K2_SetRelativeLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_SetRelativeLocation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa67b1e8
	// Params: [ Num(4) Size(0x99) ]
	void K2_SetRelativeLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_GetComponentToWorld
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6798e4
	// Params: [ Num(1) Size(0x30) ]
	struct FTransform K2_GetComponentToWorld();

	// Object: Function Engine.SceneComponent.K2_GetComponentScale
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa679950
	// Params: [ Num(1) Size(0xC) ]
	struct FVector K2_GetComponentScale();

	// Object: Function Engine.SceneComponent.K2_GetComponentRotation
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa679988
	// Params: [ Num(1) Size(0xC) ]
	struct FRotator K2_GetComponentRotation();

	// Object: Function Engine.SceneComponent.K2_GetComponentLocation
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6799c0
	// Params: [ Num(1) Size(0xC) ]
	struct FVector K2_GetComponentLocation();

	// Object: Function Engine.SceneComponent.K2_DetachFromComponent
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa678d88
	// Params: [ Num(4) Size(0x4) ]
	void K2_DetachFromComponent(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule, bool bCallModify);

	// Object: Function Engine.SceneComponent.K2_AttachToComponent
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6790e8
	// Params: [ Num(7) Size(0x15) ]
	bool K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);

	// Object: Function Engine.SceneComponent.K2_AttachTo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6792e4
	// Params: [ Num(5) Size(0x13) ]
	bool K2_AttachTo(struct USceneComponent* InParent, struct FName InSocketName, uint8_t AttachType, bool bWeldSimulatedBodies);

	// Object: Function Engine.SceneComponent.K2_AddWorldTransform
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa6799f8
	// Params: [ Num(4) Size(0xBD) ]
	void K2_AddWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_AddWorldRotation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa679bd8
	// Params: [ Num(4) Size(0x99) ]
	void K2_AddWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_AddWorldOffset
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa679d78
	// Params: [ Num(4) Size(0x99) ]
	void K2_AddWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_AddRelativeRotation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa67aa00
	// Params: [ Num(4) Size(0x99) ]
	void K2_AddRelativeRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_AddRelativeLocation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa67aba0
	// Params: [ Num(4) Size(0x99) ]
	void K2_AddRelativeLocation(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_AddLocalTransform
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa67a4e0
	// Params: [ Num(4) Size(0xBD) ]
	void K2_AddLocalTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_AddLocalRotation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa67a6c0
	// Params: [ Num(4) Size(0x99) ]
	void K2_AddLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.K2_AddLocalOffset
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa67a860
	// Params: [ Num(4) Size(0x99) ]
	void K2_AddLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.SceneComponent.IsVisible
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa67882c
	// Params: [ Num(1) Size(0x1) ]
	bool IsVisible();

	// Object: Function Engine.SceneComponent.IsSimulatingPhysics
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa679780
	// Params: [ Num(2) Size(0x9) ]
	bool IsSimulatingPhysics(struct FName BoneName);

	// Object: Function Engine.SceneComponent.IsAnySimulatingPhysics
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa679740
	// Params: [ Num(1) Size(0x1) ]
	bool IsAnySimulatingPhysics();

	// Object: Function Engine.SceneComponent.GetUpVector
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa679874
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetUpVector();

	// Object: Function Engine.SceneComponent.GetSocketTransform
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa678b9c
	// Params: [ Num(4) Size(0x40) ]
	struct FTransform GetSocketTransform(struct FName InSocketName, uint8_t TransformSpace, bool bDoParallel);

	// Object: Function Engine.SceneComponent.GetSocketRotation
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa678a24
	// Params: [ Num(2) Size(0x14) ]
	struct FRotator GetSocketRotation(struct FName InSocketName);

	// Object: Function Engine.SceneComponent.GetSocketQuaternion
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa678968
	// Params: [ Num(2) Size(0x20) ]
	struct FQuat GetSocketQuaternion(struct FName InSocketName);

	// Object: Function Engine.SceneComponent.GetSocketLocation
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa678ae0
	// Params: [ Num(2) Size(0x14) ]
	struct FVector GetSocketLocation(struct FName InSocketName);

	// Object: Function Engine.SceneComponent.GetShouldUpdatePhysicsVolume
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa67b538
	// Params: [ Num(1) Size(0x1) ]
	bool GetShouldUpdatePhysicsVolume();

	// Object: Function Engine.SceneComponent.GetRightVector
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa67983c
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetRightVector();

	// Object: Function Engine.SceneComponent.GetRelativeTransform
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa67adfc
	// Params: [ Num(1) Size(0x30) ]
	struct FTransform GetRelativeTransform();

	// Object: Function Engine.SceneComponent.GetPhysicsVolume
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6784e4
	// Params: [ Num(1) Size(0x8) ]
	struct APhysicsVolume* GetPhysicsVolume();

	// Object: Function Engine.SceneComponent.GetParentComponents
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa679648
	// Params: [ Num(1) Size(0x10) ]
	void GetParentComponents(struct TArray<struct USceneComponent*>& Parents);

	// Object: Function Engine.SceneComponent.GetNumChildrenComponents
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa679614
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetNumChildrenComponents();

	// Object: Function Engine.SceneComponent.GetForwardVector
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6798ac
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetForwardVector();

	// Object: Function Engine.SceneComponent.GetComponentVelocity
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa67886c
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetComponentVelocity();

	// Object: Function Engine.SceneComponent.GetChildrenComponents
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa67945c
	// Params: [ Num(2) Size(0x18) ]
	void GetChildrenComponents(bool bIncludeAllDescendants, struct TArray<struct USceneComponent*>& Children);

	// Object: Function Engine.SceneComponent.GetChildComponent
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa679564
	// Params: [ Num(2) Size(0x10) ]
	struct USceneComponent* GetChildComponent(int32_t ChildIndex);

	// Object: Function Engine.SceneComponent.GetAttachSocketName
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa679708
	// Params: [ Num(1) Size(0x8) ]
	struct FName GetAttachSocketName();

	// Object: Function Engine.SceneComponent.GetAttachParent
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa679724
	// Params: [ Num(1) Size(0x8) ]
	struct USceneComponent* GetAttachParent();

	// Object: Function Engine.SceneComponent.GetAllSocketNames
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa678cec
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<struct FName> GetAllSocketNames();

	// Object: Function Engine.SceneComponent.DoesSocketExist
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6788ac
	// Params: [ Num(2) Size(0x9) ]
	bool DoesSocketExist(struct FName InSocketName);

	// Object: Function Engine.SceneComponent.DetachFromParent
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa678ef8
	// Params: [ Num(2) Size(0x2) ]
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify);
};

// Object: Class Engine.PrimitiveComponent
// Size: 0x5F0 (Inherited: 0x350)
struct UPrimitiveComponent : USceneComponent
{
	float MinDrawDistance; // 0x350(0x4)
	float LDMaxDrawDistance; // 0x354(0x4)
	float MaxZCullDistance; // 0x358(0x4)
	float LDMinimalismDrawDistance; // 0x35C(0x4)
	float CachedMaxDrawDistance; // 0x360(0x4)
	float MinScreenSizeCulling; // 0x364(0x4)
	uint8_t DepthPriorityGroup; // 0x368(0x1)
	uint8_t ViewOwnerDepthPriorityGroup; // 0x369(0x1)
	uint8_t IndirectLightingCacheQuality; // 0x36A(0x1)
	enum class ELightmapType LightmapType; // 0x36B(0x1)
	uint8_t bIgnoreViewDistanceScale : 1; // 0x36C(0x1), Mask(0x1)
	uint8_t bUseMaxLODAsImposter : 1; // 0x36C(0x1), Mask(0x2)
	uint8_t bBatchImpostersAsInstances : 1; // 0x36C(0x1), Mask(0x4)
	uint8_t bNeverDistanceCull : 1; // 0x36C(0x1), Mask(0x8)
	uint8_t BitPad_0x36C_4 : 4; // 0x36C(0x1)
	uint8_t bAlwaysCreatePhysicsState : 1; // 0x36D(0x1), Mask(0x1)
	uint8_t bForceNotCreatePhysicsState : 1; // 0x36D(0x1), Mask(0x2)
	uint8_t bAllowDeferredPhysicsCreation : 1; // 0x36D(0x1), Mask(0x4)
	uint8_t bGenerateOverlapEvents : 1; // 0x36D(0x1), Mask(0x8)
	uint8_t bMultiBodyOverlap : 1; // 0x36D(0x1), Mask(0x10)
	uint8_t bTraceComplexOnMove : 1; // 0x36D(0x1), Mask(0x20)
	uint8_t bReturnMaterialOnMove : 1; // 0x36D(0x1), Mask(0x40)
	uint8_t bUseViewOwnerDepthPriorityGroup : 1; // 0x36D(0x1), Mask(0x80)
	uint8_t bAllowCullDistanceVolume : 1; // 0x36E(0x1), Mask(0x1)
	uint8_t bHasMotionBlurVelocityMeshes : 1; // 0x36E(0x1), Mask(0x2)
	uint8_t BitPad_0x36E_2 : 6; // 0x36E(0x1)
	uint8_t Pad_0x36F[0x1]; // 0x36F(0x1)
	struct TSoftObjectPtr<AReflectionCapture> MobileSourceCapture; // 0x370(0x28)
	uint8_t bVisibleInReflectionCaptures : 1; // 0x398(0x1), Mask(0x1)
	uint8_t bVisibleInRayTracing : 1; // 0x398(0x1), Mask(0x2)
	uint8_t bForceNotCreateRenderState : 1; // 0x398(0x1), Mask(0x4)
	uint8_t bRenderInMainPass : 1; // 0x398(0x1), Mask(0x8)
	uint8_t bRenderInDepthPass : 1; // 0x398(0x1), Mask(0x10)
	uint8_t bReceivesDecals : 1; // 0x398(0x1), Mask(0x20)
	uint8_t bOwnerNoSee : 1; // 0x398(0x1), Mask(0x40)
	uint8_t bOnlyOwnerSee : 1; // 0x398(0x1), Mask(0x80)
	uint8_t bTreatAsBackgroundForOcclusion : 1; // 0x399(0x1), Mask(0x1)
	uint8_t bUseAsOccluder : 1; // 0x399(0x1), Mask(0x2)
	uint8_t bIgnoreOcclusionCull : 1; // 0x399(0x1), Mask(0x4)
	uint8_t bTwoSideOccluder : 1; // 0x399(0x1), Mask(0x8)
	uint8_t bIsLargeOccluder : 1; // 0x399(0x1), Mask(0x10)
	uint8_t bUseSecondaryView : 1; // 0x399(0x1), Mask(0x20)
	uint8_t BitPad_0x399_6 : 2; // 0x399(0x1)
	uint8_t Pad_0x39A[0x1B]; // 0x39A(0x1B)
	uint8_t bSelectable : 1; // 0x3B5(0x1), Mask(0x1)
	uint8_t bForceMipStreaming : 1; // 0x3B5(0x1), Mask(0x2)
	uint8_t bHasPerInstanceHitProxies : 1; // 0x3B5(0x1), Mask(0x4)
	uint8_t CastShadow : 1; // 0x3B5(0x1), Mask(0x8)
	uint8_t bAffectDynamicIndirectLighting : 1; // 0x3B5(0x1), Mask(0x10)
	uint8_t bAffectDistanceFieldLighting : 1; // 0x3B5(0x1), Mask(0x20)
	uint8_t bCastDynamicShadow : 1; // 0x3B5(0x1), Mask(0x40)
	uint8_t bMobileCastDynamicShadow : 1; // 0x3B5(0x1), Mask(0x80)
	uint8_t bCastStationaryCascadeShadow : 1; // 0x3B6(0x1), Mask(0x1)
	uint8_t bCastStaticShadow : 1; // 0x3B6(0x1), Mask(0x2)
	uint8_t bCastVolumetricTranslucentShadow : 1; // 0x3B6(0x1), Mask(0x4)
	uint8_t bSelfShadowOnly : 1; // 0x3B6(0x1), Mask(0x8)
	uint8_t bForceGenLightmap : 1; // 0x3B6(0x1), Mask(0x10)
	uint8_t bForceNoLightmap : 1; // 0x3B6(0x1), Mask(0x20)
	uint8_t bForceNoImportToLightmass : 1; // 0x3B6(0x1), Mask(0x40)
	uint8_t bCastFarShadow : 1; // 0x3B6(0x1), Mask(0x80)
	uint8_t bCastInsetShadow : 1; // 0x3B7(0x1), Mask(0x1)
	uint8_t bCastCinematicShadow : 1; // 0x3B7(0x1), Mask(0x2)
	uint8_t bCastHiddenShadow : 1; // 0x3B7(0x1), Mask(0x4)
	uint8_t bCastShadowAsTwoSided : 1; // 0x3B7(0x1), Mask(0x8)
	uint8_t bLightAsIfStatic : 1; // 0x3B7(0x1), Mask(0x10)
	uint8_t bLightAttachmentsAsGroup : 1; // 0x3B7(0x1), Mask(0x20)
	uint8_t bExcludeFromLightAttachmentGroup : 1; // 0x3B7(0x1), Mask(0x40)
	uint8_t bReceiveMobileCSMShadows : 1; // 0x3B7(0x1), Mask(0x80)
	uint8_t bSingleSampleShadowFromStationaryLights : 1; // 0x3B8(0x1), Mask(0x1)
	uint8_t bIgnoreRadialImpulse : 1; // 0x3B8(0x1), Mask(0x2)
	uint8_t bIgnoreRadialForce : 1; // 0x3B8(0x1), Mask(0x4)
	uint8_t bApplyImpulseOnDamage : 1; // 0x3B8(0x1), Mask(0x8)
	uint8_t bReplicatePhysicsToAutonomousProxy : 1; // 0x3B8(0x1), Mask(0x10)
	uint8_t bFillCollisionUnderneathForNavmesh : 1; // 0x3B8(0x1), Mask(0x20)
	uint8_t AlwaysLoadOnClient : 1; // 0x3B8(0x1), Mask(0x40)
	uint8_t AlwaysLoadOnServer : 1; // 0x3B8(0x1), Mask(0x80)
	uint8_t bUseEditorCompositing : 1; // 0x3B9(0x1), Mask(0x1)
	uint8_t bRenderCustomDepth : 1; // 0x3B9(0x1), Mask(0x2)
	uint8_t bRenderMainPassStencil : 1; // 0x3B9(0x1), Mask(0x4)
	uint8_t BitPad_0x3B9_3 : 5; // 0x3B9(0x1)
	uint8_t bHasCustomNavigableGeometry; // 0x3BA(0x1)
	uint8_t Pad_0x3BB[0x1]; // 0x3BB(0x1)
	uint8_t CanCharacterStepUpOn; // 0x3BC(0x1)
	struct FLightingChannels LightingChannels; // 0x3BD(0x1)
	enum class ERendererStencilMask CustomDepthStencilWriteMask; // 0x3BE(0x1)
	uint8_t Pad_0x3BF[0x1]; // 0x3BF(0x1)
	int32_t CustomDepthStencilValue; // 0x3C0(0x4)
	bool bWriteGBufferStencil; // 0x3C4(0x1)
	uint8_t Pad_0x3C5[0x3]; // 0x3C5(0x3)
	int32_t GBufferStencilValue; // 0x3C8(0x4)
	int32_t MainPassDepthStencilValue; // 0x3CC(0x4)
	bool bOverrideCSMDepthBias; // 0x3D0(0x1)
	uint8_t Pad_0x3D1[0x3]; // 0x3D1(0x3)
	float CSMDepthBias_Override; // 0x3D4(0x4)
	bool bAvatar; // 0x3D8(0x1)
	bool bScope; // 0x3D9(0x1)
	bool bAlwaysBuildSkyOcclusionTexture; // 0x3DA(0x1)
	uint8_t Pad_0x3DB[0x1]; // 0x3DB(0x1)
	float VolumetricLightmapbentScale; // 0x3DC(0x4)
	struct FLinearColor MobilePrimitiveColor; // 0x3E0(0x10)
	struct FCustomPrimitiveData CustomPrimitiveData; // 0x3F0(0x10)
	struct FCustomPrimitiveData CustomPrimitiveDataInternal; // 0x400(0x10)
	int32_t TranslucencySortPriority; // 0x410(0x4)
	int32_t VisibilityId; // 0x414(0x4)
	struct TArray<struct URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x418(0x10)
	int8_t VirtualTextureLodBias; // 0x428(0x1)
	int8_t VirtualTextureCullMips; // 0x429(0x1)
	int8_t VirtualTextureMinCoverage; // 0x42A(0x1)
	enum class ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x42B(0x1)
	uint8_t Pad_0x42C[0x4]; // 0x42C(0x4)
	float LpvBiasMultiplier; // 0x430(0x4)
	bool bStencilOnlyPrimitive; // 0x434(0x1)
	uint8_t Pad_0x435[0x17]; // 0x435(0x17)
	float BoundsScale; // 0x44C(0x4)
	uint8_t Pad_0x450[0x10]; // 0x450(0x10)
	struct TArray<struct AActor*> MoveIgnoreActors; // 0x460(0x10)
	struct TArray<struct UPrimitiveComponent*> MoveIgnoreComponents; // 0x470(0x10)
	uint8_t Pad_0x480[0x10]; // 0x480(0x10)
	struct FBodyInstance BodyInstance; // 0x490(0x130)
	struct FMulticastSparseDelegate OnComponentHit; // 0x5C0(0x1)
	struct FMulticastSparseDelegate OnComponentBeginOverlap; // 0x5C1(0x1)
	struct FMulticastSparseDelegate OnComponentEndOverlap; // 0x5C2(0x1)
	struct FMulticastSparseDelegate OnComponentWake; // 0x5C3(0x1)
	struct FMulticastSparseDelegate OnComponentSleep; // 0x5C4(0x1)
	uint8_t Pad_0x5C5[0x1]; // 0x5C5(0x1)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x5C6(0x1)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x5C7(0x1)
	struct FMulticastSparseDelegate OnClicked; // 0x5C8(0x1)
	struct FMulticastSparseDelegate OnReleased; // 0x5C9(0x1)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x5CA(0x1)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x5CB(0x1)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x5CC(0x1)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x5CD(0x1)
	uint8_t Pad_0x5CE[0x1A]; // 0x5CE(0x1A)
	struct UPrimitiveComponent* LODParentPrimitive; // 0x5E8(0x8)


	// Object: Function Engine.PrimitiveComponent.WasRecentlyRendered
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa661868
	// Params: [ Num(2) Size(0x5) ]
	bool WasRecentlyRendered(float Tolerance);

	// Object: Function Engine.PrimitiveComponent.WakeRigidBody
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65e348
	// Params: [ Num(1) Size(0x8) ]
	void WakeRigidBody(struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.WakeAllRigidBodies
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65bf0c
	// Params: [ Num(0) Size(0x0) ]
	void WakeAllRigidBodies();

	// Object: Function Engine.PrimitiveComponent.SetWriteGBufferStencil
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65c9ac
	// Params: [ Num(1) Size(0x1) ]
	void SetWriteGBufferStencil(bool bValue);

	// Object: Function Engine.PrimitiveComponent.SetWalkableSlopeOverride
	// Flags: [Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa660570
	// Params: [ Num(1) Size(0x10) ]
	void SetWalkableSlopeOverride(struct FWalkableSlopeOverride& NewOverride);

	// Object: Function Engine.PrimitiveComponent.SetUseCCD
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65b5c0
	// Params: [ Num(2) Size(0xC) ]
	void SetUseCCD(bool InUseCCD, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.SetTranslucentSortPriority
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65dc70
	// Params: [ Num(1) Size(0x4) ]
	void SetTranslucentSortPriority(int32_t NewTranslucentSortPriority);

	// Object: Function Engine.PrimitiveComponent.SetSingleSampleShadowFromStationaryLights
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65dd18
	// Params: [ Num(1) Size(0x1) ]
	void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights);

	// Object: Function Engine.PrimitiveComponent.SetSimulatePhysics
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa6604b8
	// Params: [ Num(1) Size(0x1) ]
	void SetSimulatePhysics(bool bSimulate);

	// Object: Function Engine.PrimitiveComponent.SetRenderMainPassStencil
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65c7ac
	// Params: [ Num(1) Size(0x1) ]
	void SetRenderMainPassStencil(bool bValue);

	// Object: Function Engine.PrimitiveComponent.SetRenderInMainPass
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65c6fc
	// Params: [ Num(1) Size(0x1) ]
	void SetRenderInMainPass(bool bValue);

	// Object: Function Engine.PrimitiveComponent.SetRenderCustomDepth
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65cbac
	// Params: [ Num(1) Size(0x1) ]
	void SetRenderCustomDepth(bool bValue);

	// Object: Function Engine.PrimitiveComponent.SetReceivesDecals
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65dbc0
	// Params: [ Num(1) Size(0x1) ]
	void SetReceivesDecals(bool bNewReceivesDecals);

	// Object: Function Engine.PrimitiveComponent.SetPhysMaterialOverride
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65b278
	// Params: [ Num(1) Size(0x8) ]
	void SetPhysMaterialOverride(struct UPhysicalMaterial* NewPhysMaterial);

	// Object: Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInRadians
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65e7d8
	// Params: [ Num(3) Size(0x10) ]
	void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInDegrees
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65e908
	// Params: [ Num(3) Size(0x10) ]
	void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65ea44
	// Params: [ Num(3) Size(0x10) ]
	void SetPhysicsMaxAngularVelocity(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65f1f0
	// Params: [ Num(3) Size(0x18) ]
	void SetPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInRadians
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65eccc
	// Params: [ Num(3) Size(0x18) ]
	void SetPhysicsAngularVelocityInRadians(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInDegrees
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65eb80
	// Params: [ Num(3) Size(0x18) ]
	void SetPhysicsAngularVelocityInDegrees(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65ee04
	// Params: [ Num(3) Size(0x18) ]
	void SetPhysicsAngularVelocity(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.SetOwnerNoSee
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65e138
	// Params: [ Num(1) Size(0x1) ]
	void SetOwnerNoSee(bool bNewOwnerNoSee);

	// Object: Function Engine.PrimitiveComponent.SetOverrideDepthBiasValue
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65c4f4
	// Params: [ Num(1) Size(0x4) ]
	void SetOverrideDepthBiasValue(float Value);

	// Object: Function Engine.PrimitiveComponent.SetOverrideDepthBias
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65c59c
	// Params: [ Num(1) Size(0x1) ]
	void SetOverrideDepthBias(bool bValue);

	// Object: Function Engine.PrimitiveComponent.SetOnlyOwnerSee
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65e088
	// Params: [ Num(1) Size(0x1) ]
	void SetOnlyOwnerSee(bool bNewOnlyOwnerSee);

	// Object: Function Engine.PrimitiveComponent.SetNotifyRigidBodyCollision
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65e1e8
	// Params: [ Num(1) Size(0x1) ]
	void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision);

	// Object: Function Engine.PrimitiveComponent.SetMobilePrimitiveColor
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa6610c0
	// Params: [ Num(1) Size(0x10) ]
	void SetMobilePrimitiveColor(struct FLinearColor Color);

	// Object: Function Engine.PrimitiveComponent.SetMaterialByName
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa660a58
	// Params: [ Num(2) Size(0x10) ]
	void SetMaterialByName(struct FName MaterialSlotName, struct UMaterialInterface* Material);

	// Object: Function Engine.PrimitiveComponent.SetMaterial
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa660b44
	// Params: [ Num(2) Size(0x10) ]
	void SetMaterial(int32_t ElementIndex, struct UMaterialInterface* Material);

	// Object: Function Engine.PrimitiveComponent.SetMassScale
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65bb4c
	// Params: [ Num(2) Size(0xC) ]
	void SetMassScale(struct FName BoneName, float InMassScale);

	// Object: Function Engine.PrimitiveComponent.SetMassOverrideInKg
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65b8ac
	// Params: [ Num(3) Size(0xD) ]
	void SetMassOverrideInKg(struct FName BoneName, float MassInKg, bool bOverrideMass);

	// Object: Function Engine.PrimitiveComponent.SetMainPassStencilValue
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65c85c
	// Params: [ Num(1) Size(0x4) ]
	void SetMainPassStencilValue(int32_t Value);

	// Object: Function Engine.PrimitiveComponent.SetLinearDamping
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65bd64
	// Params: [ Num(1) Size(0x4) ]
	void SetLinearDamping(float InDamping);

	// Object: Function Engine.PrimitiveComponent.SetLightingChannels
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa661930
	// Params: [ Num(3) Size(0x3) ]
	void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2);

	// Object: Function Engine.PrimitiveComponent.SetLightAttachmentsAsGroup
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65de78
	// Params: [ Num(1) Size(0x1) ]
	void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup);

	// Object: Function Engine.PrimitiveComponent.SetGenerateOverlapEvents
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa661a78
	// Params: [ Num(1) Size(0x1) ]
	void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents);

	// Object: Function Engine.PrimitiveComponent.SetGBufferStencilValue
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65c904
	// Params: [ Num(1) Size(0x4) ]
	void SetGBufferStencilValue(int32_t Value);

	// Object: Function Engine.PrimitiveComponent.SetForceNoLightmap
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65c64c
	// Params: [ Num(1) Size(0x1) ]
	void SetForceNoLightmap(bool bValue);

	// Object: Function Engine.PrimitiveComponent.SetExcludeFromLightAttachmentGroup
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65ddc8
	// Params: [ Num(1) Size(0x1) ]
	void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup);

	// Object: Function Engine.PrimitiveComponent.SetEnableGravity
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65be54
	// Params: [ Num(1) Size(0x1) ]
	void SetEnableGravity(bool bGravityEnabled);

	// Object: Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector4
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa661168
	// Params: [ Num(2) Size(0x20) ]
	void SetCustomPrimitiveDataVector4(int32_t DataIndex, struct FVector4 Value);

	// Object: Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector3
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa66125c
	// Params: [ Num(2) Size(0x10) ]
	void SetCustomPrimitiveDataVector3(int32_t DataIndex, struct FVector Value);

	// Object: Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector2
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa661344
	// Params: [ Num(2) Size(0xC) ]
	void SetCustomPrimitiveDataVector2(int32_t DataIndex, struct FVector2D Value);

	// Object: Function Engine.PrimitiveComponent.SetCustomPrimitiveDataFloat
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa661428
	// Params: [ Num(2) Size(0x8) ]
	void SetCustomPrimitiveDataFloat(int32_t DataIndex, float Value);

	// Object: Function Engine.PrimitiveComponent.SetCustomDepthStencilWriteMask
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65ca5c
	// Params: [ Num(1) Size(0x1) ]
	void SetCustomDepthStencilWriteMask(enum class ERendererStencilMask WriteMaskBit);

	// Object: Function Engine.PrimitiveComponent.SetCustomDepthStencilValue
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65cb04
	// Params: [ Num(1) Size(0x4) ]
	void SetCustomDepthStencilValue(int32_t Value);

	// Object: Function Engine.PrimitiveComponent.SetCullDistance
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65b1d0
	// Params: [ Num(1) Size(0x4) ]
	void SetCullDistance(float NewCullDistance);

	// Object: Function Engine.PrimitiveComponent.SetConstraintMode
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa660408
	// Params: [ Num(1) Size(0x1) ]
	void SetConstraintMode(uint8_t ConstraintMode);

	// Object: Function Engine.PrimitiveComponent.SetCollisionResponseToChannel
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65b3d8
	// Params: [ Num(2) Size(0x2) ]
	void SetCollisionResponseToChannel(uint8_t Channel, uint8_t NewResponse);

	// Object: Function Engine.PrimitiveComponent.SetCollisionResponseToAllChannels
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65b328
	// Params: [ Num(1) Size(0x1) ]
	void SetCollisionResponseToAllChannels(uint8_t NewResponse);

	// Object: Function Engine.PrimitiveComponent.SetCollisionProfileName
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65da18
	// Params: [ Num(2) Size(0x9) ]
	void SetCollisionProfileName(struct FName InCollisionProfileName, bool bUpdateOverlaps);

	// Object: Function Engine.PrimitiveComponent.SetCollisionObjectType
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65d934
	// Params: [ Num(1) Size(0x1) ]
	void SetCollisionObjectType(uint8_t Channel);

	// Object: Function Engine.PrimitiveComponent.SetCollisionEnabled
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65db10
	// Params: [ Num(1) Size(0x1) ]
	void SetCollisionEnabled(uint8_t NewType);

	// Object: Function Engine.PrimitiveComponent.SetCenterOfMass
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65e3f8
	// Params: [ Num(2) Size(0x14) ]
	void SetCenterOfMass(struct FVector CenterOfMassOffset, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.SetCastShadow
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65dfd8
	// Params: [ Num(1) Size(0x1) ]
	void SetCastShadow(bool NewCastShadow);

	// Object: Function Engine.PrimitiveComponent.SetCastInsetShadow
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65df28
	// Params: [ Num(1) Size(0x1) ]
	void SetCastInsetShadow(bool bInCastInsetShadow);

	// Object: Function Engine.PrimitiveComponent.SetBoundsScale
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa660cec
	// Params: [ Num(1) Size(0x4) ]
	void SetBoundsScale(float NewBoundsScale);

	// Object: Function Engine.PrimitiveComponent.SetAngularDamping
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65bc78
	// Params: [ Num(1) Size(0x4) ]
	void SetAngularDamping(float InDamping);

	// Object: Function Engine.PrimitiveComponent.SetAllUseCCD
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65b508
	// Params: [ Num(1) Size(0x1) ]
	void SetAllUseCCD(bool InUseCCD);

	// Object: Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65ef50
	// Params: [ Num(2) Size(0xD) ]
	void SetAllPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent);

	// Object: Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInRadians
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa65bf28
	// Params: [ Num(2) Size(0xD) ]
	void SetAllPhysicsAngularVelocityInRadians(struct FVector& NewAngVel, bool bAddToCurrent);

	// Object: Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInDegrees
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa65c028
	// Params: [ Num(2) Size(0xD) ]
	void SetAllPhysicsAngularVelocityInDegrees(struct FVector& NewAngVel, bool bAddToCurrent);

	// Object: Function Engine.PrimitiveComponent.SetAllMassScale
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa65b9e4
	// Params: [ Num(1) Size(0x4) ]
	void SetAllMassScale(float InMassScale);

	// Object: Function Engine.PrimitiveComponent.ScaleByMomentOfInertia
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65b6b8
	// Params: [ Num(3) Size(0x20) ]
	struct FVector ScaleByMomentOfInertia(struct FVector InputVector, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.PutRigidBodyToSleep
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa65e2a0
	// Params: [ Num(1) Size(0x8) ]
	void PutRigidBodyToSleep(struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.K2_SphereTraceComponent
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa65d2b4
	// Params: [ Num(11) Size(0xC9) ]
	bool K2_SphereTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, float SphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit);

	// Object: Function Engine.PrimitiveComponent.K2_SphereOverlapComponent
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa65cc5c
	// Params: [ Num(10) Size(0xBD) ]
	bool K2_SphereOverlapComponent(struct FVector InSphereCentre, float InSphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit);

	// Object: Function Engine.PrimitiveComponent.K2_LineTraceComponent
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa65d614
	// Params: [ Num(10) Size(0xC5) ]
	bool K2_LineTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit);

	// Object: Function Engine.PrimitiveComponent.K2_IsQueryCollisionEnabled
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65c2a8
	// Params: [ Num(1) Size(0x1) ]
	bool K2_IsQueryCollisionEnabled();

	// Object: Function Engine.PrimitiveComponent.K2_IsPhysicsCollisionEnabled
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65c260
	// Params: [ Num(1) Size(0x1) ]
	bool K2_IsPhysicsCollisionEnabled();

	// Object: Function Engine.PrimitiveComponent.K2_IsCollisionEnabled
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65c2f0
	// Params: [ Num(1) Size(0x1) ]
	bool K2_IsCollisionEnabled();

	// Object: Function Engine.PrimitiveComponent.K2_BoxOverlapComponent
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa65cf7c
	// Params: [ Num(10) Size(0xD5) ]
	bool K2_BoxOverlapComponent(struct FVector InBoxCentre, struct FBox InBox, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit);

	// Object: Function Engine.PrimitiveComponent.IsOverlappingComponent
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa66100c
	// Params: [ Num(2) Size(0x9) ]
	bool IsOverlappingComponent(struct UPrimitiveComponent* OtherComp);

	// Object: Function Engine.PrimitiveComponent.IsOverlappingActor
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa660f58
	// Params: [ Num(2) Size(0x9) ]
	bool IsOverlappingActor(struct AActor* Other);

	// Object: Function Engine.PrimitiveComponent.IsGravityEnabled
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65be14
	// Params: [ Num(1) Size(0x1) ]
	bool IsGravityEnabled();

	// Object: Function Engine.PrimitiveComponent.IsAnyRigidBodyAwake
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa65b4c8
	// Params: [ Num(1) Size(0x1) ]
	bool IsAnyRigidBodyAwake();

	// Object: Function Engine.PrimitiveComponent.IgnoreComponentWhenMoving
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6615d8
	// Params: [ Num(2) Size(0x9) ]
	void IgnoreComponentWhenMoving(struct UPrimitiveComponent* Component, bool bShouldIgnore);

	// Object: Function Engine.PrimitiveComponent.IgnoreActorWhenMoving
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa661778
	// Params: [ Num(2) Size(0x9) ]
	void IgnoreActorWhenMoving(struct AActor* Actor, bool bShouldIgnore);

	// Object: Function Engine.PrimitiveComponent.GetWalkableSlopeOverride
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa660638
	// Params: [ Num(1) Size(0x10) ]
	struct FWalkableSlopeOverride GetWalkableSlopeOverride();

	// Object: Function Engine.PrimitiveComponent.GetPhysicsLinearVelocityAtPoint
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65f048
	// Params: [ Num(3) Size(0x20) ]
	struct FVector GetPhysicsLinearVelocityAtPoint(struct FVector Point, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65f13c
	// Params: [ Num(2) Size(0x14) ]
	struct FVector GetPhysicsLinearVelocity(struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInRadians
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65e594
	// Params: [ Num(2) Size(0x14) ]
	struct FVector GetPhysicsAngularVelocityInRadians(struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInDegrees
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65e648
	// Params: [ Num(2) Size(0x14) ]
	struct FVector GetPhysicsAngularVelocityInDegrees(struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65e710
	// Params: [ Num(2) Size(0x14) ]
	struct FVector GetPhysicsAngularVelocity(struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.GetOverlappingComponents
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa660d94
	// Params: [ Num(1) Size(0x10) ]
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*>& OutOverlappingComponents);

	// Object: Function Engine.PrimitiveComponent.GetOverlappingActors
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa660e54
	// Params: [ Num(2) Size(0x18) ]
	void GetOverlappingActors(struct TArray<struct AActor*>& OverlappingActors, struct AActor* ClassFilter);

	// Object: Function Engine.PrimitiveComponent.GetNumMaterials
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65c4b8
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetNumMaterials();

	// Object: Function Engine.PrimitiveComponent.GetMaterialFromCollisionFaceIndex
	// Flags: [Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa660670
	// Params: [ Num(3) Size(0x10) ]
	struct UMaterialInterface* GetMaterialFromCollisionFaceIndex(int32_t FaceIndex, int32_t& SectionIndex);

	// Object: Function Engine.PrimitiveComponent.GetMaterial
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa660c34
	// Params: [ Num(2) Size(0x10) ]
	struct UMaterialInterface* GetMaterial(int32_t ElementIndex);

	// Object: Function Engine.PrimitiveComponent.GetMassScale
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65ba94
	// Params: [ Num(2) Size(0xC) ]
	float GetMassScale(struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.GetMass
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65b870
	// Params: [ Num(1) Size(0x4) ]
	float GetMass();

	// Object: Function Engine.PrimitiveComponent.GetLinearDamping
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65bd28
	// Params: [ Num(1) Size(0x4) ]
	float GetLinearDamping();

	// Object: Function Engine.PrimitiveComponent.GetInertiaTensor
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65b7b4
	// Params: [ Num(2) Size(0x14) ]
	struct FVector GetInertiaTensor(struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.GetGenerateOverlapEvents
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa661b28
	// Params: [ Num(1) Size(0x1) ]
	bool GetGenerateOverlapEvents();

	// Object: Function Engine.PrimitiveComponent.GetCollisionResponseToChannel
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65c1a8
	// Params: [ Num(2) Size(0x2) ]
	uint8_t GetCollisionResponseToChannel(uint8_t Channel);

	// Object: Function Engine.PrimitiveComponent.GetCollisionProfileName
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65d9e4
	// Params: [ Num(1) Size(0x8) ]
	struct FName GetCollisionProfileName();

	// Object: Function Engine.PrimitiveComponent.GetCollisionObjectType
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65c16c
	// Params: [ Num(1) Size(0x1) ]
	uint8_t GetCollisionObjectType();

	// Object: Function Engine.PrimitiveComponent.GetCollisionEnabled
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65c334
	// Params: [ Num(1) Size(0x1) ]
	uint8_t GetCollisionEnabled();

	// Object: Function Engine.PrimitiveComponent.GetClosestPointOnCollision
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65c370
	// Params: [ Num(4) Size(0x24) ]
	float GetClosestPointOnCollision(struct FVector& Point, struct FVector& OutPointOnBody, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.GetCenterOfMass
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65e4e0
	// Params: [ Num(2) Size(0x14) ]
	struct FVector GetCenterOfMass(struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.GetAngularDamping
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65bc3c
	// Params: [ Num(1) Size(0x4) ]
	float GetAngularDamping();

	// Object: Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa660774
	// Params: [ Num(4) Size(0x20) ]
	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(int32_t ElementIndex, struct UMaterialInterface* SourceMaterial, struct FName OptionalName);

	// Object: Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa6608a8
	// Params: [ Num(3) Size(0x18) ]
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(int32_t ElementIndex, struct UMaterialInterface* Parent);

	// Object: Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa6609a0
	// Params: [ Num(2) Size(0x10) ]
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(int32_t ElementIndex);

	// Object: Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreComponents
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa66153c
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<struct UPrimitiveComponent*> CopyArrayOfMoveIgnoreComponents();

	// Object: Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6616dc
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<struct AActor*> CopyArrayOfMoveIgnoreActors();

	// Object: Function Engine.PrimitiveComponent.ClearVisibilityId
	// Flags: [Final|Native|Public]
	// Offset: 0xa66191c
	// Params: [ Num(0) Size(0x0) ]
	void ClearVisibilityId();

	// Object: Function Engine.PrimitiveComponent.ClearMoveIgnoreComponents
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa661510
	// Params: [ Num(0) Size(0x0) ]
	void ClearMoveIgnoreComponents();

	// Object: Function Engine.PrimitiveComponent.ClearMoveIgnoreActors
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6616c8
	// Params: [ Num(0) Size(0x0) ]
	void ClearMoveIgnoreActors();

	// Object: Function Engine.PrimitiveComponent.CanCharacterStepUp
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa65b114
	// Params: [ Num(2) Size(0x9) ]
	bool CanCharacterStepUp(struct APawn* Pawn);

	// Object: Function Engine.PrimitiveComponent.AddTorqueInRadians
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65f474
	// Params: [ Num(3) Size(0x15) ]
	void AddTorqueInRadians(struct FVector Torque, struct FName BoneName, bool bAccelChange);

	// Object: Function Engine.PrimitiveComponent.AddTorqueInDegrees
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65f328
	// Params: [ Num(3) Size(0x15) ]
	void AddTorqueInDegrees(struct FVector Torque, struct FName BoneName, bool bAccelChange);

	// Object: Function Engine.PrimitiveComponent.AddTorque
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65f5ac
	// Params: [ Num(3) Size(0x15) ]
	void AddTorque(struct FVector Torque, struct FName BoneName, bool bAccelChange);

	// Object: Function Engine.PrimitiveComponent.AddRadialImpulse
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65fc30
	// Params: [ Num(5) Size(0x16) ]
	void AddRadialImpulse(struct FVector Origin, float Radius, float Strength, uint8_t Falloff, bool bVelChange);

	// Object: Function Engine.PrimitiveComponent.AddRadialForce
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65f6e4
	// Params: [ Num(5) Size(0x16) ]
	void AddRadialForce(struct FVector Origin, float Radius, float Strength, uint8_t Falloff, bool bAccelChange);

	// Object: Function Engine.PrimitiveComponent.AddImpulseAtLocation
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65fde4
	// Params: [ Num(3) Size(0x20) ]
	void AddImpulseAtLocation(struct FVector Impulse, struct FVector Location, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.AddImpulse
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa6602d0
	// Params: [ Num(3) Size(0x15) ]
	void AddImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange);

	// Object: Function Engine.PrimitiveComponent.AddForceAtLocationLocal
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65f898
	// Params: [ Num(3) Size(0x20) ]
	void AddForceAtLocationLocal(struct FVector Force, struct FVector Location, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.AddForceAtLocation
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65f9c8
	// Params: [ Num(3) Size(0x20) ]
	void AddForceAtLocation(struct FVector Force, struct FVector Location, struct FName BoneName);

	// Object: Function Engine.PrimitiveComponent.AddForce
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65faf8
	// Params: [ Num(3) Size(0x15) ]
	void AddForce(struct FVector Force, struct FName BoneName, bool bAccelChange);

	// Object: Function Engine.PrimitiveComponent.AddAngularImpulseInRadians
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa660060
	// Params: [ Num(3) Size(0x15) ]
	void AddAngularImpulseInRadians(struct FVector Impulse, struct FName BoneName, bool bVelChange);

	// Object: Function Engine.PrimitiveComponent.AddAngularImpulseInDegrees
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa65ff14
	// Params: [ Num(3) Size(0x15) ]
	void AddAngularImpulseInDegrees(struct FVector Impulse, struct FName BoneName, bool bVelChange);

	// Object: Function Engine.PrimitiveComponent.AddAngularImpulse
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa660198
	// Params: [ Num(3) Size(0x15) ]
	void AddAngularImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange);
};

// Object: Class Engine.MeshComponent
// Size: 0x700 (Inherited: 0x5F0)
struct UMeshComponent : UPrimitiveComponent
{
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0x5F0(0x10)
	bool bEnablePerSectionMultipass; // 0x600(0x1)
	uint8_t Pad_0x601[0x3]; // 0x601(0x3)
	int32_t MaxPerSectionMultipassDrawCount; // 0x604(0x4)
	struct TArray<struct UMaterialInterface*> PerSectionMultipassMaterials; // 0x608(0x10)
	uint8_t Pad_0x618[0x50]; // 0x618(0x50)
	bool bNeedMultiplePass; // 0x668(0x1)
	bool bForceFrontFaceCull; // 0x669(0x1)
	bool bIgnoreTranslucentSection; // 0x66A(0x1)
	bool bIgnoreMaskedSection; // 0x66B(0x1)
	int32_t MultiplePassTranslucencySortPriority; // 0x66C(0x4)
	struct UMaterialInterface* MultiplePassMaterial; // 0x670(0x8)
	struct TArray<struct FMultipassAttribute> AdditionalMultiplePassAttributes; // 0x678(0x10)
	struct TArray<struct FPerSectionMultipassAttribute> PerSectionMultipassAttributes; // 0x688(0x10)
	uint8_t Pad_0x698[0x60]; // 0x698(0x60)
	uint8_t bEnableMaterialParameterCaching : 1; // 0x6F8(0x1), Mask(0x1)
	uint8_t BitPad_0x6F8_1 : 7; // 0x6F8(0x1)
	uint8_t Pad_0x6F9[0x7]; // 0x6F9(0x7)


	// Object: Function Engine.MeshComponent.SetVectorParameterValueOnMaterials
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa5fead0
	// Params: [ Num(2) Size(0x14) ]
	void SetVectorParameterValueOnMaterials(struct FName ParameterName, struct FVector ParameterValue);

	// Object: Function Engine.MeshComponent.SetScalarParameterValueOnMaterials
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa5febb8
	// Params: [ Num(2) Size(0xC) ]
	void SetScalarParameterValueOnMaterials(struct FName ParameterName, float ParameterValue);

	// Object: Function Engine.MeshComponent.SetPerSectionMultipassState
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa5fedd8
	// Params: [ Num(2) Size(0x8) ]
	void SetPerSectionMultipassState(bool Enable, int32_t MaxCount);

	// Object: Function Engine.MeshComponent.SetPerSectionMultipassMaterial
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa5ff1a0
	// Params: [ Num(3) Size(0x11) ]
	void SetPerSectionMultipassMaterial(int32_t Index, struct UMaterialInterface* Material, bool bEnableMultiPass);

	// Object: Function Engine.MeshComponent.SetMultiSubpassAttributes
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa5ff390
	// Params: [ Num(2) Size(0x18) ]
	void SetMultiSubpassAttributes(int32_t ElementIndex, struct FMultipassAttribute MultiAttribute);

	// Object: Function Engine.MeshComponent.SetMultipleSubpassMaterial
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa5ff538
	// Params: [ Num(2) Size(0x10) ]
	void SetMultipleSubpassMaterial(int32_t Index, struct UMaterialInterface* Material);

	// Object: Function Engine.MeshComponent.PrestreamTextures
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa5feca0
	// Params: [ Num(3) Size(0xC) ]
	void PrestreamTextures(float Seconds, bool bPrioritizeCharacterTextures, int32_t CinematicTextureGroups);

	// Object: Function Engine.MeshComponent.IsMaterialSlotNameValid
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa5feec8
	// Params: [ Num(2) Size(0x9) ]
	bool IsMaterialSlotNameValid(struct FName MaterialSlotName);

	// Object: Function Engine.MeshComponent.GetPerSectionMultipassMaterial
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa5ff2d8
	// Params: [ Num(2) Size(0x10) ]
	struct UMaterialInterface* GetPerSectionMultipassMaterial(int32_t Index);

	// Object: Function Engine.MeshComponent.GetMultipleSubpassMaterial
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa5ff480
	// Params: [ Num(2) Size(0x10) ]
	struct UMaterialInterface* GetMultipleSubpassMaterial(int32_t Index);

	// Object: Function Engine.MeshComponent.GetMaterialSlotNames
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa5fef84
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<struct FName> GetMaterialSlotNames();

	// Object: Function Engine.MeshComponent.GetMaterials
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa5ff0e0
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<struct UMaterialInterface*> GetMaterials();

	// Object: Function Engine.MeshComponent.GetMaterialIndex
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa5ff028
	// Params: [ Num(2) Size(0xC) ]
	int32_t GetMaterialIndex(struct FName MaterialSlotName);

	// Object: Function Engine.MeshComponent.ClearAllPerSectionMultipassMaterials
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa5ff184
	// Params: [ Num(0) Size(0x0) ]
	void ClearAllPerSectionMultipassMaterials();
};

// Object: Class Engine.SkinnedMeshComponent
// Size: 0x910 (Inherited: 0x700)
struct USkinnedMeshComponent : UMeshComponent
{
	struct USkeletalMesh* SkeletalMesh; // 0x700(0x8)
	struct TWeakObjectPtr<struct USkinnedMeshComponent> MasterPoseComponent; // 0x708(0x8)
	struct TArray<enum class ESkinCacheUsage> SkinCacheUsage; // 0x710(0x10)
	uint8_t Pad_0x720[0xF8]; // 0x720(0xF8)
	struct UPhysicsAsset* PhysicsAssetOverride; // 0x818(0x8)
	int32_t ForcedLodModel; // 0x820(0x4)
	int32_t MinLodModel; // 0x824(0x4)
	uint8_t Pad_0x828[0xC]; // 0x828(0xC)
	float StreamingDistanceMultiplier; // 0x834(0x4)
	uint8_t Pad_0x838[0x8]; // 0x838(0x8)
	struct TArray<struct FSkelMeshComponentLODInfo> LODInfo; // 0x840(0x10)
	uint8_t Pad_0x850[0x24]; // 0x850(0x24)
	enum class EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x874(0x1)
	uint8_t Pad_0x875[0x1]; // 0x875(0x1)
	uint8_t BitPad_0x876_0 : 2; // 0x876(0x1)
	uint8_t bOverrideMinLOD : 1; // 0x876(0x1), Mask(0x4)
	uint8_t bUseBoundsFromMasterPoseComponent : 1; // 0x876(0x1), Mask(0x8)
	uint8_t bForceWireframe : 1; // 0x876(0x1), Mask(0x10)
	uint8_t bDisplayBones : 1; // 0x876(0x1), Mask(0x20)
	uint8_t bDisableMorphTarget : 1; // 0x876(0x1), Mask(0x40)
	uint8_t bHideSkin : 1; // 0x876(0x1), Mask(0x80)
	uint8_t bPerBoneMotionBlur : 1; // 0x877(0x1), Mask(0x1)
	uint8_t bComponentUseFixedSkelBounds : 1; // 0x877(0x1), Mask(0x2)
	uint8_t bConsiderAllBodiesForBounds : 1; // 0x877(0x1), Mask(0x4)
	uint8_t bOverrideMeshMinScreenSize : 1; // 0x877(0x1), Mask(0x8)
	uint8_t bSyncAttachParentLOD : 1; // 0x877(0x1), Mask(0x10)
	uint8_t bCanHighlightSelectedSections : 1; // 0x877(0x1), Mask(0x20)
	uint8_t bRecentlyRendered : 1; // 0x877(0x1), Mask(0x40)
	uint8_t bCastCapsuleDirectShadow : 1; // 0x877(0x1), Mask(0x80)
	uint8_t bCastCapsuleIndirectShadow : 1; // 0x878(0x1), Mask(0x1)
	uint8_t bCPUSkinning : 1; // 0x878(0x1), Mask(0x2)
	uint8_t bEnableUpdateRateOptimizations : 1; // 0x878(0x1), Mask(0x4)
	uint8_t bDisplayDebugUpdateRateOptimizations : 1; // 0x878(0x1), Mask(0x8)
	uint8_t bRenderStatic : 1; // 0x878(0x1), Mask(0x10)
	uint8_t bIgnoreMasterPoseComponentLOD : 1; // 0x878(0x1), Mask(0x20)
	uint8_t BitPad_0x878_6 : 2; // 0x878(0x1)
	uint8_t bCachedLocalBoundsUpToDate : 1; // 0x879(0x1), Mask(0x1)
	uint8_t BitPad_0x879_1 : 1; // 0x879(0x1)
	uint8_t bForceMeshObjectUpdate : 1; // 0x879(0x1), Mask(0x4)
	uint8_t BitPad_0x879_3 : 5; // 0x879(0x1)
	uint8_t Pad_0x87A[0x2]; // 0x87A(0x2)
	float CapsuleIndirectShadowMinVisibility; // 0x87C(0x4)
	uint8_t Pad_0x880[0x14]; // 0x880(0x14)
	struct FBoxSphereBounds CachedWorldSpaceBounds; // 0x894(0x1C)
	struct FMatrix CachedWorldToLocalTransform; // 0x8B0(0x40)
	bool bCanUsePhysicsAssetToCalcBound; // 0x8F0(0x1)
	uint8_t Pad_0x8F1[0x1F]; // 0x8F1(0x1F)


	// Object: Function Engine.SkinnedMeshComponent.UnloadSkinWeightProfile
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68e4b4
	// Params: [ Num(1) Size(0x8) ]
	void UnloadSkinWeightProfile(struct FName InProfileName);

	// Object: Function Engine.SkinnedMeshComponent.UnHideBoneByName
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68db5c
	// Params: [ Num(1) Size(0x8) ]
	void UnHideBoneByName(struct FName BoneName);

	// Object: Function Engine.SkinnedMeshComponent.TransformToBoneSpace
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68e02c
	// Params: [ Num(5) Size(0x38) ]
	void TransformToBoneSpace(struct FName BoneName, struct FVector InPosition, struct FRotator InRotation, struct FVector& OutPosition, struct FRotator& OutRotation);

	// Object: Function Engine.SkinnedMeshComponent.TransformFromBoneSpace
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa68de74
	// Params: [ Num(5) Size(0x38) ]
	void TransformFromBoneSpace(struct FName BoneName, struct FVector InPosition, struct FRotator InRotation, struct FVector& OutPosition, struct FRotator& OutRotation);

	// Object: Function Engine.SkinnedMeshComponent.ShowMaterialSection
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68d938
	// Params: [ Num(4) Size(0x10) ]
	void ShowMaterialSection(int32_t MaterialID, int32_t SectionIndex, bool bShow, int32_t LODIndex);

	// Object: Function Engine.SkinnedMeshComponent.ShowAllMaterialSections
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68d890
	// Params: [ Num(1) Size(0x4) ]
	void ShowAllMaterialSections(int32_t LODIndex);

	// Object: Function Engine.SkinnedMeshComponent.SetVertexColorOverride_LinearColor
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa68e874
	// Params: [ Num(2) Size(0x18) ]
	void SetVertexColorOverride_LinearColor(int32_t LODIndex, struct TArray<struct FLinearColor>& VertexColors);

	// Object: Function Engine.SkinnedMeshComponent.SetSkinWeightProfile
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68e570
	// Params: [ Num(2) Size(0x9) ]
	bool SetSkinWeightProfile(struct FName InProfileName);

	// Object: Function Engine.SkinnedMeshComponent.SetSkinWeightOverride
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa68e6cc
	// Params: [ Num(2) Size(0x18) ]
	void SetSkinWeightOverride(int32_t LODIndex, struct TArray<struct FSkelMeshSkinWeightInfo>& SkinWeights);

	// Object: Function Engine.SkinnedMeshComponent.SetSkeletalMesh
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa68ec74
	// Params: [ Num(3) Size(0xA) ]
	void SetSkeletalMesh(struct USkeletalMesh* NewMesh, bool bReinitPose, bool bForceSkipTickAnimation);

	// Object: Function Engine.SkinnedMeshComponent.SetRenderStatic
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68d6f0
	// Params: [ Num(1) Size(0x1) ]
	void SetRenderStatic(bool bNewValue);

	// Object: Function Engine.SkinnedMeshComponent.SetPhysicsAsset
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa68f3fc
	// Params: [ Num(2) Size(0x9) ]
	void SetPhysicsAsset(struct UPhysicsAsset* NewPhysicsAsset, bool bForceReInit);

	// Object: Function Engine.SkinnedMeshComponent.SetMinLOD
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68f2dc
	// Params: [ Num(2) Size(0x5) ]
	void SetMinLOD(int32_t InNewMinLOD, bool bConsiderPlatformMinLod);

	// Object: Function Engine.SkinnedMeshComponent.SetMasterPoseComponent
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68e388
	// Params: [ Num(2) Size(0x9) ]
	void SetMasterPoseComponent(struct USkinnedMeshComponent* NewMasterBoneComponent, bool bForceUpdate);

	// Object: Function Engine.SkinnedMeshComponent.SetForcedLOD
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68f234
	// Params: [ Num(1) Size(0x4) ]
	void SetForcedLOD(int32_t InNewForcedLOD);

	// Object: Function Engine.SkinnedMeshComponent.SetCastCapsuleIndirectShadow
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68f0a0
	// Params: [ Num(1) Size(0x1) ]
	void SetCastCapsuleIndirectShadow(bool bNewValue);

	// Object: Function Engine.SkinnedMeshComponent.SetCastCapsuleDirectShadow
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68f150
	// Params: [ Num(1) Size(0x1) ]
	void SetCastCapsuleDirectShadow(bool bNewValue);

	// Object: Function Engine.SkinnedMeshComponent.SetCapsuleIndirectShadowMinVisibility
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68eff8
	// Params: [ Num(1) Size(0x4) ]
	void SetCapsuleIndirectShadowMinVisibility(float NewValue);

	// Object: Function Engine.SkinnedMeshComponent.IsUsingSkinWeightProfile
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68e478
	// Params: [ Num(1) Size(0x1) ]
	bool IsUsingSkinWeightProfile();

	// Object: Function Engine.SkinnedMeshComponent.IsMaterialSectionShown
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68d7a0
	// Params: [ Num(3) Size(0x9) ]
	bool IsMaterialSectionShown(int32_t MaterialID, int32_t LODIndex);

	// Object: Function Engine.SkinnedMeshComponent.IsBoneHiddenByName
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68daa8
	// Params: [ Num(2) Size(0x9) ]
	bool IsBoneHiddenByName(struct FName BoneName);

	// Object: Function Engine.SkinnedMeshComponent.HideBoneByName
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68dc04
	// Params: [ Num(2) Size(0x9) ]
	void HideBoneByName(struct FName BoneName, uint8_t PhysBodyOption);

	// Object: Function Engine.SkinnedMeshComponent.GetTwistAndSwingAngleOfDeltaRotationFromRefPose
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68e974
	// Params: [ Num(4) Size(0x11) ]
	bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(struct FName BoneName, float& OutTwistAngle, float& OutSwingAngle);

	// Object: Function Engine.SkinnedMeshComponent.GetSocketBoneName
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68edb4
	// Params: [ Num(2) Size(0x10) ]
	struct FName GetSocketBoneName(struct FName InSocketName);

	// Object: Function Engine.SkinnedMeshComponent.GetRefPosePosition
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa68e1e4
	// Params: [ Num(2) Size(0x10) ]
	struct FVector GetRefPosePosition(int32_t BoneIndex);

	// Object: Function Engine.SkinnedMeshComponent.GetParentBone
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68ebc4
	// Params: [ Num(2) Size(0x10) ]
	struct FName GetParentBone(struct FName BoneName);

	// Object: Function Engine.SkinnedMeshComponent.GetNumLODs
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68f3c8
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetNumLODs();

	// Object: Function Engine.SkinnedMeshComponent.GetNumBones
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68efc4
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetNumBones();

	// Object: Function Engine.SkinnedMeshComponent.GetForcedLOD
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68f200
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetForcedLOD();

	// Object: Function Engine.SkinnedMeshComponent.GetDeltaTransformFromRefPose
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68eac8
	// Params: [ Num(3) Size(0x40) ]
	struct FTransform GetDeltaTransformFromRefPose(struct FName BoneName, struct FName BaseName);

	// Object: Function Engine.SkinnedMeshComponent.GetCurrentSkinWeightProfileName
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68e498
	// Params: [ Num(1) Size(0x8) ]
	struct FName GetCurrentSkinWeightProfileName();

	// Object: Function Engine.SkinnedMeshComponent.GetBoneName
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68ee64
	// Params: [ Num(2) Size(0xC) ]
	struct FName GetBoneName(int32_t BoneIndex);

	// Object: Function Engine.SkinnedMeshComponent.GetBoneIndex
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68ef14
	// Params: [ Num(2) Size(0xC) ]
	int32_t GetBoneIndex(struct FName BoneName);

	// Object: Function Engine.SkinnedMeshComponent.FindClosestBone_K2
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68dcec
	// Params: [ Num(5) Size(0x28) ]
	struct FName FindClosestBone_K2(struct FVector TestLocation, struct FVector& BoneLocation, float IgnoreScale, bool bRequirePhysicsAsset);

	// Object: Function Engine.SkinnedMeshComponent.ClearVertexColorOverride
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68e7cc
	// Params: [ Num(1) Size(0x4) ]
	void ClearVertexColorOverride(int32_t LODIndex);

	// Object: Function Engine.SkinnedMeshComponent.ClearSkinWeightProfile
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68e55c
	// Params: [ Num(0) Size(0x0) ]
	void ClearSkinWeightProfile();

	// Object: Function Engine.SkinnedMeshComponent.ClearSkinWeightOverride
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68e624
	// Params: [ Num(1) Size(0x4) ]
	void ClearSkinWeightOverride(int32_t LODIndex);

	// Object: Function Engine.SkinnedMeshComponent.BoneIsChildOf
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68e298
	// Params: [ Num(3) Size(0x11) ]
	bool BoneIsChildOf(struct FName BoneName, struct FName ParentBoneName);
};

// Object: Class Engine.SkeletalMeshComponent
// Size: 0xDB0 (Inherited: 0x910)
struct USkeletalMeshComponent : USkinnedMeshComponent
{
	uint8_t Pad_0x910[0x8]; // 0x910(0x8)
	struct UObject* AnimBlueprintGeneratedClass; // 0x918(0x8)
	struct UAnimInstance* AnimClass; // 0x920(0x8)
	struct UAnimInstance* AnimScriptInstance; // 0x928(0x8)
	struct UAnimInstance* PostProcessAnimInstance; // 0x930(0x8)
	struct FSingleAnimationPlayData AnimationData; // 0x938(0x18)
	uint8_t Pad_0x950[0x10]; // 0x950(0x10)
	struct FVector RootBoneTranslation; // 0x960(0xC)
	struct FVector LineCheckBoundsScale; // 0x96C(0xC)
	uint8_t Pad_0x978[0x20]; // 0x978(0x20)
	struct TArray<struct UAnimInstance*> LinkedInstances; // 0x998(0x10)
	struct TArray<struct FTransform> CachedBoneSpaceTransforms; // 0x9A8(0x10)
	struct TArray<struct FTransform> CachedComponentSpaceTransforms; // 0x9B8(0x10)
	uint8_t Pad_0x9C8[0x20]; // 0x9C8(0x20)
	float GlobalAnimRateScale; // 0x9E8(0x4)
	uint8_t KinematicBonesUpdateType; // 0x9EC(0x1)
	uint8_t PhysicsTransformUpdateMode; // 0x9ED(0x1)
	uint8_t Pad_0x9EE[0x1]; // 0x9EE(0x1)
	uint8_t AnimationMode; // 0x9EF(0x1)
	uint8_t Pad_0x9F0[0x1]; // 0x9F0(0x1)
	uint8_t bDisablePostProcessBlueprint : 1; // 0x9F1(0x1), Mask(0x1)
	uint8_t BitPad_0x9F1_1 : 1; // 0x9F1(0x1)
	uint8_t bUpdateOverlapsOnAnimationFinalize : 1; // 0x9F1(0x1), Mask(0x4)
	uint8_t BitPad_0x9F1_3 : 1; // 0x9F1(0x1)
	uint8_t bHasValidBodies : 1; // 0x9F1(0x1), Mask(0x10)
	uint8_t BitPad_0x9F1_5 : 1; // 0x9F1(0x1)
	uint8_t bBlendPhysics : 1; // 0x9F1(0x1), Mask(0x40)
	uint8_t bEnablePhysicsOnDedicatedServer : 1; // 0x9F1(0x1), Mask(0x80)
	uint8_t bUpdateJointsFromAnimation : 1; // 0x9F2(0x1), Mask(0x1)
	uint8_t bDisableClothSimulation : 1; // 0x9F2(0x1), Mask(0x2)
	uint8_t bDisableRigidBodyAnimNode : 1; // 0x9F2(0x1), Mask(0x4)
	uint8_t bAllowAnimCurveEvaluation : 1; // 0x9F2(0x1), Mask(0x8)
	uint8_t bDisableAnimCurves : 1; // 0x9F2(0x1), Mask(0x10)
	uint8_t BitPad_0x9F2_5 : 3; // 0x9F2(0x1)
	uint8_t bCollideWithEnvironment : 1; // 0x9F3(0x1), Mask(0x1)
	uint8_t bCollideWithAttachedChildren : 1; // 0x9F3(0x1), Mask(0x2)
	uint8_t bLocalSpaceSimulation : 1; // 0x9F3(0x1), Mask(0x4)
	uint8_t bResetAfterTeleport : 1; // 0x9F3(0x1), Mask(0x8)
	uint8_t BitPad_0x9F3_4 : 1; // 0x9F3(0x1)
	uint8_t bDeferKinematicBoneUpdate : 1; // 0x9F3(0x1), Mask(0x20)
	uint8_t bNoSkeletonUpdate : 1; // 0x9F3(0x1), Mask(0x40)
	uint8_t bPauseAnims : 1; // 0x9F3(0x1), Mask(0x80)
	uint8_t bUseRefPoseOnInitAnim : 1; // 0x9F4(0x1), Mask(0x1)
	uint8_t bEnablePerPolyCollision : 1; // 0x9F4(0x1), Mask(0x2)
	uint8_t BitPad_0x9F4_2 : 6; // 0x9F4(0x1)
	uint8_t Pad_0x9F5[0x7]; // 0x9F5(0x7)
	uint8_t bForceRefpose : 1; // 0x9FC(0x1), Mask(0x1)
	uint8_t bOnlyAllowAutonomousTickPose : 1; // 0x9FC(0x1), Mask(0x2)
	uint8_t bIsAutonomousTickPose : 1; // 0x9FC(0x1), Mask(0x4)
	uint8_t bOldForceRefPose : 1; // 0x9FC(0x1), Mask(0x8)
	uint8_t bShowPrePhysBones : 1; // 0x9FC(0x1), Mask(0x10)
	uint8_t bRequiredBonesUpToDate : 1; // 0x9FC(0x1), Mask(0x20)
	uint8_t bAnimTreeInitialised : 1; // 0x9FC(0x1), Mask(0x40)
	uint8_t bIncludeComponentLocationIntoBounds : 1; // 0x9FC(0x1), Mask(0x80)
	uint8_t bEnableLineCheckWithBounds : 1; // 0x9FD(0x1), Mask(0x1)
	uint8_t bUseBendingElements : 1; // 0x9FD(0x1), Mask(0x2)
	uint8_t bUseTetrahedralConstraints : 1; // 0x9FD(0x1), Mask(0x4)
	uint8_t bUseThinShellVolumeConstraints : 1; // 0x9FD(0x1), Mask(0x8)
	uint8_t bUseSelfCollisions : 1; // 0x9FD(0x1), Mask(0x10)
	uint8_t bUseContinuousCollisionDetection : 1; // 0x9FD(0x1), Mask(0x20)
	uint8_t bPropagateCurvesToSlaves : 1; // 0x9FD(0x1), Mask(0x40)
	uint8_t bSkipKinematicUpdateWhenInterpolating : 1; // 0x9FD(0x1), Mask(0x80)
	uint8_t bSkipBoundsUpdateWhenInterpolating : 1; // 0x9FE(0x1), Mask(0x1)
	uint8_t BitPad_0x9FE_1 : 1; // 0x9FE(0x1)
	uint8_t bNeedsQueuedAnimEventsDispatched : 1; // 0x9FE(0x1), Mask(0x4)
	uint8_t BitPad_0x9FE_3 : 5; // 0x9FE(0x1)
	uint8_t Pad_0x9FF[0x1]; // 0x9FF(0x1)
	uint16_t CachedAnimCurveUidVersion; // 0xA00(0x2)
	enum class EClothMassMode MassMode; // 0xA02(0x1)
	uint8_t Pad_0xA03[0x1]; // 0xA03(0x1)
	float UniformMass; // 0xA04(0x4)
	float TotalMass; // 0xA08(0x4)
	float Density; // 0xA0C(0x4)
	float MinPerParticleMass; // 0xA10(0x4)
	float ClothBlendWeight; // 0xA14(0x4)
	float EdgeStiffness; // 0xA18(0x4)
	float BendingStiffness; // 0xA1C(0x4)
	float AreaStiffness; // 0xA20(0x4)
	float VolumeStiffness; // 0xA24(0x4)
	float StrainLimitingStiffness; // 0xA28(0x4)
	float ShapeTargetStiffness; // 0xA2C(0x4)
	struct TArray<struct FName> DisallowedAnimCurves; // 0xA30(0x10)
	struct UBodySetup* BodySetup; // 0xA40(0x8)
	uint8_t Pad_0xA48[0x8]; // 0xA48(0x8)
	struct FMulticastInlineDelegate OnConstraintBroken; // 0xA50(0x10)
	struct UClothingSimulationFactory* ClothingSimulationFactory; // 0xA60(0x8)
	uint8_t Pad_0xA68[0xD0]; // 0xA68(0xD0)
	float TeleportDistanceThreshold; // 0xB38(0x4)
	float TeleportRotationThreshold; // 0xB3C(0x4)
	uint8_t Pad_0xB40[0x8]; // 0xB40(0x8)
	uint32_t LastPoseTickFrame; // 0xB48(0x4)
	uint8_t Pad_0xB4C[0x54]; // 0xB4C(0x54)
	struct UClothingSimulationInteractor* ClothingInteractor; // 0xBA0(0x8)
	uint8_t Pad_0xBA8[0xD0]; // 0xBA8(0xD0)
	struct FMulticastInlineDelegate OnAnimInitialized; // 0xC78(0x10)
	uint8_t Pad_0xC88[0x128]; // 0xC88(0x128)


	// Object: Function Engine.SkeletalMeshComponent.UnlinkAnimClassLayers
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa688720
	// Params: [ Num(1) Size(0x8) ]
	void UnlinkAnimClassLayers(struct UAnimInstance* InClass);

	// Object: Function Engine.SkeletalMeshComponent.UnbindClothFromMasterPoseComponent
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6878ac
	// Params: [ Num(1) Size(0x1) ]
	void UnbindClothFromMasterPoseComponent(bool bRestoreSimulationSpace);

	// Object: Function Engine.SkeletalMeshComponent.ToggleDisablePostProcessBlueprint
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa688d38
	// Params: [ Num(0) Size(0x0) ]
	void ToggleDisablePostProcessBlueprint();

	// Object: Function Engine.SkeletalMeshComponent.TermBodiesBelow
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa686554
	// Params: [ Num(1) Size(0x8) ]
	void TermBodiesBelow(struct FName ParentBoneName);

	// Object: Function Engine.SkeletalMeshComponent.SuspendClothingSimulation
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6879d0
	// Params: [ Num(0) Size(0x0) ]
	void SuspendClothingSimulation();

	// Object: Function Engine.SkeletalMeshComponent.Stop
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6881a8
	// Params: [ Num(0) Size(0x0) ]
	void Stop();

	// Object: Function Engine.SkeletalMeshComponent.SnapshotPose
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa687ae8
	// Params: [ Num(1) Size(0x38) ]
	void SnapshotPose(struct FPoseSnapshot& Snapshot);

	// Object: Function Engine.SkeletalMeshComponent.SetUpdateAnimationInEditor
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6876dc
	// Params: [ Num(1) Size(0x1) ]
	void SetUpdateAnimationInEditor(bool NewUpdateState);

	// Object: Function Engine.SkeletalMeshComponent.SetTeleportRotationThreshold
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa687244
	// Params: [ Num(1) Size(0x4) ]
	void SetTeleportRotationThreshold(float Threshold);

	// Object: Function Engine.SkeletalMeshComponent.SetTeleportDistanceThreshold
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa687168
	// Params: [ Num(1) Size(0x4) ]
	void SetTeleportDistanceThreshold(float Threshold);

	// Object: Function Engine.SkeletalMeshComponent.SetPosition
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa688080
	// Params: [ Num(2) Size(0x5) ]
	void SetPosition(float InPos, bool bFireNotifies);

	// Object: Function Engine.SkeletalMeshComponent.SetPlayRate
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa687fa4
	// Params: [ Num(1) Size(0x4) ]
	void SetPlayRate(float Rate);

	// Object: Function Engine.SkeletalMeshComponent.SetPhysicsBlendWeight
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6863fc
	// Params: [ Num(1) Size(0x4) ]
	void SetPhysicsBlendWeight(float PhysicsBlendWeight);

	// Object: Function Engine.SkeletalMeshComponent.SetNotifyRigidBodyCollisionBelow
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa686efc
	// Params: [ Num(3) Size(0xD) ]
	void SetNotifyRigidBodyCollisionBelow(bool bNewNotifyRigidBodyCollision, struct FName BoneName, bool bIncludeSelf);

	// Object: Function Engine.SkeletalMeshComponent.SetMorphTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa687c84
	// Params: [ Num(3) Size(0xD) ]
	void SetMorphTarget(struct FName MorphTargetName, float Value, bool bRemoveZeroWeight);

	// Object: Function Engine.SkeletalMeshComponent.SetEnablePhysicsBlending
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68634c
	// Params: [ Num(1) Size(0x1) ]
	void SetEnablePhysicsBlending(bool bNewBlendPhysics);

	// Object: Function Engine.SkeletalMeshComponent.SetEnableGravityOnAllBodiesBelow
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa686c20
	// Params: [ Num(3) Size(0xD) ]
	void SetEnableGravityOnAllBodiesBelow(bool bEnableGravity, struct FName BoneName, bool bIncludeSelf);

	// Object: Function Engine.SkeletalMeshComponent.SetEnableBodyGravity
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa686e0c
	// Params: [ Num(2) Size(0xC) ]
	void SetEnableBodyGravity(bool bEnableGravity, struct FName BoneName);

	// Object: Function Engine.SkeletalMeshComponent.SetDisablePostProcessBlueprint
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa688c50
	// Params: [ Num(1) Size(0x1) ]
	void SetDisablePostProcessBlueprint(bool bInDisablePostProcess);

	// Object: Function Engine.SkeletalMeshComponent.SetDisableAnimCurves
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68762c
	// Params: [ Num(1) Size(0x1) ]
	void SetDisableAnimCurves(bool bInDisableAnimCurves);

	// Object: Function Engine.SkeletalMeshComponent.SetConstraintProfileForAll
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68581c
	// Params: [ Num(2) Size(0x9) ]
	void SetConstraintProfileForAll(struct FName ProfileName, bool bDefaultIfNotFound);

	// Object: Function Engine.SkeletalMeshComponent.SetConstraintProfile
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68590c
	// Params: [ Num(3) Size(0x11) ]
	void SetConstraintProfile(struct FName JointName, struct FName ProfileName, bool bDefaultIfNotFound);

	// Object: Function Engine.SkeletalMeshComponent.SetClothMaxDistanceScale
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa687a0c
	// Params: [ Num(1) Size(0x4) ]
	void SetClothMaxDistanceScale(float Scale);

	// Object: Function Engine.SkeletalMeshComponent.SetBodyNotifyRigidBodyCollision
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa68703c
	// Params: [ Num(2) Size(0xC) ]
	void SetBodyNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision, struct FName BoneName);

	// Object: Function Engine.SkeletalMeshComponent.SetAnimClass
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa688ba0
	// Params: [ Num(1) Size(0x8) ]
	void SetAnimClass(struct UObject* NewClass);

	// Object: Function Engine.SkeletalMeshComponent.SetAnimationMode
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa688438
	// Params: [ Num(1) Size(0x1) ]
	void SetAnimationMode(uint8_t InAnimationMode);

	// Object: Function Engine.SkeletalMeshComponent.SetAnimation
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68826c
	// Params: [ Num(1) Size(0x8) ]
	void SetAnimation(struct UAnimationAsset* NewAnimToPlay);

	// Object: Function Engine.SkeletalMeshComponent.SetAngularLimits
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6854e0
	// Params: [ Num(4) Size(0x14) ]
	void SetAngularLimits(struct FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle);

	// Object: Function Engine.SkeletalMeshComponent.SetAllowRigidBodyAnimNode
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6877b4
	// Params: [ Num(2) Size(0x2) ]
	void SetAllowRigidBodyAnimNode(bool bInAllow, bool bReinitAnim);

	// Object: Function Engine.SkeletalMeshComponent.SetAllowedAnimCurvesEvaluation
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa687320
	// Params: [ Num(2) Size(0x11) ]
	void SetAllowedAnimCurvesEvaluation(struct TArray<struct FName>& List, bool bAllow);

	// Object: Function Engine.SkeletalMeshComponent.SetAllowAnimCurveEvaluation
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa687554
	// Params: [ Num(1) Size(0x1) ]
	void SetAllowAnimCurveEvaluation(bool bInAllow);

	// Object: Function Engine.SkeletalMeshComponent.SetAllMotorsAngularVelocityDrive
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa685ba4
	// Params: [ Num(3) Size(0x3) ]
	void SetAllMotorsAngularVelocityDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType);

	// Object: Function Engine.SkeletalMeshComponent.SetAllMotorsAngularPositionDrive
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa685cec
	// Params: [ Num(3) Size(0x3) ]
	void SetAllMotorsAngularPositionDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType);

	// Object: Function Engine.SkeletalMeshComponent.SetAllMotorsAngularDriveParams
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa685a38
	// Params: [ Num(4) Size(0xD) ]
	void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, bool bSkipCustomPhysicsType);

	// Object: Function Engine.SkeletalMeshComponent.SetAllBodiesSimulatePhysics
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6864a4
	// Params: [ Num(1) Size(0x1) ]
	void SetAllBodiesSimulatePhysics(bool bNewSimulate);

	// Object: Function Engine.SkeletalMeshComponent.SetAllBodiesPhysicsBlendWeight
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6860fc
	// Params: [ Num(2) Size(0x5) ]
	void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool bSkipCustomPhysicsType);

	// Object: Function Engine.SkeletalMeshComponent.SetAllBodiesBelowSimulatePhysics
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa686200
	// Params: [ Num(3) Size(0xA) ]
	void SetAllBodiesBelowSimulatePhysics(struct FName& InBoneName, bool bNewSimulate, bool bIncludeSelf);

	// Object: Function Engine.SkeletalMeshComponent.SetAllBodiesBelowPhysicsBlendWeight
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa685f70
	// Params: [ Num(4) Size(0xE) ]
	void SetAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float PhysicsBlendWeight, bool bSkipCustomPhysicsType, bool bIncludeSelf);

	// Object: Function Engine.SkeletalMeshComponent.ResumeClothingSimulation
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6879bc
	// Params: [ Num(0) Size(0x0) ]
	void ResumeClothingSimulation();

	// Object: Function Engine.SkeletalMeshComponent.ResetClothTeleportMode
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa687970
	// Params: [ Num(0) Size(0x0) ]
	void ResetClothTeleportMode();

	// Object: Function Engine.SkeletalMeshComponent.ResetAnimInstanceDynamics
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6884e0
	// Params: [ Num(1) Size(0x1) ]
	void ResetAnimInstanceDynamics(enum class ETeleportType InTeleportType);

	// Object: Function Engine.SkeletalMeshComponent.ResetAllowedAnimCurveEvaluation
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68742c
	// Params: [ Num(0) Size(0x0) ]
	void ResetAllowedAnimCurveEvaluation();

	// Object: Function Engine.SkeletalMeshComponent.ResetAllBodiesSimulatePhysics
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6861ec
	// Params: [ Num(0) Size(0x0) ]
	void ResetAllBodiesSimulatePhysics();

	// Object: Function Engine.SkeletalMeshComponent.PlayAnimation
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa688314
	// Params: [ Num(2) Size(0x9) ]
	void PlayAnimation(struct UAnimationAsset* NewAnimToPlay, bool bLooping);

	// Object: Function Engine.SkeletalMeshComponent.Play
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6881bc
	// Params: [ Num(1) Size(0x1) ]
	void Play(bool bLooping);

	// Object: Function Engine.SkeletalMeshComponent.OverrideAnimationData
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa687db4
	// Params: [ Num(5) Size(0x14) ]
	void OverrideAnimationData(struct UAnimationAsset* InAnimToPlay, bool bIsLooping, bool bIsPlaying, float Position, float PlayRate);

	// Object: Function Engine.SkeletalMeshComponent.LinkAnimGraphByTag
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa688870
	// Params: [ Num(2) Size(0x10) ]
	void LinkAnimGraphByTag(struct FName InTag, struct UAnimInstance* InClass);

	// Object: Function Engine.SkeletalMeshComponent.LinkAnimClassLayers
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6887c8
	// Params: [ Num(1) Size(0x8) ]
	void LinkAnimClassLayers(struct UAnimInstance* InClass);

	// Object: Function Engine.SkeletalMeshComponent.K2_GetClosestPointOnPhysicsAsset
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa686a2c
	// Params: [ Num(6) Size(0x31) ]
	bool K2_GetClosestPointOnPhysicsAsset(struct FVector& WorldPosition, struct FVector& ClosestWorldPosition, struct FVector& Normal, struct FName& BoneName, float& Distance);

	// Object: Function Engine.SkeletalMeshComponent.IsPlaying
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa688170
	// Params: [ Num(1) Size(0x1) ]
	bool IsPlaying();

	// Object: Function Engine.SkeletalMeshComponent.IsClothingSimulationSuspended
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa687984
	// Params: [ Num(1) Size(0x1) ]
	bool IsClothingSimulationSuspended();

	// Object: Function Engine.SkeletalMeshComponent.IsBodyGravityEnabled
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa686d58
	// Params: [ Num(2) Size(0x9) ]
	bool IsBodyGravityEnabled(struct FName BoneName);

	// Object: Function Engine.SkeletalMeshComponent.HasValidAnimationInstance
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa688588
	// Params: [ Num(1) Size(0x1) ]
	bool HasValidAnimationInstance();

	// Object: Function Engine.SkeletalMeshComponent.GetTeleportRotationThreshold
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6872ec
	// Params: [ Num(1) Size(0x4) ]
	float GetTeleportRotationThreshold();

	// Object: Function Engine.SkeletalMeshComponent.GetTeleportDistanceThreshold
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa687210
	// Params: [ Num(1) Size(0x4) ]
	float GetTeleportDistanceThreshold();

	// Object: Function Engine.SkeletalMeshComponent.GetSkeletalCenterOfMass
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6868fc
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetSkeletalCenterOfMass();

	// Object: Function Engine.SkeletalMeshComponent.GetPostProcessInstance
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa688b04
	// Params: [ Num(1) Size(0x8) ]
	struct UAnimInstance* GetPostProcessInstance();

	// Object: Function Engine.SkeletalMeshComponent.GetPosition
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68804c
	// Params: [ Num(1) Size(0x4) ]
	float GetPosition();

	// Object: Function Engine.SkeletalMeshComponent.GetPlayRate
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa687f70
	// Params: [ Num(1) Size(0x4) ]
	float GetPlayRate();

	// Object: Function Engine.SkeletalMeshComponent.GetMorphTarget
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa687bc0
	// Params: [ Num(2) Size(0xC) ]
	float GetMorphTarget(struct FName MorphTargetName);

	// Object: Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByGroup
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa688670
	// Params: [ Num(2) Size(0x10) ]
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup);

	// Object: Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByClass
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6885c0
	// Params: [ Num(2) Size(0x10) ]
	struct UAnimInstance* GetLinkedAnimLayerInstanceByClass(struct UAnimInstance* InClass);

	// Object: Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstancesByTag
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa688954
	// Params: [ Num(2) Size(0x18) ]
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<struct UAnimInstance*>& OutLinkedInstances);

	// Object: Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstanceByTag
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa688a54
	// Params: [ Num(2) Size(0x10) ]
	struct UAnimInstance* GetLinkedAnimGraphInstanceByTag(struct FName InTag);

	// Object: Function Engine.SkeletalMeshComponent.GetDisablePostProcessBlueprint
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa688d00
	// Params: [ Num(1) Size(0x1) ]
	bool GetDisablePostProcessBlueprint();

	// Object: Function Engine.SkeletalMeshComponent.GetDisableAnimCurves
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa687604
	// Params: [ Num(1) Size(0x1) ]
	bool GetDisableAnimCurves();

	// Object: Function Engine.SkeletalMeshComponent.GetCurrentJointAngles
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa68534c
	// Params: [ Num(4) Size(0x14) ]
	void GetCurrentJointAngles(struct FName InBoneName, float& Swing1Angle, float& TwistAngle, float& Swing2Angle);

	// Object: Function Engine.SkeletalMeshComponent.GetClothMaxDistanceScale
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa687ab4
	// Params: [ Num(1) Size(0x4) ]
	float GetClothMaxDistanceScale();

	// Object: Function Engine.SkeletalMeshComponent.GetClothingSimulationInteractor
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa687134
	// Params: [ Num(1) Size(0x8) ]
	struct UClothingSimulationInteractor* GetClothingSimulationInteractor();

	// Object: Function Engine.SkeletalMeshComponent.GetBoneMass
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa686934
	// Params: [ Num(3) Size(0x10) ]
	float GetBoneMass(struct FName BoneName, bool bScaleMass);

	// Object: Function Engine.SkeletalMeshComponent.GetAnimInstance
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa688b38
	// Params: [ Num(1) Size(0x8) ]
	struct UAnimInstance* GetAnimInstance();

	// Object: Function Engine.SkeletalMeshComponent.GetAnimClass
	// Flags: [Final|Native|Public]
	// Offset: 0xa688b6c
	// Params: [ Num(1) Size(0x8) ]
	struct UObject* GetAnimClass();

	// Object: Function Engine.SkeletalMeshComponent.GetAnimationMode
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa688404
	// Params: [ Num(1) Size(0x1) ]
	uint8_t GetAnimationMode();

	// Object: Function Engine.SkeletalMeshComponent.GetAllowRigidBodyAnimNode
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa68778c
	// Params: [ Num(1) Size(0x1) ]
	bool GetAllowRigidBodyAnimNode();

	// Object: Function Engine.SkeletalMeshComponent.GetAllowedAnimCurveEvaluate
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa687530
	// Params: [ Num(1) Size(0x1) ]
	bool GetAllowedAnimCurveEvaluate();

	// Object: Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleportAndReset
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6879e4
	// Params: [ Num(0) Size(0x0) ]
	void ForceClothNextUpdateTeleportAndReset();

	// Object: Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleport
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6879f8
	// Params: [ Num(0) Size(0x0) ]
	void ForceClothNextUpdateTeleport();

	// Object: Function Engine.SkeletalMeshComponent.FindConstraintBoneName
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68576c
	// Params: [ Num(2) Size(0xC) ]
	struct FName FindConstraintBoneName(int32_t ConstraintIndex);

	// Object: Function Engine.SkeletalMeshComponent.ClearMorphTargets
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa687c70
	// Params: [ Num(0) Size(0x0) ]
	void ClearMorphTargets();

	// Object: Function Engine.SkeletalMeshComponent.BreakConstraint
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa685644
	// Params: [ Num(3) Size(0x20) ]
	void BreakConstraint(struct FVector Impulse, struct FVector HitLocation, struct FName InBoneName);

	// Object: Function Engine.SkeletalMeshComponent.BindClothToMasterPoseComponent
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa68795c
	// Params: [ Num(0) Size(0x0) ]
	void BindClothToMasterPoseComponent();

	// Object: Function Engine.SkeletalMeshComponent.AllowAnimCurveEvaluation
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa687440
	// Params: [ Num(2) Size(0x9) ]
	void AllowAnimCurveEvaluation(struct FName NameOfCurve, bool bAllow);

	// Object: Function Engine.SkeletalMeshComponent.AddImpulseToAllBodiesBelow
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa6865fc
	// Params: [ Num(4) Size(0x16) ]
	void AddImpulseToAllBodiesBelow(struct FVector Impulse, struct FName BoneName, bool bVelChange, bool bIncludeSelf);

	// Object: Function Engine.SkeletalMeshComponent.AddForceToAllBodiesBelow
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa68677c
	// Params: [ Num(4) Size(0x16) ]
	void AddForceToAllBodiesBelow(struct FVector Force, struct FName BoneName, bool bAccelChange, bool bIncludeSelf);

	// Object: Function Engine.SkeletalMeshComponent.AccumulateAllBodiesBelowPhysicsBlendWeight
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa685e34
	// Params: [ Num(3) Size(0xD) ]
	void AccumulateAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType);
};

// Object: Class Engine.Actor
// Size: 0x2E0 (Inherited: 0x28)
struct AActor : UObject
{
	struct FActorTickFunction PrimaryActorTick; // 0x28(0x30)
	uint8_t bNetTemporary : 1; // 0x58(0x1), Mask(0x1)
	uint8_t bNetStartup : 1; // 0x58(0x1), Mask(0x2)
	uint8_t bOnlyRelevantToOwner : 1; // 0x58(0x1), Mask(0x4)
	uint8_t bAlwaysRelevant : 1; // 0x58(0x1), Mask(0x8)
	uint8_t bReplicateMovement : 1; // 0x58(0x1), Mask(0x10)
	uint8_t bHidden : 1; // 0x58(0x1), Mask(0x20)
	uint8_t bTearOff : 1; // 0x58(0x1), Mask(0x40)
	uint8_t bExchangedRoles : 1; // 0x58(0x1), Mask(0x80)
	uint8_t bNetLoadOnClient : 1; // 0x59(0x1), Mask(0x1)
	uint8_t bNetUseOwnerRelevancy : 1; // 0x59(0x1), Mask(0x2)
	uint8_t bRelevantForNetworkReplays : 1; // 0x59(0x1), Mask(0x4)
	uint8_t BitPad_0x59_3 : 1; // 0x59(0x1)
	uint8_t bRelevantForLevelBounds : 1; // 0x59(0x1), Mask(0x10)
	uint8_t bReplayRewindable : 1; // 0x59(0x1), Mask(0x20)
	uint8_t bAllowTickBeforeBeginPlay : 1; // 0x59(0x1), Mask(0x40)
	uint8_t bAutoDestroyWhenFinished : 1; // 0x59(0x1), Mask(0x80)
	uint8_t bCanBeDamaged : 1; // 0x5A(0x1), Mask(0x1)
	uint8_t bBlockInput : 1; // 0x5A(0x1), Mask(0x2)
	uint8_t bCollideWhenPlacing : 1; // 0x5A(0x1), Mask(0x4)
	uint8_t bFindCameraComponentWhenViewTarget : 1; // 0x5A(0x1), Mask(0x8)
	uint8_t bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5A(0x1), Mask(0x10)
	uint8_t bIgnoresOriginShifting : 1; // 0x5A(0x1), Mask(0x20)
	uint8_t bEnableAutoLODGeneration : 1; // 0x5A(0x1), Mask(0x40)
	uint8_t bIsEditorOnlyActor : 1; // 0x5A(0x1), Mask(0x80)
	uint8_t bActorSeamlessTraveled : 1; // 0x5B(0x1), Mask(0x1)
	uint8_t BitPad_0x5B_1 : 7; // 0x5B(0x1)
	float AvatarShadowSampleHeight; // 0x5C(0x4)
	uint8_t bReplicates : 1; // 0x60(0x1), Mask(0x1)
	uint8_t bCanBeInCluster : 1; // 0x60(0x1), Mask(0x2)
	uint8_t bAllowReceiveTickEventOnDedicatedServer : 1; // 0x60(0x1), Mask(0x4)
	uint8_t BitPad_0x60_3 : 1; // 0x60(0x1)
	uint8_t bDisableUpdateComponentToWorldIfHiddenInGame : 1; // 0x60(0x1), Mask(0x10)
	uint8_t bSupportAggregationTick : 1; // 0x60(0x1), Mask(0x20)
	uint8_t BitPad_0x60_6 : 2; // 0x60(0x1)
	uint8_t Pad_0x61[0x63]; // 0x61(0x63)
	uint8_t BitPad_0xC4_0 : 7; // 0xC4(0x1)
	uint8_t bActorEnableCollision : 1; // 0xC4(0x1), Mask(0x80)
	uint8_t bActorIsBeingDestroyed : 1; // 0xC5(0x1), Mask(0x1)
	uint8_t BitPad_0xC5_1 : 7; // 0xC5(0x1)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0xC6(0x1)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0xC7(0x1)
	uint8_t RemoteRole; // 0xC8(0x1)
	uint8_t Pad_0xC9[0x3]; // 0xC9(0x3)
	struct FRepMovement ReplicatedMovement; // 0xCC(0x38)
	float InitialLifeSpan; // 0x104(0x4)
	float CustomTimeDilation; // 0x108(0x4)
	uint8_t Pad_0x10C[0x4]; // 0x10C(0x4)
	struct FRepAttachment AttachmentReplication; // 0x110(0x40)
	struct AActor* Owner; // 0x150(0x8)
	struct FName NetDriverName; // 0x158(0x8)
	uint8_t Role; // 0x160(0x1)
	uint8_t NetDormancy; // 0x161(0x1)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x162(0x1)
	uint8_t AutoReceiveInput; // 0x163(0x1)
	int32_t InputPriority; // 0x164(0x4)
	float NetCullHeightRatio; // 0x168(0x4)
	float NetCullHeightOnSkydiving; // 0x16C(0x4)
	float NetCullRatioPC; // 0x170(0x4)
	uint8_t Pad_0x174[0x4]; // 0x174(0x4)
	struct UInputComponent* InputComponent; // 0x178(0x8)
	float NetCullDistanceSquared; // 0x180(0x4)
	int32_t NetTag; // 0x184(0x4)
	float NetUpdateFrequency; // 0x188(0x4)
	float MinNetUpdateFrequency; // 0x18C(0x4)
	float NetPriority; // 0x190(0x4)
	uint8_t Pad_0x194[0x4]; // 0x194(0x4)
	struct APawn* Instigator; // 0x198(0x8)
	struct TArray<struct AActor*> Children; // 0x1A0(0x10)
	struct USceneComponent* RootComponent; // 0x1B0(0x8)
	struct TArray<struct AMatineeActor*> ControllingMatineeActors; // 0x1B8(0x10)
	uint8_t Pad_0x1C8[0x8]; // 0x1C8(0x8)
	struct TArray<struct FName> Layers; // 0x1D0(0x10)
	struct TWeakObjectPtr<struct UChildActorComponent> ParentComponent; // 0x1E0(0x8)
	uint8_t Pad_0x1E8[0x8]; // 0x1E8(0x8)
	struct TArray<struct FName> Tags; // 0x1F0(0x10)
	float MobileIntensityScale; // 0x200(0x4)
	float MobileIndirectLightingIntensityScale; // 0x204(0x4)
	struct FMulticastSparseDelegate OnTakeAnyDamage; // 0x208(0x1)
	struct FMulticastSparseDelegate OnTakePointDamage; // 0x209(0x1)
	struct FMulticastSparseDelegate OnTakeRadialDamage; // 0x20A(0x1)
	struct FMulticastSparseDelegate OnActorBeginOverlap; // 0x20B(0x1)
	struct FMulticastSparseDelegate OnActorEndOverlap; // 0x20C(0x1)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x20D(0x1)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x20E(0x1)
	struct FMulticastSparseDelegate OnClicked; // 0x20F(0x1)
	struct FMulticastSparseDelegate OnReleased; // 0x210(0x1)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x211(0x1)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x212(0x1)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x213(0x1)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x214(0x1)
	struct FMulticastSparseDelegate OnActorHit; // 0x215(0x1)
	struct FMulticastSparseDelegate OnDestroyed; // 0x216(0x1)
	struct FMulticastSparseDelegate OnEndPlay; // 0x217(0x1)
	uint8_t Pad_0x218[0x98]; // 0x218(0x98)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x2B0(0x10)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x2C0(0x10)
	uint8_t Pad_0x2D0[0x10]; // 0x2D0(0x10)


	// Object: Function Engine.Actor.WasRecentlyRendered
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464a5c
	// Params: [ Num(2) Size(0x5) ]
	bool WasRecentlyRendered(float Tolerance);

	// Object: Function Engine.Actor.UserConstructionScript
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void UserConstructionScript();

	// Object: Function Engine.Actor.TearOff
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa469260
	// Params: [ Num(0) Size(0x0) ]
	void TearOff();

	// Object: Function Engine.Actor.SnapRootComponentTo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa465e04
	// Params: [ Num(2) Size(0x10) ]
	void SnapRootComponentTo(struct AActor* InParentActor, struct FName InSocketName);

	// Object: Function Engine.Actor.SetTickGroup
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa464b10
	// Params: [ Num(1) Size(0x1) ]
	void SetTickGroup(uint8_t NewTickGroup);

	// Object: Function Engine.Actor.SetTickableWhenPaused
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa46579c
	// Params: [ Num(1) Size(0x1) ]
	void SetTickableWhenPaused(bool bTickableWhenPaused);

	// Object: Function Engine.Actor.SetReplicates
	// Flags: [Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable]
	// Offset: 0xa4690e4
	// Params: [ Num(1) Size(0x1) ]
	void SetReplicates(bool bInReplicates);

	// Object: Function Engine.Actor.SetReplicateMovement
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa46902c
	// Params: [ Num(1) Size(0x1) ]
	void SetReplicateMovement(bool bInReplicateMovement);

	// Object: Function Engine.Actor.SetOwner
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa465158
	// Params: [ Num(1) Size(0x8) ]
	void SetOwner(struct AActor* NewOwner);

	// Object: Function Engine.Actor.SetNetDormancy
	// Flags: [Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable]
	// Offset: 0xa464fe0
	// Params: [ Num(1) Size(0x1) ]
	void SetNetDormancy(uint8_t NewDormancy);

	// Object: Function Engine.Actor.SetLifeSpan
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa465424
	// Params: [ Num(1) Size(0x4) ]
	void SetLifeSpan(float InLifespan);

	// Object: Function Engine.Actor.SetAutoDestroyWhenFinished
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4691b0
	// Params: [ Num(1) Size(0x1) ]
	void SetAutoDestroyWhenFinished(bool bVal);

	// Object: Function Engine.Actor.SetActorTickInterval
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa465258
	// Params: [ Num(1) Size(0x4) ]
	void SetActorTickInterval(float TickInterval);

	// Object: Function Engine.Actor.SetActorTickEnabled
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa465338
	// Params: [ Num(1) Size(0x1) ]
	void SetActorTickEnabled(bool bEnabled);

	// Object: Function Engine.Actor.SetActorScale3D
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa468048
	// Params: [ Num(1) Size(0xC) ]
	void SetActorScale3D(struct FVector NewScale3D);

	// Object: Function Engine.Actor.SetActorRelativeScale3D
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa4669fc
	// Params: [ Num(1) Size(0xC) ]
	void SetActorRelativeScale3D(struct FVector NewRelativeScale);

	// Object: Function Engine.Actor.SetActorHiddenInGame
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa46690c
	// Params: [ Num(1) Size(0x1) ]
	void SetActorHiddenInGame(bool bNewHidden);

	// Object: Function Engine.Actor.SetActorEnableCollision
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa46685c
	// Params: [ Num(1) Size(0x1) ]
	void SetActorEnableCollision(bool bNewActorEnableCollision);

	// Object: Function Engine.Actor.RemoveTickPrerequisiteComponent
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa465884
	// Params: [ Num(1) Size(0x8) ]
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent);

	// Object: Function Engine.Actor.RemoveTickPrerequisiteActor
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa465934
	// Params: [ Num(1) Size(0x8) ]
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor);

	// Object: Function Engine.Actor.ReceiveTick
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x4) ]
	void ReceiveTick(float DeltaSeconds);

	// Object: Function Engine.Actor.ReceiveRadialDamage
	// Flags: [BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(6) Size(0xB8) ]
	void ReceiveRadialDamage(float DamageReceived, struct UDamageType* DamageType, struct FVector Origin, struct FHitResult& HitInfo, struct AController* InstigatedBy, struct AActor* DamageCauser);

	// Object: Function Engine.Actor.ReceivePointDamage
	// Flags: [BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(10) Size(0xE0) ]
	void ReceivePointDamage(float Damage, struct UDamageType* DamageType, struct FVector HitLocation, struct FVector HitNormal, struct UPrimitiveComponent* HitComponent, struct FName BoneName, struct FVector ShotFromDirection, struct AController* InstigatedBy, struct AActor* DamageCauser, struct FHitResult& HitInfo);

	// Object: Function Engine.Actor.ReceiveHit
	// Flags: [Event|Public|HasOutParms|HasDefaults|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(8) Size(0xC8) ]
	void ReceiveHit(struct UPrimitiveComponent* MyComp, struct AActor* Other, struct UPrimitiveComponent* OtherComp, bool bSelfMoved, struct FVector HitLocation, struct FVector HitNormal, struct FVector NormalImpulse, struct FHitResult& Hit);

	// Object: Function Engine.Actor.ReceiveEndPlay
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x1) ]
	void ReceiveEndPlay(uint8_t EndPlayReason);

	// Object: Function Engine.Actor.ReceiveDestroyed
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void ReceiveDestroyed();

	// Object: Function Engine.Actor.ReceiveBeginPlay
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void ReceiveBeginPlay();

	// Object: Function Engine.Actor.ReceiveAnyDamage
	// Flags: [BlueprintAuthorityOnly|Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(4) Size(0x20) ]
	void ReceiveAnyDamage(float Damage, struct UDamageType* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser);

	// Object: Function Engine.Actor.ReceiveActorOnReleased
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x18) ]
	void ReceiveActorOnReleased(struct FKey ButtonReleased);

	// Object: Function Engine.Actor.ReceiveActorOnInputTouchLeave
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x1) ]
	void ReceiveActorOnInputTouchLeave(uint8_t FingerIndex);

	// Object: Function Engine.Actor.ReceiveActorOnInputTouchEnter
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x1) ]
	void ReceiveActorOnInputTouchEnter(uint8_t FingerIndex);

	// Object: Function Engine.Actor.ReceiveActorOnInputTouchEnd
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x1) ]
	void ReceiveActorOnInputTouchEnd(uint8_t FingerIndex);

	// Object: Function Engine.Actor.ReceiveActorOnInputTouchBegin
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x1) ]
	void ReceiveActorOnInputTouchBegin(uint8_t FingerIndex);

	// Object: Function Engine.Actor.ReceiveActorOnClicked
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x18) ]
	void ReceiveActorOnClicked(struct FKey ButtonPressed);

	// Object: Function Engine.Actor.ReceiveActorEndOverlap
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x8) ]
	void ReceiveActorEndOverlap(struct AActor* OtherActor);

	// Object: Function Engine.Actor.ReceiveActorEndCursorOver
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void ReceiveActorEndCursorOver();

	// Object: Function Engine.Actor.ReceiveActorBeginOverlap
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x8) ]
	void ReceiveActorBeginOverlap(struct AActor* OtherActor);

	// Object: Function Engine.Actor.ReceiveActorBeginCursorOver
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void ReceiveActorBeginCursorOver();

	// Object: Function Engine.Actor.PrestreamTextures
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa464908
	// Params: [ Num(3) Size(0xC) ]
	void PrestreamTextures(float Seconds, bool bEnableStreaming, int32_t CinematicTextureGroups);

	// Object: Function Engine.Actor.OnRep_ReplicateMovement
	// Flags: [Native|Public]
	// Offset: 0xa46927c
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_ReplicateMovement();

	// Object: Function Engine.Actor.OnRep_ReplicatedMovement
	// Flags: [Native|Public]
	// Offset: 0xa465208
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_ReplicatedMovement();

	// Object: Function Engine.Actor.OnRep_Owner
	// Flags: [Native|Protected]
	// Offset: 0xa469194
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_Owner();

	// Object: Function Engine.Actor.OnRep_Instigator
	// Flags: [Native|Public]
	// Offset: 0xa468fbc
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_Instigator();

	// Object: Function Engine.Actor.OnRep_AttachmentReplication
	// Flags: [Native|Public]
	// Offset: 0xa468fd8
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_AttachmentReplication();

	// Object: Function Engine.Actor.MakeNoise
	// Flags: [Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa464280
	// Params: [ Num(5) Size(0x28) ]
	void MakeNoise(float Loudness, struct APawn* NoiseInstigator, struct FVector NoiseLocation, float MaxRange, struct FName Tag);

	// Object: Function Engine.Actor.MakeMIDForMaterial
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4656ec
	// Params: [ Num(2) Size(0x10) ]
	struct UMaterialInstanceDynamic* MakeMIDForMaterial(struct UMaterialInterface* Parent);

	// Object: Function Engine.Actor.K2_TeleportTo
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa464d2c
	// Params: [ Num(3) Size(0x19) ]
	bool K2_TeleportTo(struct FVector DestLocation, struct FRotator DestRotation);

	// Object: Function Engine.Actor.K2_SetActorTransform
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa4674e4
	// Params: [ Num(5) Size(0xBE) ]
	bool K2_SetActorTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.Actor.K2_SetActorRotation
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa4682dc
	// Params: [ Num(3) Size(0xE) ]
	bool K2_SetActorRotation(struct FRotator NewRotation, bool bTeleportPhysics);

	// Object: Function Engine.Actor.K2_SetActorRelativeTransform
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa466aa4
	// Params: [ Num(4) Size(0xBD) ]
	void K2_SetActorRelativeTransform(struct FTransform& NewRelativeTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.Actor.K2_SetActorRelativeRotation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa466c84
	// Params: [ Num(4) Size(0x99) ]
	void K2_SetActorRelativeRotation(struct FRotator NewRelativeRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.Actor.K2_SetActorRelativeLocation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa466e24
	// Params: [ Num(4) Size(0x99) ]
	void K2_SetActorRelativeLocation(struct FVector NewRelativeLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.Actor.K2_SetActorLocationAndRotation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa4680f0
	// Params: [ Num(6) Size(0xA6) ]
	bool K2_SetActorLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.Actor.K2_SetActorLocation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa4687e8
	// Params: [ Num(5) Size(0x9A) ]
	bool K2_SetActorLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.Actor.K2_OnReset
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void K2_OnReset();

	// Object: Function Engine.Actor.K2_OnEndViewTarget
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x8) ]
	void K2_OnEndViewTarget(struct APlayerController* PC);

	// Object: Function Engine.Actor.K2_OnBecomeViewTarget
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x8) ]
	void K2_OnBecomeViewTarget(struct APlayerController* PC);

	// Object: Function Engine.Actor.K2_GetRootComponent
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa468418
	// Params: [ Num(1) Size(0x8) ]
	struct USceneComponent* K2_GetRootComponent();

	// Object: Function Engine.Actor.K2_GetComponentsByClass
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464638
	// Params: [ Num(2) Size(0x18) ]
	struct TArray<struct UActorComponent*> K2_GetComponentsByClass(struct UActorComponent* ComponentClass);

	// Object: Function Engine.Actor.K2_GetActorRotation
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4686c0
	// Params: [ Num(1) Size(0xC) ]
	struct FRotator K2_GetActorRotation();

	// Object: Function Engine.Actor.K2_GetActorLocation
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa468994
	// Params: [ Num(1) Size(0xC) ]
	struct FVector K2_GetActorLocation();

	// Object: Function Engine.Actor.K2_DetachFromActor
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa465c2c
	// Params: [ Num(3) Size(0x3) ]
	void K2_DetachFromActor(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule);

	// Object: Function Engine.Actor.K2_DestroyComponent
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4665a0
	// Params: [ Num(1) Size(0x8) ]
	void K2_DestroyComponent(struct UActorComponent* Component);

	// Object: Function Engine.Actor.K2_DestroyActor
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa466820
	// Params: [ Num(0) Size(0x0) ]
	void K2_DestroyActor();

	// Object: Function Engine.Actor.K2_AttachToComponent
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa466244
	// Params: [ Num(6) Size(0x14) ]
	void K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);

	// Object: Function Engine.Actor.K2_AttachToActor
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa465ee8
	// Params: [ Num(6) Size(0x14) ]
	void K2_AttachToActor(struct AActor* ParentActor, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);

	// Object: Function Engine.Actor.K2_AttachRootComponentToActor
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4660d8
	// Params: [ Num(4) Size(0x12) ]
	void K2_AttachRootComponentToActor(struct AActor* InParentActor, struct FName InSocketName, uint8_t AttachLocationType, bool bWeldSimulatedBodies);

	// Object: Function Engine.Actor.K2_AttachRootComponentTo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa466434
	// Params: [ Num(4) Size(0x12) ]
	void K2_AttachRootComponentTo(struct USceneComponent* InParent, struct FName InSocketName, uint8_t AttachLocationType, bool bWeldSimulatedBodies);

	// Object: Function Engine.Actor.K2_AddActorWorldTransform
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa4676d0
	// Params: [ Num(4) Size(0xBD) ]
	void K2_AddActorWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.Actor.K2_AddActorWorldRotation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa4678b0
	// Params: [ Num(4) Size(0x99) ]
	void K2_AddActorWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.Actor.K2_AddActorWorldOffset
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa467a50
	// Params: [ Num(4) Size(0x99) ]
	void K2_AddActorWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.Actor.K2_AddActorLocalTransform
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa466fc4
	// Params: [ Num(4) Size(0xBD) ]
	void K2_AddActorLocalTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.Actor.K2_AddActorLocalRotation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa4671a4
	// Params: [ Num(4) Size(0x99) ]
	void K2_AddActorLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.Actor.K2_AddActorLocalOffset
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa467344
	// Params: [ Num(4) Size(0x99) ]
	void K2_AddActorLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport);

	// Object: Function Engine.Actor.IsOverlappingActor
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa465088
	// Params: [ Num(2) Size(0x9) ]
	bool IsOverlappingActor(struct AActor* Other);

	// Object: Function Engine.Actor.IsInCurrentLevel
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa4647d0
	// Params: [ Num(1) Size(0x1) ]
	bool IsInCurrentLevel();

	// Object: Function Engine.Actor.IsChildActor
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464f94
	// Params: [ Num(1) Size(0x1) ]
	bool IsChildActor();

	// Object: Function Engine.Actor.IsActorTickEnabled
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa465300
	// Params: [ Num(1) Size(0x1) ]
	bool IsActorTickEnabled();

	// Object: Function Engine.Actor.IsActorBeingDestroyed
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa465698
	// Params: [ Num(1) Size(0x1) ]
	bool IsActorBeingDestroyed();

	// Object: Function Engine.Actor.HasAuthority
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4667fc
	// Params: [ Num(1) Size(0x1) ]
	bool HasAuthority();

	// Object: Function Engine.Actor.GetVerticalDistanceTo
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa467d50
	// Params: [ Num(2) Size(0xC) ]
	float GetVerticalDistanceTo(struct AActor* OtherActor);

	// Object: Function Engine.Actor.GetVelocity
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4683d8
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetVelocity();

	// Object: Function Engine.Actor.GetTransform
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4689ec
	// Params: [ Num(1) Size(0x30) ]
	struct FTransform GetTransform();

	// Object: Function Engine.Actor.GetTickableWhenPaused
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa46584c
	// Params: [ Num(1) Size(0x1) ]
	bool GetTickableWhenPaused();

	// Object: Function Engine.Actor.GetSquaredDistanceTo
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa467eb0
	// Params: [ Num(2) Size(0xC) ]
	float GetSquaredDistanceTo(struct AActor* OtherActor);

	// Object: Function Engine.Actor.GetRemoteRole
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa468ff4
	// Params: [ Num(1) Size(0x1) ]
	uint8_t GetRemoteRole();

	// Object: Function Engine.Actor.GetParentComponent
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464e54
	// Params: [ Num(1) Size(0x8) ]
	struct UChildActorComponent* GetParentComponent();

	// Object: Function Engine.Actor.GetParentActor
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464e20
	// Params: [ Num(1) Size(0x8) ]
	struct AActor* GetParentActor();

	// Object: Function Engine.Actor.GetOwner
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa46513c
	// Params: [ Num(1) Size(0x8) ]
	struct AActor* GetOwner();

	// Object: Function Engine.Actor.GetOverlappingComponents
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4654d4
	// Params: [ Num(1) Size(0x10) ]
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*>& OverlappingComponents);

	// Object: Function Engine.Actor.GetOverlappingActors
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa465594
	// Params: [ Num(2) Size(0x18) ]
	void GetOverlappingActors(struct TArray<struct AActor*>& OverlappingActors, struct AActor* ClassFilter);

	// Object: Function Engine.Actor.GetLocalRole
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa469010
	// Params: [ Num(1) Size(0x1) ]
	uint8_t GetLocalRole();

	// Object: Function Engine.Actor.GetLifeSpan
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4653e8
	// Params: [ Num(1) Size(0x4) ]
	float GetLifeSpan();

	// Object: Function Engine.Actor.GetInstigatorController
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa468a28
	// Params: [ Num(1) Size(0x8) ]
	struct AController* GetInstigatorController();

	// Object: Function Engine.Actor.GetInstigator
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa468a5c
	// Params: [ Num(1) Size(0x8) ]
	struct APawn* GetInstigator();

	// Object: Function Engine.Actor.GetInputVectorAxisValue
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa468a90
	// Params: [ Num(2) Size(0x24) ]
	struct FVector GetInputVectorAxisValue(struct FKey InputAxisKey);

	// Object: Function Engine.Actor.GetInputAxisValue
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa468dac
	// Params: [ Num(2) Size(0xC) ]
	float GetInputAxisValue(struct FName InputAxisName);

	// Object: Function Engine.Actor.GetInputAxisKeyValue
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa468c20
	// Params: [ Num(2) Size(0x1C) ]
	float GetInputAxisKeyValue(struct FKey InputAxisKey);

	// Object: Function Engine.Actor.GetHorizontalDotProductTo
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa467bf0
	// Params: [ Num(2) Size(0xC) ]
	float GetHorizontalDotProductTo(struct AActor* OtherActor);

	// Object: Function Engine.Actor.GetHorizontalDistanceTo
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa467e00
	// Params: [ Num(2) Size(0xC) ]
	float GetHorizontalDistanceTo(struct AActor* OtherActor);

	// Object: Function Engine.Actor.GetGameTimeSinceCreation
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4656b8
	// Params: [ Num(1) Size(0x4) ]
	float GetGameTimeSinceCreation();

	// Object: Function Engine.Actor.GetDotProductTo
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa467ca0
	// Params: [ Num(2) Size(0xC) ]
	float GetDotProductTo(struct AActor* OtherActor);

	// Object: Function Engine.Actor.GetDistanceTo
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa467f60
	// Params: [ Num(2) Size(0xC) ]
	float GetDistanceTo(struct AActor* OtherActor);

	// Object: Function Engine.Actor.GetComponentsByTag
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464510
	// Params: [ Num(3) Size(0x20) ]
	struct TArray<struct UActorComponent*> GetComponentsByTag(struct UActorComponent* ComponentClass, struct FName Tag);

	// Object: Function Engine.Actor.GetComponentsByInterface
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464428
	// Params: [ Num(2) Size(0x18) ]
	struct TArray<struct UActorComponent*> GetComponentsByInterface(struct IInterface* Interface);

	// Object: Function Engine.Actor.GetComponentByClass
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464720
	// Params: [ Num(2) Size(0x10) ]
	struct UActorComponent* GetComponentByClass(struct UActorComponent* ComponentClass);

	// Object: Function Engine.Actor.GetAttachParentSocketName
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464cc4
	// Params: [ Num(1) Size(0x8) ]
	struct FName GetAttachParentSocketName();

	// Object: Function Engine.Actor.GetAttachParentActor
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464cf8
	// Params: [ Num(1) Size(0x8) ]
	struct AActor* GetAttachParentActor();

	// Object: Function Engine.Actor.GetAttachedActors
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464bb8
	// Params: [ Num(2) Size(0x11) ]
	void GetAttachedActors(struct TArray<struct AActor*>& OutActors, bool bResetArray);

	// Object: Function Engine.Actor.GetAllChildActors
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464e88
	// Params: [ Num(2) Size(0x11) ]
	void GetAllChildActors(struct TArray<struct AActor*>& ChildActors, bool bIncludeDescendants);

	// Object: Function Engine.Actor.GetActorUpVector
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa468618
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetActorUpVector();

	// Object: Function Engine.Actor.GetActorTimeDilation
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa465b44
	// Params: [ Num(1) Size(0x4) ]
	float GetActorTimeDilation();

	// Object: Function Engine.Actor.GetActorTickInterval
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa465224
	// Params: [ Num(1) Size(0x4) ]
	float GetActorTickInterval();

	// Object: Function Engine.Actor.GetActorScale3D
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa468010
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetActorScale3D();

	// Object: Function Engine.Actor.GetActorRightVector
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4685c4
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetActorRightVector();

	// Object: Function Engine.Actor.GetActorRelativeScale3D
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4669c4
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetActorRelativeScale3D();

	// Object: Function Engine.Actor.GetActorForwardVector
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa46866c
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetActorForwardVector();

	// Object: Function Engine.Actor.GetActorEyesViewPoint
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa464808
	// Params: [ Num(2) Size(0x18) ]
	void GetActorEyesViewPoint(struct FVector& OutLocation, struct FRotator& OutRotation);

	// Object: Function Engine.Actor.GetActorEnableCollision
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa46683c
	// Params: [ Num(1) Size(0x1) ]
	bool GetActorEnableCollision();

	// Object: Function Engine.Actor.GetActorBounds
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa468434
	// Params: [ Num(4) Size(0x1D) ]
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector& Origin, struct FVector& BoxExtent, bool bIncludeFromChildActors);

	// Object: Function Engine.Actor.ForceNetUpdate
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa464a40
	// Params: [ Num(0) Size(0x0) ]
	void ForceNetUpdate();

	// Object: Function Engine.Actor.FlushNetDormancy
	// Flags: [Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable]
	// Offset: 0xa464fcc
	// Params: [ Num(0) Size(0x0) ]
	void FlushNetDormancy();

	// Object: Function Engine.Actor.EnableInput
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa468f0c
	// Params: [ Num(1) Size(0x8) ]
	void EnableInput(struct APlayerController* PlayerController);

	// Object: Function Engine.Actor.DisableInput
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa468e5c
	// Params: [ Num(1) Size(0x8) ]
	void DisableInput(struct APlayerController* PlayerController);

	// Object: Function Engine.Actor.DetachRootComponentFromParent
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa465d54
	// Params: [ Num(1) Size(0x1) ]
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);

	// Object: Function Engine.Actor.AddTickPrerequisiteComponent
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4659e4
	// Params: [ Num(1) Size(0x8) ]
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent);

	// Object: Function Engine.Actor.AddTickPrerequisiteActor
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa465a94
	// Params: [ Num(1) Size(0x8) ]
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor);

	// Object: Function Engine.Actor.AddComponent
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa466648
	// Params: [ Num(5) Size(0x50) ]
	struct UActorComponent* AddComponent(struct FName TemplateName, bool bManualAttachment, struct FTransform& RelativeTransform, struct UObject* ComponentTemplateContext);

	// Object: Function Engine.Actor.ActorHasTag
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa465b78
	// Params: [ Num(2) Size(0x9) ]
	bool ActorHasTag(struct FName Tag);
};

// Object: Class Engine.HUD
// Size: 0x3D0 (Inherited: 0x2E0)
struct AHUD : AActor
{
	struct APlayerController* PlayerOwner; // 0x2E0(0x8)
	uint8_t bLostFocusPaused : 1; // 0x2E8(0x1), Mask(0x1)
	uint8_t bShowHUD : 1; // 0x2E8(0x1), Mask(0x2)
	uint8_t bShowDebugInfo : 1; // 0x2E8(0x1), Mask(0x4)
	uint8_t BitPad_0x2E8_3 : 5; // 0x2E8(0x1)
	uint8_t Pad_0x2E9[0x3]; // 0x2E9(0x3)
	int32_t CurrentTargetIndex; // 0x2EC(0x4)
	uint8_t bShowHitBoxDebugInfo : 1; // 0x2F0(0x1), Mask(0x1)
	uint8_t bShowOverlays : 1; // 0x2F0(0x1), Mask(0x2)
	uint8_t bEnableDebugTextShadow : 1; // 0x2F0(0x1), Mask(0x4)
	uint8_t BitPad_0x2F0_3 : 5; // 0x2F0(0x1)
	uint8_t Pad_0x2F1[0x7]; // 0x2F1(0x7)
	struct TArray<struct AActor*> PostRenderedActors; // 0x2F8(0x10)
	uint8_t Pad_0x308[0x8]; // 0x308(0x8)
	struct TArray<struct FName> DebugDisplay; // 0x310(0x10)
	struct TArray<struct FName> ToggledDebugCategories; // 0x320(0x10)
	struct UCanvas* Canvas; // 0x330(0x8)
	struct UCanvas* DebugCanvas; // 0x338(0x8)
	struct TArray<struct FDebugTextInfo> DebugTextList; // 0x340(0x10)
	struct AActor* ShowDebugTargetDesiredClass; // 0x350(0x8)
	struct AActor* ShowDebugTargetActor; // 0x358(0x8)
	uint8_t Pad_0x360[0x70]; // 0x360(0x70)


	// Object: Function Engine.HUD.ShowHUD
	// Flags: [Exec|Native|Public]
	// Offset: 0xa536a24
	// Params: [ Num(0) Size(0x0) ]
	void ShowHUD();

	// Object: Function Engine.HUD.ShowDebugToggleSubCategory
	// Flags: [Final|Exec|Native|Public]
	// Offset: 0xa5368cc
	// Params: [ Num(1) Size(0x8) ]
	void ShowDebugToggleSubCategory(struct FName Category);

	// Object: Function Engine.HUD.ShowDebugForReticleTargetToggle
	// Flags: [Final|Exec|Native|Public]
	// Offset: 0xa536824
	// Params: [ Num(1) Size(0x8) ]
	void ShowDebugForReticleTargetToggle(struct AActor* DesiredClass);

	// Object: Function Engine.HUD.ShowDebug
	// Flags: [Exec|Native|Public]
	// Offset: 0xa536974
	// Params: [ Num(1) Size(0x8) ]
	void ShowDebug(struct FName DebugType);

	// Object: Function Engine.HUD.RemoveDebugText
	// Flags: [Final|Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa536388
	// Params: [ Num(2) Size(0x9) ]
	void RemoveDebugText(struct AActor* SrcActor, bool bLeaveDurationText);

	// Object: Function Engine.HUD.RemoveAllDebugStrings
	// Flags: [Final|Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa536478
	// Params: [ Num(0) Size(0x0) ]
	void RemoveAllDebugStrings();

	// Object: Function Engine.HUD.ReceiveHitBoxRelease
	// Flags: [BlueprintCosmetic|Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x8) ]
	void ReceiveHitBoxRelease(struct FName BoxName);

	// Object: Function Engine.HUD.ReceiveHitBoxEndCursorOver
	// Flags: [BlueprintCosmetic|Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x8) ]
	void ReceiveHitBoxEndCursorOver(struct FName BoxName);

	// Object: Function Engine.HUD.ReceiveHitBoxClick
	// Flags: [BlueprintCosmetic|Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x8) ]
	void ReceiveHitBoxClick(struct FName BoxName);

	// Object: Function Engine.HUD.ReceiveHitBoxBeginCursorOver
	// Flags: [BlueprintCosmetic|Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x8) ]
	void ReceiveHitBoxBeginCursorOver(struct FName BoxName);

	// Object: Function Engine.HUD.ReceiveDrawHUD
	// Flags: [BlueprintCosmetic|Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(2) Size(0x8) ]
	void ReceiveDrawHUD(int32_t SizeX, int32_t SizeY);

	// Object: Function Engine.HUD.Project
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa534c90
	// Params: [ Num(2) Size(0x18) ]
	struct FVector Project(struct FVector Location);

	// Object: Function Engine.HUD.PreviousDebugTarget
	// Flags: [Exec|Native|Public]
	// Offset: 0xa534698
	// Params: [ Num(0) Size(0x0) ]
	void PreviousDebugTarget();

	// Object: Function Engine.HUD.NextDebugTarget
	// Flags: [Exec|Native|Public]
	// Offset: 0xa5346b4
	// Params: [ Num(0) Size(0x0) ]
	void NextDebugTarget();

	// Object: Function Engine.HUD.GetTextSize
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa5361ac
	// Params: [ Num(5) Size(0x24) ]
	void GetTextSize(struct FString Text, float& OutWidth, float& OutHeight, struct UFont* Font, float Scale);

	// Object: Function Engine.HUD.GetOwningPlayerController
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa534704
	// Params: [ Num(1) Size(0x8) ]
	struct APlayerController* GetOwningPlayerController();

	// Object: Function Engine.HUD.GetOwningPawn
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa5346d0
	// Params: [ Num(1) Size(0x8) ]
	struct APawn* GetOwningPawn();

	// Object: Function Engine.HUD.GetActorsInSelectionRectangle
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure]
	// Offset: 0xa5348e0
	// Params: [ Num(6) Size(0x2A) ]
	void GetActorsInSelectionRectangle(struct AActor* ClassFilter, struct FVector2D& FirstPoint, struct FVector2D& SecondPoint, struct TArray<struct AActor*>& OutActors, bool bIncludeNonCollidingComponents, bool bActorMustBeFullyEnclosed);

	// Object: Function Engine.HUD.DrawTextureSimple
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa535610
	// Params: [ Num(5) Size(0x15) ]
	void DrawTextureSimple(struct UTexture* Texture, float ScreenX, float ScreenY, float Scale, bool bScalePosition);

	// Object: Function Engine.HUD.DrawTexture
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa5357bc
	// Params: [ Num(15) Size(0x50) ]
	void DrawTexture(struct UTexture* Texture, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float TextureU, float TextureV, float TextureUWidth, float TextureVHeight, struct FLinearColor TintColor, uint8_t BlendMode, float Scale, bool bScalePosition, float Rotation, struct FVector2D RotPivot);

	// Object: Function Engine.HUD.DrawText
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa535f74
	// Params: [ Num(7) Size(0x35) ]
	void DrawText(struct FString Text, struct FLinearColor TextColor, float ScreenX, float ScreenY, struct UFont* Font, float Scale, bool bScalePosition);

	// Object: Function Engine.HUD.DrawRect
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa535bf0
	// Params: [ Num(5) Size(0x20) ]
	void DrawRect(struct FLinearColor RectColor, float ScreenX, float ScreenY, float ScreenW, float ScreenH);

	// Object: Function Engine.HUD.DrawMaterialTriangle
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa534d44
	// Params: [ Num(10) Size(0x68) ]
	void DrawMaterialTriangle(struct UMaterialInterface* Material, struct FVector2D V0_Pos, struct FVector2D V1_Pos, struct FVector2D V2_Pos, struct FVector2D V0_UV, struct FVector2D V1_UV, struct FVector2D V2_UV, struct FLinearColor V0_Color, struct FLinearColor V1_Color, struct FLinearColor V2_Color);

	// Object: Function Engine.HUD.DrawMaterialSimple
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa535040
	// Params: [ Num(7) Size(0x1D) ]
	void DrawMaterialSimple(struct UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float Scale, bool bScalePosition);

	// Object: Function Engine.HUD.DrawMaterial
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa535268
	// Params: [ Num(13) Size(0x3C) ]
	void DrawMaterial(struct UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float MaterialU, float MaterialV, float MaterialUWidth, float MaterialVHeight, float Scale, bool bScalePosition, float Rotation, struct FVector2D RotPivot);

	// Object: Function Engine.HUD.DrawLine
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa535d90
	// Params: [ Num(6) Size(0x24) ]
	void DrawLine(float StartScreenX, float StartScreenY, float EndScreenX, float EndScreenY, struct FLinearColor LineColor, float LineThickness);

	// Object: Function Engine.HUD.Deproject
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa534b1c
	// Params: [ Num(4) Size(0x20) ]
	void Deproject(float ScreenX, float ScreenY, struct FVector& WorldPosition, struct FVector& WorldDirection);

	// Object: Function Engine.HUD.AddHitBox
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa534738
	// Params: [ Num(5) Size(0x20) ]
	void AddHitBox(struct FVector2D Position, struct FVector2D Size, struct FName InName, bool bConsumesInput, int32_t Priority);

	// Object: Function Engine.HUD.AddDebugText
	// Flags: [Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient]
	// Offset: 0xa53648c
	// Params: [ Num(12) Size(0x4D) ]
	void AddDebugText(struct FString DebugText, struct AActor* SrcActor, float Duration, struct FVector Offset, struct FVector DesiredOffset, struct FColor TextColor, bool bSkipOverwriteCheck, bool bAbsoluteLocation, bool bKeepAttachedToActor, struct UFont* InFont, float FontScale, bool bDrawShadow);
};

// Object: Class Engine.Pawn
// Size: 0x340 (Inherited: 0x2E0)
struct APawn : AActor
{
	uint8_t Pad_0x2E0[0x8]; // 0x2E0(0x8)
	uint8_t bUseControllerRotationPitch : 1; // 0x2E8(0x1), Mask(0x1)
	uint8_t bUseControllerRotationYaw : 1; // 0x2E8(0x1), Mask(0x2)
	uint8_t bUseControllerRotationRoll : 1; // 0x2E8(0x1), Mask(0x4)
	uint8_t bCanAffectNavigationGeneration : 1; // 0x2E8(0x1), Mask(0x8)
	uint8_t BitPad_0x2E8_4 : 4; // 0x2E8(0x1)
	uint8_t Pad_0x2E9[0x3]; // 0x2E9(0x3)
	float BaseEyeHeight; // 0x2EC(0x4)
	uint8_t AutoPossessPlayer; // 0x2F0(0x1)
	enum class EAutoPossessAI AutoPossessAI; // 0x2F1(0x1)
	uint8_t RemoteViewPitch; // 0x2F2(0x1)
	uint8_t Pad_0x2F3[0x5]; // 0x2F3(0x5)
	struct AController* AIControllerClass; // 0x2F8(0x8)
	struct APlayerState* PlayerState; // 0x300(0x8)
	uint8_t Pad_0x308[0x8]; // 0x308(0x8)
	struct AController* LastHitBy; // 0x310(0x8)
	struct AController* Controller; // 0x318(0x8)
	uint8_t Pad_0x320[0x4]; // 0x320(0x4)
	struct FVector ControlInputVector; // 0x324(0xC)
	struct FVector LastControlInputVector; // 0x330(0xC)
	uint8_t Pad_0x33C[0x4]; // 0x33C(0x4)


	// Object: Function Engine.Pawn.SpawnDefaultController
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62ff50
	// Params: [ Num(0) Size(0x0) ]
	void SpawnDefaultController();

	// Object: Function Engine.Pawn.SetCanAffectNavigationGeneration
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6300c8
	// Params: [ Num(2) Size(0x2) ]
	void SetCanAffectNavigationGeneration(bool bNewValue, bool bForceUpdate);

	// Object: Function Engine.Pawn.ReceiveUnpossessed
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x8) ]
	void ReceiveUnpossessed(struct AController* OldController);

	// Object: Function Engine.Pawn.ReceivePossessed
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x8) ]
	void ReceivePossessed(struct AController* NewController);

	// Object: Function Engine.Pawn.PawnMakeNoise
	// Flags: [Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa630364
	// Params: [ Num(4) Size(0x20) ]
	void PawnMakeNoise(float Loudness, struct FVector NoiseLocation, bool bUseNoiseMakerLocation, struct AActor* NoiseMaker);

	// Object: Function Engine.Pawn.OnRep_PlayerState
	// Flags: [Native|Public]
	// Offset: 0xa6301c0
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_PlayerState();

	// Object: Function Engine.Pawn.OnRep_Controller
	// Flags: [Native|Public]
	// Offset: 0xa6301dc
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_Controller();

	// Object: Function Engine.Pawn.LaunchPawn
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa62f9e0
	// Params: [ Num(3) Size(0xE) ]
	void LaunchPawn(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride);

	// Object: Function Engine.Pawn.K2_GetMovementInputVector
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62f9a8
	// Params: [ Num(1) Size(0xC) ]
	struct FVector K2_GetMovementInputVector();

	// Object: Function Engine.Pawn.IsPlayerControlled
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa630008
	// Params: [ Num(1) Size(0x1) ]
	bool IsPlayerControlled();

	// Object: Function Engine.Pawn.IsPawnControlled
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa63024c
	// Params: [ Num(1) Size(0x1) ]
	bool IsPawnControlled();

	// Object: Function Engine.Pawn.IsMoveInputIgnored
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62fb18
	// Params: [ Num(1) Size(0x1) ]
	bool IsMoveInputIgnored();

	// Object: Function Engine.Pawn.IsLocallyControlled
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa630048
	// Params: [ Num(1) Size(0x1) ]
	bool IsLocallyControlled();

	// Object: Function Engine.Pawn.IsControlled
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa630284
	// Params: [ Num(1) Size(0x1) ]
	bool IsControlled();

	// Object: Function Engine.Pawn.IsBotControlled
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62ffc8
	// Params: [ Num(1) Size(0x1) ]
	bool IsBotControlled();

	// Object: Function Engine.Pawn.GetPendingMovementInputVector
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62fde0
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetPendingMovementInputVector();

	// Object: Function Engine.Pawn.GetNavAgentLocation
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa630088
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetNavAgentLocation();

	// Object: Function Engine.Pawn.GetMovementComponent
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6304d4
	// Params: [ Num(1) Size(0x8) ]
	struct UPawnMovementComponent* GetMovementComponent();

	// Object: Function Engine.Pawn.GetMovementBaseActor
	// Flags: [Final|Native|Static|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa6302bc
	// Params: [ Num(2) Size(0x10) ]
	struct AActor* GetMovementBaseActor(struct APawn* Pawn);

	// Object: Function Engine.Pawn.GetLastMovementInputVector
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62fda8
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetLastMovementInputVector();

	// Object: Function Engine.Pawn.GetControlRotation
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6301f8
	// Params: [ Num(1) Size(0xC) ]
	struct FRotator GetControlRotation();

	// Object: Function Engine.Pawn.GetController
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa630230
	// Params: [ Num(1) Size(0x8) ]
	struct AController* GetController();

	// Object: Function Engine.Pawn.GetBaseAimRotation
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62ff88
	// Params: [ Num(1) Size(0xC) ]
	struct FRotator GetBaseAimRotation();

	// Object: Function Engine.Pawn.DetachFromControllerPendingDestroy
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62ff6c
	// Params: [ Num(0) Size(0x0) ]
	void DetachFromControllerPendingDestroy();

	// Object: Function Engine.Pawn.ConsumeMovementInputVector
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa62fd68
	// Params: [ Num(1) Size(0xC) ]
	struct FVector ConsumeMovementInputVector();

	// Object: Function Engine.Pawn.AddMovementInput
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa62fe18
	// Params: [ Num(3) Size(0x11) ]
	void AddMovementInput(struct FVector WorldDirection, float ScaleValue, bool bForce);

	// Object: Function Engine.Pawn.AddControllerYawInput
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62fc08
	// Params: [ Num(1) Size(0x4) ]
	void AddControllerYawInput(float Val);

	// Object: Function Engine.Pawn.AddControllerRollInput
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62fb58
	// Params: [ Num(1) Size(0x4) ]
	void AddControllerRollInput(float Val);

	// Object: Function Engine.Pawn.AddControllerPitchInput
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62fcb8
	// Params: [ Num(1) Size(0x4) ]
	void AddControllerPitchInput(float Val);
};

// Object: Class Engine.DefaultPawn
// Size: 0x368 (Inherited: 0x340)
struct ADefaultPawn : APawn
{
	float BaseTurnRate; // 0x33C(0x4)
	float BaseLookUpRate; // 0x340(0x4)
	struct UPawnMovementComponent* MovementComponent; // 0x348(0x8)
	struct USphereComponent* CollisionComponent; // 0x350(0x8)
	struct UStaticMeshComponent* MeshComponent; // 0x358(0x8)
	uint8_t bAddDefaultMovementBindings : 1; // 0x360(0x1), Mask(0x1)
	uint8_t BitPad_0x360_1 : 7; // 0x360(0x1)
	uint8_t Pad_0x361[0x7]; // 0x361(0x7)


	// Object: Function Engine.DefaultPawn.TurnAtRate
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4eee3c
	// Params: [ Num(1) Size(0x4) ]
	void TurnAtRate(float Rate);

	// Object: Function Engine.DefaultPawn.MoveUp_World
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4eeeec
	// Params: [ Num(1) Size(0x4) ]
	void MoveUp_World(float Val);

	// Object: Function Engine.DefaultPawn.MoveRight
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4eef9c
	// Params: [ Num(1) Size(0x4) ]
	void MoveRight(float Val);

	// Object: Function Engine.DefaultPawn.MoveForward
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4ef04c
	// Params: [ Num(1) Size(0x4) ]
	void MoveForward(float Val);

	// Object: Function Engine.DefaultPawn.LookUpAtRate
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4eed8c
	// Params: [ Num(1) Size(0x4) ]
	void LookUpAtRate(float Rate);
};

// Object: Class Engine.BlueprintCore
// Size: 0x50 (Inherited: 0x28)
struct UBlueprintCore : UObject
{
	struct UObject* SkeletonGeneratedClass; // 0x28(0x8)
	struct UObject* GeneratedClass; // 0x30(0x8)
	bool bLegacyNeedToPurgeSkelRefs; // 0x38(0x1)
	uint8_t Pad_0x39[0x3]; // 0x39(0x3)
	struct FGuid BlueprintGuid; // 0x3C(0x10)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)
};

// Object: Class Engine.Blueprint
// Size: 0xA0 (Inherited: 0x50)
struct UBlueprint : UBlueprintCore
{
	struct UObject* ParentClass; // 0x50(0x8)
	uint8_t BlueprintType; // 0x58(0x1)
	uint8_t bRecompileOnLoad : 1; // 0x59(0x1), Mask(0x1)
	uint8_t bHasBeenRegenerated : 1; // 0x59(0x1), Mask(0x2)
	uint8_t bIsRegeneratingOnLoad : 1; // 0x59(0x1), Mask(0x4)
	uint8_t BitPad_0x59_3 : 5; // 0x59(0x1)
	uint8_t Pad_0x5A[0x2]; // 0x5A(0x2)
	int32_t BlueprintSystemVersion; // 0x5C(0x4)
	struct USimpleConstructionScript* SimpleConstructionScript; // 0x60(0x8)
	struct TArray<struct UActorComponent*> ComponentTemplates; // 0x68(0x10)
	struct TArray<struct UTimelineTemplate*> Timelines; // 0x78(0x10)
	struct TArray<struct FBPComponentClassOverride> ComponentClassOverrides; // 0x88(0x10)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0x98(0x8)
};

// Object: Class Engine.DataAsset
// Size: 0x30 (Inherited: 0x28)
struct UDataAsset : UObject
{
	struct UDataAsset* NativeClass; // 0x28(0x8)
};

// Object: Class Engine.ReplicationDriver
// Size: 0x28 (Inherited: 0x28)
struct UReplicationDriver : UObject
{
};

// Object: Class Engine.ReplicationConnectionDriver
// Size: 0x28 (Inherited: 0x28)
struct UReplicationConnectionDriver : UObject
{
};

// Object: Class Engine.FXSystemComponent
// Size: 0x5F0 (Inherited: 0x5F0)
struct UFXSystemComponent : UPrimitiveComponent
{

	// Object: Function Engine.FXSystemComponent.SetVectorParameter
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa62c834
	// Params: [ Num(2) Size(0x14) ]
	void SetVectorParameter(struct FName ParameterName, struct FVector Param);

	// Object: Function Engine.FXSystemComponent.SetUseAutoManageAttachment
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62c2bc
	// Params: [ Num(1) Size(0x1) ]
	void SetUseAutoManageAttachment(bool bAutoManage);

	// Object: Function Engine.FXSystemComponent.SetFloatParameter
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62c924
	// Params: [ Num(2) Size(0xC) ]
	void SetFloatParameter(struct FName ParameterName, float Param);

	// Object: Function Engine.FXSystemComponent.SetEmitterEnable
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62c524
	// Params: [ Num(2) Size(0x9) ]
	void SetEmitterEnable(struct FName EmitterName, bool bNewEnableState);

	// Object: Function Engine.FXSystemComponent.SetColorParameter
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa62c744
	// Params: [ Num(2) Size(0x18) ]
	void SetColorParameter(struct FName ParameterName, struct FLinearColor Param);

	// Object: Function Engine.FXSystemComponent.SetBoolParameter
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62ca14
	// Params: [ Num(2) Size(0x9) ]
	void SetBoolParameter(struct FName ParameterName, bool Param);

	// Object: Function Engine.FXSystemComponent.SetAutoAttachmentParameters
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62c374
	// Params: [ Num(5) Size(0x13) ]
	void SetAutoAttachmentParameters(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule);

	// Object: Function Engine.FXSystemComponent.SetActorParameter
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62c658
	// Params: [ Num(2) Size(0x10) ]
	void SetActorParameter(struct FName ParameterName, struct AActor* Param);

	// Object: Function Engine.FXSystemComponent.ReleaseToPool
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62c2a0
	// Params: [ Num(0) Size(0x0) ]
	void ReleaseToPool();

	// Object: Function Engine.FXSystemComponent.GetFXSystemAsset
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62c61c
	// Params: [ Num(1) Size(0x8) ]
	struct UFXSystemAsset* GetFXSystemAsset();
};

// Object: Class Engine.ParticleSystemComponent
// Size: 0x890 (Inherited: 0x5F0)
struct UParticleSystemComponent : UFXSystemComponent
{
	struct UParticleSystem* Template; // 0x5F0(0x8)
	struct TArray<struct UMaterialInterface*> EmitterMaterials; // 0x5F8(0x10)
	struct TArray<struct USkeletalMeshComponent*> SkelMeshComponents; // 0x608(0x10)
	uint8_t Pad_0x618[0x1]; // 0x618(0x1)
	uint8_t bResetOnDetach : 1; // 0x619(0x1), Mask(0x1)
	uint8_t bUpdateOnDedicatedServer : 1; // 0x619(0x1), Mask(0x2)
	uint8_t BitPad_0x619_2 : 2; // 0x619(0x1)
	uint8_t bAllowRecycling : 1; // 0x619(0x1), Mask(0x10)
	uint8_t bAutoManageAttachment : 1; // 0x619(0x1), Mask(0x20)
	uint8_t bAutoAttachWeldSimulatedBodies : 1; // 0x619(0x1), Mask(0x40)
	uint8_t BitPad_0x619_7 : 1; // 0x619(0x1)
	uint8_t BitPad_0x61A_0 : 1; // 0x61A(0x1)
	uint8_t bWarmingUp : 1; // 0x61A(0x1), Mask(0x2)
	uint8_t bOverrideLODMethod : 1; // 0x61A(0x1), Mask(0x4)
	uint8_t bSkipUpdateDynamicDataDuringTick : 1; // 0x61A(0x1), Mask(0x8)
	uint8_t BitPad_0x61A_4 : 4; // 0x61A(0x1)
	uint8_t Pad_0x61B[0xA]; // 0x61B(0xA)
	uint8_t LODMethod; // 0x625(0x1)
	enum class EParticleSignificanceLevel RequiredSignificance; // 0x626(0x1)
	uint8_t Pad_0x627[0x1]; // 0x627(0x1)
	struct TArray<struct FParticleSysParam> InstanceParameters; // 0x628(0x10)
	struct FMulticastInlineDelegate OnParticleSpawn; // 0x638(0x10)
	struct FMulticastInlineDelegate OnParticleBurst; // 0x648(0x10)
	struct FMulticastInlineDelegate OnParticleDeath; // 0x658(0x10)
	struct FMulticastInlineDelegate OnParticleCollide; // 0x668(0x10)
	bool bOldPositionValid; // 0x678(0x1)
	uint8_t Pad_0x679[0x3]; // 0x679(0x3)
	struct FVector OldPosition; // 0x67C(0xC)
	struct FVector PartSysVelocity; // 0x688(0xC)
	float WarmupTime; // 0x694(0x4)
	float WarmupTickRate; // 0x698(0x4)
	uint8_t Pad_0x69C[0x4]; // 0x69C(0x4)
	float SecondsBeforeInactive; // 0x6A0(0x4)
	uint8_t Pad_0x6A4[0x4]; // 0x6A4(0x4)
	float MaxTimeBeforeForceUpdateTransform; // 0x6A8(0x4)
	uint8_t Pad_0x6AC[0x1C]; // 0x6AC(0x1C)
	struct TArray<struct UParticleSystemReplay*> ReplayClips; // 0x6C8(0x10)
	uint8_t Pad_0x6D8[0x8]; // 0x6D8(0x8)
	float CustomTimeDilation; // 0x6E0(0x4)
	uint8_t Pad_0x6E4[0x54]; // 0x6E4(0x54)
	struct TWeakObjectPtr<struct USceneComponent> AutoAttachParent; // 0x738(0x8)
	struct FName AutoAttachSocketName; // 0x740(0x8)
	enum class EAttachmentRule AutoAttachLocationRule; // 0x748(0x1)
	enum class EAttachmentRule AutoAttachRotationRule; // 0x749(0x1)
	enum class EAttachmentRule AutoAttachScaleRule; // 0x74A(0x1)
	uint8_t Pad_0x74B[0x2D]; // 0x74B(0x2D)
	struct FMulticastInlineDelegate OnSystemFinished; // 0x778(0x10)
	struct FMulticastInlineDelegate OnPreSystemActivated; // 0x788(0x10)
	uint8_t Pad_0x798[0xF8]; // 0x798(0xF8)


	// Object: Function Engine.ParticleSystemComponent.SetTrailSourceData
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa62d378
	// Params: [ Num(4) Size(0x18) ]
	void SetTrailSourceData(struct FName InFirstSocketName, struct FName InSecondSocketName, uint8_t InWidthMode, float InWidth);

	// Object: Function Engine.ParticleSystemComponent.SetTemplate
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa62d688
	// Params: [ Num(1) Size(0x8) ]
	void SetTemplate(struct UParticleSystem* NewTemplate);

	// Object: Function Engine.ParticleSystemComponent.SetMaterialParameter
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa62d730
	// Params: [ Num(2) Size(0x10) ]
	void SetMaterialParameter(struct FName ParameterName, struct UMaterialInterface* Param);

	// Object: Function Engine.ParticleSystemComponent.SetBeamTargetTangent
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa62e1e8
	// Params: [ Num(3) Size(0x14) ]
	void SetBeamTargetTangent(int32_t EmitterIndex, struct FVector NewTangentPoint, int32_t TargetIndex);

	// Object: Function Engine.ParticleSystemComponent.SetBeamTargetStrength
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62e0b8
	// Params: [ Num(3) Size(0xC) ]
	void SetBeamTargetStrength(int32_t EmitterIndex, float NewTargetStrength, int32_t TargetIndex);

	// Object: Function Engine.ParticleSystemComponent.SetBeamTargetPoint
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa62e318
	// Params: [ Num(3) Size(0x14) ]
	void SetBeamTargetPoint(int32_t EmitterIndex, struct FVector NewTargetPoint, int32_t TargetIndex);

	// Object: Function Engine.ParticleSystemComponent.SetBeamSourceTangent
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa62e578
	// Params: [ Num(3) Size(0x14) ]
	void SetBeamSourceTangent(int32_t EmitterIndex, struct FVector NewTangentPoint, int32_t SourceIndex);

	// Object: Function Engine.ParticleSystemComponent.SetBeamSourceStrength
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62e448
	// Params: [ Num(3) Size(0xC) ]
	void SetBeamSourceStrength(int32_t EmitterIndex, float NewSourceStrength, int32_t SourceIndex);

	// Object: Function Engine.ParticleSystemComponent.SetBeamSourcePoint
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa62e6a8
	// Params: [ Num(3) Size(0x14) ]
	void SetBeamSourcePoint(int32_t EmitterIndex, struct FVector NewSourcePoint, int32_t SourceIndex);

	// Object: Function Engine.ParticleSystemComponent.SetBeamEndPoint
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa62e7d8
	// Params: [ Num(2) Size(0x10) ]
	void SetBeamEndPoint(int32_t EmitterIndex, struct FVector NewEndPoint);

	// Object: Function Engine.ParticleSystemComponent.SetAutoAttachParams
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa62e8c8
	// Params: [ Num(3) Size(0x11) ]
	void SetAutoAttachParams(struct USceneComponent* Parent, struct FName SocketName, uint8_t LocationType);

	// Object: Function Engine.ParticleSystemComponent.GetNumActiveParticles
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62d654
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetNumActiveParticles();

	// Object: Function Engine.ParticleSystemComponent.GetNamedMaterial
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62d1cc
	// Params: [ Num(2) Size(0x10) ]
	struct UMaterialInterface* GetNamedMaterial(struct FName InName);

	// Object: Function Engine.ParticleSystemComponent.GetBeamTargetTangent
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62d95c
	// Params: [ Num(4) Size(0x15) ]
	bool GetBeamTargetTangent(int32_t EmitterIndex, int32_t TargetIndex, struct FVector& OutTangentPoint);

	// Object: Function Engine.ParticleSystemComponent.GetBeamTargetStrength
	// Flags: [Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62d814
	// Params: [ Num(4) Size(0xD) ]
	bool GetBeamTargetStrength(int32_t EmitterIndex, int32_t TargetIndex, float& OutTargetStrength);

	// Object: Function Engine.ParticleSystemComponent.GetBeamTargetPoint
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62daa0
	// Params: [ Num(4) Size(0x15) ]
	bool GetBeamTargetPoint(int32_t EmitterIndex, int32_t TargetIndex, struct FVector& OutTargetPoint);

	// Object: Function Engine.ParticleSystemComponent.GetBeamSourceTangent
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62dd2c
	// Params: [ Num(4) Size(0x15) ]
	bool GetBeamSourceTangent(int32_t EmitterIndex, int32_t SourceIndex, struct FVector& OutTangentPoint);

	// Object: Function Engine.ParticleSystemComponent.GetBeamSourceStrength
	// Flags: [Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62dbe4
	// Params: [ Num(4) Size(0xD) ]
	bool GetBeamSourceStrength(int32_t EmitterIndex, int32_t SourceIndex, float& OutSourceStrength);

	// Object: Function Engine.ParticleSystemComponent.GetBeamSourcePoint
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62de70
	// Params: [ Num(4) Size(0x15) ]
	bool GetBeamSourcePoint(int32_t EmitterIndex, int32_t SourceIndex, struct FVector& OutSourcePoint);

	// Object: Function Engine.ParticleSystemComponent.GetBeamEndPoint
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa62dfb4
	// Params: [ Num(3) Size(0x11) ]
	bool GetBeamEndPoint(int32_t EmitterIndex, struct FVector& OutEndPoint);

	// Object: Function Engine.ParticleSystemComponent.GenerateParticleEvent
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa62d020
	// Params: [ Num(5) Size(0x30) ]
	void GenerateParticleEvent(struct FName InEventName, float InEmitterTime, struct FVector InLocation, struct FVector InDirection, struct FVector InVelocity);

	// Object: Function Engine.ParticleSystemComponent.EndTrails
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa62d4dc
	// Params: [ Num(0) Size(0x0) ]
	void EndTrails();

	// Object: Function Engine.ParticleSystemComponent.CreateNamedDynamicMaterialInstance
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa62d284
	// Params: [ Num(3) Size(0x18) ]
	struct UMaterialInstanceDynamic* CreateNamedDynamicMaterialInstance(struct FName InName, struct UMaterialInterface* SourceMaterial);

	// Object: Function Engine.ParticleSystemComponent.BeginTrails
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa62d4f0
	// Params: [ Num(4) Size(0x18) ]
	void BeginTrails(struct FName InFirstSocketName, struct FName InSecondSocketName, uint8_t InWidthMode, float InWidth);
};

// Object: Class Engine.Subsystem
// Size: 0x30 (Inherited: 0x28)
struct USubsystem : UObject
{
	uint8_t Pad_0x28[0x8]; // 0x28(0x8)
};

// Object: Class Engine.GameInstance
// Size: 0x1A0 (Inherited: 0x28)
struct UGameInstance : UObject
{
	uint8_t Pad_0x28[0x10]; // 0x28(0x10)
	struct TArray<struct ULocalPlayer*> LocalPlayers; // 0x38(0x10)
	struct UOnlineSession* OnlineSession; // 0x48(0x8)
	struct TArray<struct UObject*> ReferencedObjects; // 0x50(0x10)
	uint8_t Pad_0x60[0x140]; // 0x60(0x140)


	// Object: Function Engine.GameInstance.ReceiveShutdown
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void ReceiveShutdown();

	// Object: Function Engine.GameInstance.ReceiveInit
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void ReceiveInit();

	// Object: Function Engine.GameInstance.HandleTravelError
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x1) ]
	void HandleTravelError(uint8_t FailureType);

	// Object: Function Engine.GameInstance.HandleNetworkError
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(2) Size(0x2) ]
	void HandleNetworkError(uint8_t FailureType, bool bIsServer);

	// Object: Function Engine.GameInstance.DebugRemovePlayer
	// Flags: [Exec|Native|Public]
	// Offset: 0xa51a6dc
	// Params: [ Num(1) Size(0x4) ]
	void DebugRemovePlayer(int32_t ControllerId);

	// Object: Function Engine.GameInstance.DebugCreatePlayer
	// Flags: [Exec|Native|Public]
	// Offset: 0xa51a78c
	// Params: [ Num(1) Size(0x4) ]
	void DebugCreatePlayer(int32_t ControllerId);
};

// Object: Class Engine.GameInstanceSubsystem
// Size: 0x30 (Inherited: 0x30)
struct UGameInstanceSubsystem : USubsystem
{
};

// Object: Class Engine.AnimNotifyState
// Size: 0x30 (Inherited: 0x28)
struct UAnimNotifyState : UObject
{
	uint8_t Pad_0x28[0x1]; // 0x28(0x1)
	bool bBranchingPointEndOnBlendOutWhenInterrupted; // 0x29(0x1)
	uint8_t Pad_0x2A[0x6]; // 0x2A(0x6)


	// Object: Function Engine.AnimNotifyState.Received_NotifyTick
	// Flags: [Event|Public|BlueprintEvent|Const]
	// Offset: 0x88270d8
	// Params: [ Num(4) Size(0x15) ]
	bool Received_NotifyTick(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float FrameDeltaTime);

	// Object: Function Engine.AnimNotifyState.Received_NotifyEnd
	// Flags: [Event|Public|BlueprintEvent|Const]
	// Offset: 0x88270d8
	// Params: [ Num(3) Size(0x11) ]
	bool Received_NotifyEnd(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation);

	// Object: Function Engine.AnimNotifyState.Received_NotifyBegin
	// Flags: [Event|Public|BlueprintEvent|Const]
	// Offset: 0x88270d8
	// Params: [ Num(4) Size(0x15) ]
	bool Received_NotifyBegin(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float TotalDuration);

	// Object: Function Engine.AnimNotifyState.GetNotifyName
	// Flags: [Native|Event|Public|BlueprintEvent|Const]
	// Offset: 0xa49029c
	// Params: [ Num(1) Size(0x10) ]
	struct FString GetNotifyName();
};

// Object: Class Engine.AssetImportData
// Size: 0x28 (Inherited: 0x28)
struct UAssetImportData : UObject
{
};

// Object: Class Engine.AssetUserData
// Size: 0x28 (Inherited: 0x28)
struct UAssetUserData : UObject
{
};

// Object: Class Engine.DeveloperSettings
// Size: 0x38 (Inherited: 0x28)
struct UDeveloperSettings : UObject
{
	uint8_t Pad_0x28[0x10]; // 0x28(0x10)
};

// Object: Class Engine.Brush
// Size: 0x318 (Inherited: 0x2E0)
struct ABrush : AActor
{
	uint8_t BrushType; // 0x2E0(0x1)
	uint8_t Pad_0x2E1[0x3]; // 0x2E1(0x3)
	struct FColor BrushColor; // 0x2E4(0x4)
	int32_t PolyFlags; // 0x2E8(0x4)
	uint8_t bColored : 1; // 0x2EC(0x1), Mask(0x1)
	uint8_t bSolidWhenSelected : 1; // 0x2EC(0x1), Mask(0x2)
	uint8_t bPlaceableFromClassBrowser : 1; // 0x2EC(0x1), Mask(0x4)
	uint8_t bNotForClientOrServer : 1; // 0x2EC(0x1), Mask(0x8)
	uint8_t BitPad_0x2EC_4 : 4; // 0x2EC(0x1)
	uint8_t Pad_0x2ED[0x3]; // 0x2ED(0x3)
	struct UModel* Brush; // 0x2F0(0x8)
	struct UBrushComponent* BrushComponent; // 0x2F8(0x8)
	uint8_t bInManipulation : 1; // 0x300(0x1), Mask(0x1)
	uint8_t BitPad_0x300_1 : 7; // 0x300(0x1)
	uint8_t Pad_0x301[0x7]; // 0x301(0x7)
	struct TArray<struct FGeomSelection> SavedSelections; // 0x308(0x10)
};

// Object: Class Engine.Volume
// Size: 0x318 (Inherited: 0x318)
struct AVolume : ABrush
{
};

// Object: Class Engine.World
// Size: 0x860 (Inherited: 0x28)
struct UWorld : UObject
{
	uint8_t Pad_0x28[0x8]; // 0x28(0x8)
	struct ULevel* PersistentLevel; // 0x30(0x8)
	struct UNetDriver* NetDriver; // 0x38(0x8)
	struct ULineBatchComponent* LineBatcher; // 0x40(0x8)
	struct ULineBatchComponent* PersistentLineBatcher; // 0x48(0x8)
	struct ULineBatchComponent* ForegroundLineBatcher; // 0x50(0x8)
	struct AGameNetworkManager* NetworkManager; // 0x58(0x8)
	struct UPhysicsCollisionHandler* PhysicsCollisionHandler; // 0x60(0x8)
	struct TArray<struct UObject*> ExtraReferencedObjects; // 0x68(0x10)
	struct TArray<struct UObject*> PerModuleDataObjects; // 0x78(0x10)
	struct TArray<struct AActor*> LevelSequenceActors; // 0x88(0x10)
	uint8_t Pad_0x98[0x30]; // 0x98(0x30)
	struct TArray<struct ULevelStreaming*> StreamingLevels; // 0xC8(0x10)
	struct FStreamingLevelsToConsider StreamingLevelsToConsider; // 0xD8(0x30)
	uint8_t Pad_0x108[0x18]; // 0x108(0x18)
	struct FString StreamingLevelsPrefix; // 0x120(0x10)
	struct ULevel* CurrentLevelPendingVisibility; // 0x130(0x8)
	struct ULevel* CurrentLevelPendingInvisibility; // 0x138(0x8)
	struct UDemoNetDriver* DemoNetDriver; // 0x140(0x8)
	struct AParticleEventManager* MyParticleEventManager; // 0x148(0x8)
	struct APhysicsVolume* DefaultPhysicsVolume; // 0x150(0x8)
	uint8_t Pad_0x158[0x16]; // 0x158(0x16)
	uint8_t BitPad_0x16E_0 : 2; // 0x16E(0x1)
	uint8_t bAreConstraintsDirty : 1; // 0x16E(0x1), Mask(0x4)
	uint8_t BitPad_0x16E_3 : 5; // 0x16E(0x1)
	uint8_t Pad_0x16F[0x21]; // 0x16F(0x21)
	struct UNavigationSystemBase* NavigationSystem; // 0x190(0x8)
	struct AGameModeBase* AuthorityGameMode; // 0x198(0x8)
	struct AGameStateBase* GameState; // 0x1A0(0x8)
	struct UAISystemBase* AISystem; // 0x1A8(0x8)
	struct UAvoidanceManager* AvoidanceManager; // 0x1B0(0x8)
	struct TArray<struct ULevel*> Levels; // 0x1B8(0x10)
	struct TArray<struct FLevelCollection> LevelCollections; // 0x1C8(0x10)
	uint8_t Pad_0x1D8[0x20]; // 0x1D8(0x20)
	struct UGameInstance* OwningGameInstance; // 0x1F8(0x8)
	struct TArray<struct UMaterialParameterCollectionInstance*> ParameterCollectionInstances; // 0x200(0x10)
	struct UCanvas* CanvasForRenderingToTarget; // 0x210(0x8)
	struct UCanvas* CanvasForDrawMaterialToRenderTarget; // 0x218(0x8)
	uint8_t Pad_0x220[0x50]; // 0x220(0x50)
	struct TArray<struct UActorComponent*> ComponentsThatNeedEndOfFrameUpdate; // 0x270(0x10)
	struct TArray<struct UActorComponent*> ComponentsThatNeedEndOfFrameUpdate_OnGameThread; // 0x280(0x10)
	uint8_t Pad_0x290[0x3A8]; // 0x290(0x3A8)
	struct UWorldComposition* WorldComposition; // 0x638(0x8)
	uint8_t Pad_0x640[0xA8]; // 0x640(0xA8)
	struct FWorldPSCPool PSCPool; // 0x6E8(0x58)
	uint8_t Pad_0x740[0x120]; // 0x740(0x120)


	// Object: Function Engine.World.K2_GetWorldSettings
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6dbf00
	// Params: [ Num(1) Size(0x8) ]
	struct AWorldSettings* K2_GetWorldSettings();

	// Object: Function Engine.World.HandleTimelineScrubbed
	// Flags: [Final|Native|Public]
	// Offset: 0xa6dbf34
	// Params: [ Num(0) Size(0x0) ]
	void HandleTimelineScrubbed();
};

// Object: Class Engine.BlueprintAsyncActionBase
// Size: 0x30 (Inherited: 0x28)
struct UBlueprintAsyncActionBase : UObject
{
	uint8_t Pad_0x28[0x8]; // 0x28(0x8)


	// Object: Function Engine.BlueprintAsyncActionBase.Activate
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4b2eb4
	// Params: [ Num(0) Size(0x0) ]
	void Activate();
};

// Object: Class Engine.ScriptViewportClient
// Size: 0x38 (Inherited: 0x28)
struct UScriptViewportClient : UObject
{
	uint8_t Pad_0x28[0x10]; // 0x28(0x10)
};

// Object: Class Engine.Engine
// Size: 0xEC8 (Inherited: 0x28)
struct UEngine : UObject
{
	uint8_t Pad_0x28[0x8]; // 0x28(0x8)
	struct UFont* TinyFont; // 0x30(0x8)
	struct FSoftObjectPath TinyFontName; // 0x38(0x18)
	struct UFont* SmallFont; // 0x50(0x8)
	struct FSoftObjectPath SmallFontName; // 0x58(0x18)
	struct UFont* MediumFont; // 0x70(0x8)
	struct FSoftObjectPath MediumFontName; // 0x78(0x18)
	struct UFont* LargeFont; // 0x90(0x8)
	struct FSoftObjectPath LargeFontName; // 0x98(0x18)
	struct UFont* SubtitleFont; // 0xB0(0x8)
	struct FSoftObjectPath SubtitleFontName; // 0xB8(0x18)
	struct TArray<struct UFont*> AdditionalFonts; // 0xD0(0x10)
	uint8_t Pad_0xE0[0x8]; // 0xE0(0x8)
	struct TArray<struct FString> AdditionalFontNames; // 0xE8(0x10)
	struct UConsole* ConsoleClass; // 0xF8(0x8)
	struct FSoftClassPath ConsoleClassName; // 0x100(0x18)
	struct UGameViewportClient* GameViewportClientClass; // 0x118(0x8)
	struct FSoftClassPath GameViewportClientClassName; // 0x120(0x18)
	struct ULocalPlayer* LocalPlayerClass; // 0x138(0x8)
	struct FSoftClassPath LocalPlayerClassName; // 0x140(0x18)
	struct AWorldSettings* WorldSettingsClass; // 0x158(0x8)
	struct FSoftClassPath WorldSettingsClassName; // 0x160(0x18)
	struct FSoftClassPath NavigationSystemClassName; // 0x178(0x18)
	struct UNavigationSystemBase* NavigationSystemClass; // 0x190(0x8)
	struct FSoftClassPath NavigationSystemConfigClassName; // 0x198(0x18)
	struct UNavigationSystemConfig* NavigationSystemConfigClass; // 0x1B0(0x8)
	struct FSoftClassPath AvoidanceManagerClassName; // 0x1B8(0x18)
	struct UAvoidanceManager* AvoidanceManagerClass; // 0x1D0(0x8)
	struct UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x1D8(0x8)
	struct FSoftClassPath PhysicsCollisionHandlerClassName; // 0x1E0(0x18)
	struct FSoftClassPath GameUserSettingsClassName; // 0x1F8(0x18)
	struct UGameUserSettings* GameUserSettingsClass; // 0x210(0x8)
	struct FSoftClassPath AIControllerClassName; // 0x218(0x18)
	struct UGameUserSettings* GameUserSettings; // 0x230(0x8)
	struct ALevelScriptActor* LevelScriptActorClass; // 0x238(0x8)
	struct FSoftClassPath LevelScriptActorClassName; // 0x240(0x18)
	struct FSoftClassPath DefaultBlueprintBaseClassName; // 0x258(0x18)
	struct FSoftClassPath GameSingletonClassName; // 0x270(0x18)
	struct UObject* GameSingleton; // 0x288(0x8)
	struct FSoftClassPath AssetManagerClassName; // 0x290(0x18)
	struct UAssetManager* AssetManager; // 0x2A8(0x8)
	struct FSoftClassPath RuntimeAssetsCollectionClassName; // 0x2B0(0x18)
	struct URuntimeAssetsCollectionBase* RuntimeAssetsCollection; // 0x2C8(0x8)
	struct UTexture2D* DefaultTexture; // 0x2D0(0x8)
	struct FSoftObjectPath DefaultTextureName; // 0x2D8(0x18)
	struct UTexture* DefaultDiffuseTexture; // 0x2F0(0x8)
	struct FSoftObjectPath DefaultDiffuseTextureName; // 0x2F8(0x18)
	struct UTexture2D* DefaultBSPVertexTexture; // 0x310(0x8)
	struct FSoftObjectPath DefaultBSPVertexTextureName; // 0x318(0x18)
	struct UTexture2D* HighFrequencyNoiseTexture; // 0x330(0x8)
	struct FSoftObjectPath HighFrequencyNoiseTextureName; // 0x338(0x18)
	struct UTexture2D* DefaultBokehTexture; // 0x350(0x8)
	struct FSoftObjectPath DefaultBokehTextureName; // 0x358(0x18)
	struct UTexture2D* DefaultBloomKernelTexture; // 0x370(0x8)
	struct FSoftObjectPath DefaultBloomKernelTextureName; // 0x378(0x18)
	struct UMaterial* WireframeMaterial; // 0x390(0x8)
	struct FString WireframeMaterialName; // 0x398(0x10)
	struct UMaterial* DebugMeshMaterial; // 0x3A8(0x8)
	struct FSoftObjectPath DebugMeshMaterialName; // 0x3B0(0x18)
	struct UMaterial* EmissiveMeshMaterial; // 0x3C8(0x8)
	struct FSoftObjectPath EmissiveMeshMaterialName; // 0x3D0(0x18)
	struct UMaterial* LevelColorationLitMaterial; // 0x3E8(0x8)
	struct FString LevelColorationLitMaterialName; // 0x3F0(0x10)
	struct UMaterial* LevelColorationUnlitMaterial; // 0x400(0x8)
	struct FString LevelColorationUnlitMaterialName; // 0x408(0x10)
	struct UMaterial* LightingTexelDensityMaterial; // 0x418(0x8)
	struct FString LightingTexelDensityName; // 0x420(0x10)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0x430(0x8)
	struct FString ShadedLevelColorationLitMaterialName; // 0x438(0x10)
	struct UMaterial* ShadedLevelColorationUnlitMaterial; // 0x448(0x8)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x450(0x10)
	struct UMaterial* RemoveSurfaceMaterial; // 0x460(0x8)
	struct FSoftObjectPath RemoveSurfaceMaterialName; // 0x468(0x18)
	struct UMaterial* VertexColorMaterial; // 0x480(0x8)
	struct FString VertexColorMaterialName; // 0x488(0x10)
	struct UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x498(0x8)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x4A0(0x10)
	struct UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x4B0(0x8)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x4B8(0x10)
	struct UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x4C8(0x8)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0x4D0(0x10)
	struct UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x4E0(0x8)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x4E8(0x10)
	struct UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x4F8(0x8)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x500(0x10)
	struct FSoftObjectPath DebugEditorMaterialName; // 0x510(0x18)
	struct UMaterial* ConstraintLimitMaterial; // 0x528(0x8)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x530(0x8)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x538(0x8)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x540(0x8)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x548(0x8)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x550(0x8)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x558(0x8)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x560(0x8)
	struct UMaterial* InvalidLightmapSettingsMaterial; // 0x568(0x8)
	struct FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x570(0x18)
	struct UMaterial* PreviewShadowsIndicatorMaterial; // 0x588(0x8)
	struct FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x590(0x18)
	struct UMaterial* ArrowMaterial; // 0x5A8(0x8)
	struct UMaterialInstanceDynamic* ArrowMaterialYellow; // 0x5B0(0x8)
	struct FSoftObjectPath ArrowMaterialName; // 0x5B8(0x18)
	struct FLinearColor LightingOnlyBrightness; // 0x5D0(0x10)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0x5E0(0x10)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x5F0(0x10)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0x600(0x10)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0x610(0x10)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x620(0x10)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0x630(0x10)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0x640(0x10)
	float MaxPixelShaderAdditiveComplexityCount; // 0x650(0x4)
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x654(0x4)
	float MinLightMapDensity; // 0x658(0x4)
	float IdealLightMapDensity; // 0x65C(0x4)
	float MaxLightMapDensity; // 0x660(0x4)
	uint8_t bRenderLightMapDensityGrayscale : 1; // 0x664(0x1), Mask(0x1)
	uint8_t BitPad_0x664_1 : 7; // 0x664(0x1)
	uint8_t Pad_0x665[0x3]; // 0x665(0x3)
	float RenderLightMapDensityGrayscaleScale; // 0x668(0x4)
	float RenderLightMapDensityColorScale; // 0x66C(0x4)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0x670(0x10)
	struct FLinearColor LightMapDensitySelectedColor; // 0x680(0x10)
	struct TArray<struct FStatColorMapping> StatColorMappings; // 0x690(0x10)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0x6A0(0x8)
	struct FSoftObjectPath DefaultPhysMaterialName; // 0x6A8(0x18)
	struct TArray<struct FGameNameRedirect> ActiveGameNameRedirects; // 0x6C0(0x10)
	struct TArray<struct FClassRedirect> ActiveClassRedirects; // 0x6D0(0x10)
	struct TArray<struct FPluginRedirect> ActivePluginRedirects; // 0x6E0(0x10)
	struct TArray<struct FStructRedirect> ActiveStructRedirects; // 0x6F0(0x10)
	struct UTexture2D* PreIntegratedSkinBRDFTexture; // 0x700(0x8)
	struct FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x708(0x18)
	struct UTexture2D* ToonRampTexture; // 0x720(0x8)
	struct FSoftObjectPath ToonRampTextureName; // 0x728(0x18)
	struct UCurveLinearColorAtlas* SkyOcclusionCurveAtlas; // 0x740(0x8)
	struct FSoftObjectPath SkyOcclusionCurveAtlasName; // 0x748(0x18)
	struct UTexture2D* BlueNoiseTexture; // 0x760(0x8)
	struct FSoftObjectPath BlueNoiseTextureName; // 0x768(0x18)
	struct UTexture2D* STBNoiseTexture; // 0x780(0x8)
	struct FSoftObjectPath STBNoiseTextureName; // 0x788(0x18)
	struct UTexture2D* MiniFontTexture; // 0x7A0(0x8)
	struct FSoftObjectPath MiniFontTextureName; // 0x7A8(0x18)
	struct UTexture* WeightMapPlaceholderTexture; // 0x7C0(0x8)
	struct FSoftObjectPath WeightMapPlaceholderTextureName; // 0x7C8(0x18)
	struct UTexture2D* LightMapDensityTexture; // 0x7E0(0x8)
	struct FSoftObjectPath LightMapDensityTextureName; // 0x7E8(0x18)
	uint8_t Pad_0x800[0x8]; // 0x800(0x8)
	struct UGameViewportClient* GameViewport; // 0x808(0x8)
	struct TArray<struct FString> DeferredCommands; // 0x810(0x10)
	int32_t TickCycles; // 0x820(0x4)
	int32_t GameCycles; // 0x824(0x4)
	int32_t ClientCycles; // 0x828(0x4)
	float NearClipPlane; // 0x82C(0x4)
	uint8_t bHardwareSurveyEnabled : 1; // 0x830(0x1), Mask(0x1)
	uint8_t bSubtitlesEnabled : 1; // 0x830(0x1), Mask(0x2)
	uint8_t bSubtitlesForcedOff : 1; // 0x830(0x1), Mask(0x4)
	uint8_t BitPad_0x830_3 : 5; // 0x830(0x1)
	uint8_t Pad_0x831[0x3]; // 0x831(0x3)
	int32_t MaximumLoopIterationCount; // 0x834(0x4)
	uint8_t bCanBlueprintsTickByDefault : 1; // 0x838(0x1), Mask(0x1)
	uint8_t bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x838(0x1), Mask(0x2)
	uint8_t bAllowMultiThreadedAnimationUpdate : 1; // 0x838(0x1), Mask(0x4)
	uint8_t bEnableEditorPSysRealtimeLOD : 1; // 0x838(0x1), Mask(0x8)
	uint8_t BitPad_0x838_4 : 1; // 0x838(0x1)
	uint8_t bSmoothFrameRate : 1; // 0x838(0x1), Mask(0x20)
	uint8_t bUseFixedFrameRate : 1; // 0x838(0x1), Mask(0x40)
	uint8_t BitPad_0x838_7 : 1; // 0x838(0x1)
	uint8_t Pad_0x839[0x3]; // 0x839(0x3)
	float FixedFrameRate; // 0x83C(0x4)
	struct FFloatRange SmoothedFrameRateRange; // 0x840(0x10)
	struct UEngineCustomTimeStep* CustomTimeStep; // 0x850(0x8)
	uint8_t Pad_0x858[0x20]; // 0x858(0x20)
	struct FString SkipLODStripStaticMeshNames; // 0x878(0x10)
	struct TArray<struct FString> PrefixStripMeshLODNames; // 0x888(0x10)
	struct TArray<struct FString> PrefixSkipStripSkeletalMeshLODNames; // 0x898(0x10)
	struct FString MobileCharacterPrefixName; // 0x8A8(0x10)
	struct FSoftClassPath CustomTimeStepClassName; // 0x8B8(0x18)
	struct UTimecodeProvider* TimecodeProvider; // 0x8D0(0x8)
	uint8_t Pad_0x8D8[0x20]; // 0x8D8(0x20)
	struct FSoftClassPath TimecodeProviderClassName; // 0x8F8(0x18)
	bool bGenerateDefaultTimecode; // 0x910(0x1)
	uint8_t Pad_0x911[0x3]; // 0x911(0x3)
	struct FFrameRate GenerateDefaultTimecodeFrameRate; // 0x914(0x8)
	float GenerateDefaultTimecodeFrameDelay; // 0x91C(0x4)
	uint8_t bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x920(0x1), Mask(0x1)
	uint8_t BitPad_0x920_1 : 7; // 0x920(0x1)
	uint8_t Pad_0x921[0x3]; // 0x921(0x3)
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x924(0x4)
	uint8_t bShouldGenerateLowQualityLightmaps : 1; // 0x928(0x1), Mask(0x1)
	uint8_t BitPad_0x928_1 : 7; // 0x928(0x1)
	uint8_t Pad_0x929[0x3]; // 0x929(0x3)
	struct FColor C_WorldBox; // 0x92C(0x4)
	struct FColor C_BrushWire; // 0x930(0x4)
	struct FColor C_AddWire; // 0x934(0x4)
	struct FColor C_SubtractWire; // 0x938(0x4)
	struct FColor C_SemiSolidWire; // 0x93C(0x4)
	struct FColor C_NonSolidWire; // 0x940(0x4)
	struct FColor C_WireBackground; // 0x944(0x4)
	struct FColor C_ScaleBoxHi; // 0x948(0x4)
	struct FColor C_VolumeCollision; // 0x94C(0x4)
	struct FColor C_BSPCollision; // 0x950(0x4)
	struct FColor C_OrthoBackground; // 0x954(0x4)
	struct FColor C_Volume; // 0x958(0x4)
	struct FColor C_BrushShape; // 0x95C(0x4)
	float StreamingDistanceFactor; // 0x960(0x4)
	uint8_t Pad_0x964[0x4]; // 0x964(0x4)
	struct FDirectoryPath GameScreenshotSaveDirectory; // 0x968(0x10)
	enum class ETransitionType TransitionType; // 0x978(0x1)
	uint8_t Pad_0x979[0x7]; // 0x979(0x7)
	struct FString TransitionDescription; // 0x980(0x10)
	struct FString TransitionGameMode; // 0x990(0x10)
	float MeshLODRange; // 0x9A0(0x4)
	uint8_t bAllowMatureLanguage : 1; // 0x9A4(0x1), Mask(0x1)
	uint8_t BitPad_0x9A4_1 : 7; // 0x9A4(0x1)
	uint8_t Pad_0x9A5[0x3]; // 0x9A5(0x3)
	float CameraRotationThreshold; // 0x9A8(0x4)
	float CameraTranslationThreshold; // 0x9AC(0x4)
	float PrimitiveProbablyVisibleTime; // 0x9B0(0x4)
	float MaxOcclusionPixelsFraction; // 0x9B4(0x4)
	uint8_t bPauseOnLossOfFocus : 1; // 0x9B8(0x1), Mask(0x1)
	uint8_t BitPad_0x9B8_1 : 7; // 0x9B8(0x1)
	uint8_t Pad_0x9B9[0x3]; // 0x9B9(0x3)
	int32_t MaxParticleResize; // 0x9BC(0x4)
	int32_t MaxParticleResizeWarn; // 0x9C0(0x4)
	uint8_t Pad_0x9C4[0x4]; // 0x9C4(0x4)
	struct TArray<struct FDropNoteInfo> PendingDroppedNotes; // 0x9C8(0x10)
	float NetClientTicksPerSecond; // 0x9D8(0x4)
	float DisplayGamma; // 0x9DC(0x4)
	float MinDesiredFrameRate; // 0x9E0(0x4)
	struct FLinearColor DefaultSelectedMaterialColor; // 0x9E4(0x10)
	struct FLinearColor SelectedMaterialColor; // 0x9F4(0x10)
	struct FLinearColor SelectionOutlineColor; // 0xA04(0x10)
	struct FLinearColor SubduedSelectionOutlineColor; // 0xA14(0x10)
	struct FLinearColor SelectedMaterialColorOverride; // 0xA24(0x10)
	bool bIsOverridingSelectedColor; // 0xA34(0x1)
	uint8_t Pad_0xA35[0x3]; // 0xA35(0x3)
	struct FLinearColor VoxelBorderColor; // 0xA38(0x10)
	float VoxelBorderWidth; // 0xA48(0x4)
	uint8_t bEnableOnScreenDebugMessages : 1; // 0xA4C(0x1), Mask(0x1)
	uint8_t bEnableOnScreenDebugMessagesDisplay : 1; // 0xA4C(0x1), Mask(0x2)
	uint8_t bSuppressMapWarnings : 1; // 0xA4C(0x1), Mask(0x4)
	uint8_t bDisableAILogging : 1; // 0xA4C(0x1), Mask(0x8)
	uint8_t BitPad_0xA4C_4 : 4; // 0xA4C(0x1)
	uint8_t Pad_0xA4D[0x3]; // 0xA4D(0x3)
	uint32_t bEnableVisualLogRecordingOnStart; // 0xA50(0x4)
	uint8_t Pad_0xA54[0x4]; // 0xA54(0x4)
	int32_t ScreenSaverInhibitorSemaphore; // 0xA58(0x4)
	uint8_t Pad_0xA5C[0x1C]; // 0xA5C(0x1C)
	uint8_t bLockReadOnlyLevels : 1; // 0xA78(0x1), Mask(0x1)
	uint8_t BitPad_0xA78_1 : 7; // 0xA78(0x1)
	uint8_t Pad_0xA79[0x7]; // 0xA79(0x7)
	struct FString ParticleEventManagerClassPath; // 0xA80(0x10)
	float SelectionHighlightIntensity; // 0xA90(0x4)
	float BSPSelectionHighlightIntensity; // 0xA94(0x4)
	float SelectionHighlightIntensityBillboards; // 0xA98(0x4)
	uint8_t Pad_0xA9C[0x24C]; // 0xA9C(0x24C)
	struct TArray<struct FNetDriverDefinition> NetDriverDefinitions; // 0xCE8(0x10)
	struct TArray<struct FString> ServerActors; // 0xCF8(0x10)
	struct TArray<struct FString> RuntimeServerActors; // 0xD08(0x10)
	float NetErrorLogInterval; // 0xD18(0x4)
	uint8_t bStartedLoadMapMovie : 1; // 0xD1C(0x1), Mask(0x1)
	uint8_t BitPad_0xD1C_1 : 7; // 0xD1C(0x1)
	uint8_t Pad_0xD1D[0x13]; // 0xD1D(0x13)
	int32_t NextWorldContextHandle; // 0xD30(0x4)
	uint8_t Pad_0xD34[0x194]; // 0xD34(0x194)
};

// Object: Class Engine.GameViewportClient
// Size: 0x330 (Inherited: 0x38)
struct UGameViewportClient : UScriptViewportClient
{
	uint8_t Pad_0x38[0x8]; // 0x38(0x8)
	struct UConsole* ViewportConsole; // 0x40(0x8)
	struct TArray<struct FDebugDisplayProperty> DebugProperties; // 0x48(0x10)
	uint8_t Pad_0x58[0x10]; // 0x58(0x10)
	int32_t MaxSplitscreenPlayers; // 0x68(0x4)
	uint8_t Pad_0x6C[0x4]; // 0x6C(0x4)
	struct UWorld* World; // 0x70(0x8)
	struct UGameInstance* GameInstance; // 0x78(0x8)
	uint8_t Pad_0x80[0x2B0]; // 0x80(0x2B0)


	// Object: Function Engine.GameViewportClient.SSSwapControllers
	// Flags: [Exec|Native|Public]
	// Offset: 0xa532e9c
	// Params: [ Num(0) Size(0x0) ]
	void SSSwapControllers();

	// Object: Function Engine.GameViewportClient.ShowTitleSafeArea
	// Flags: [Exec|Native|Public]
	// Offset: 0xa532e80
	// Params: [ Num(0) Size(0x0) ]
	void ShowTitleSafeArea();

	// Object: Function Engine.GameViewportClient.SetConsoleTarget
	// Flags: [Exec|Native|Public]
	// Offset: 0xa532dd0
	// Params: [ Num(1) Size(0x4) ]
	void SetConsoleTarget(int32_t PlayerIndex);
};

// Object: Class Engine.Player
// Size: 0x48 (Inherited: 0x28)
struct UPlayer : UObject
{
	uint8_t Pad_0x28[0x8]; // 0x28(0x8)
	struct APlayerController* PlayerController; // 0x30(0x8)
	int32_t CurrentNetSpeed; // 0x38(0x4)
	int32_t ConfiguredInternetSpeed; // 0x3C(0x4)
	int32_t ConfiguredLanSpeed; // 0x40(0x4)
	uint8_t Pad_0x44[0x4]; // 0x44(0x4)
};

// Object: Class Engine.LocalPlayer
// Size: 0x258 (Inherited: 0x48)
struct ULocalPlayer : UPlayer
{
	uint8_t Pad_0x48[0x28]; // 0x48(0x28)
	struct UGameViewportClient* ViewportClient; // 0x70(0x8)
	uint8_t Pad_0x78[0x1C]; // 0x78(0x1C)
	uint8_t AspectRatioAxisConstraint; // 0x94(0x1)
	uint8_t Pad_0x95[0x3]; // 0x95(0x3)
	struct APlayerController* PendingLevelPlayerControllerClass; // 0x98(0x8)
	uint8_t bSentSplitJoin : 1; // 0xA0(0x1), Mask(0x1)
	uint8_t BitPad_0xA0_1 : 7; // 0xA0(0x1)
	uint8_t Pad_0xA1[0x17]; // 0xA1(0x17)
	int32_t ControllerId; // 0xB8(0x4)
	uint8_t Pad_0xBC[0x19C]; // 0xBC(0x19C)
};

// Object: Class Engine.LocalPlayerSubsystem
// Size: 0x30 (Inherited: 0x30)
struct ULocalPlayerSubsystem : USubsystem
{
};

// Object: Class Engine.StreamableRenderAsset
// Size: 0x40 (Inherited: 0x28)
struct UStreamableRenderAsset : UObject
{
	double ForceMipLevelsToBeResidentTimestamp; // 0x28(0x8)
	int32_t NumCinematicMipLevels; // 0x30(0x4)
	int32_t StreamingIndex; // 0x34(0x4)
	int32_t CachedCombinedLODBias; // 0x38(0x4)
	uint8_t CachedNumResidentLODs; // 0x3C(0x1)
	uint8_t bCachedReadyForStreaming : 1; // 0x3D(0x1), Mask(0x1)
	uint8_t NeverStream : 1; // 0x3D(0x1), Mask(0x2)
	uint8_t bGlobalForceMipLevelsToBeResident : 1; // 0x3D(0x1), Mask(0x4)
	uint8_t bIsStreamable : 1; // 0x3D(0x1), Mask(0x8)
	uint8_t bHasStreamingUpdatePending : 1; // 0x3D(0x1), Mask(0x10)
	uint8_t bForceMiplevelsToBeResident : 1; // 0x3D(0x1), Mask(0x20)
	uint8_t bIgnoreStreamingMipBias : 1; // 0x3D(0x1), Mask(0x40)
	uint8_t bUseCinematicMipLevels : 1; // 0x3D(0x1), Mask(0x80)
	uint8_t Pad_0x3E[0x2]; // 0x3E(0x2)
};

// Object: Class Engine.Texture
// Size: 0xB8 (Inherited: 0x40)
struct UTexture : UStreamableRenderAsset
{
	uint8_t Pad_0x40[0x8]; // 0x40(0x8)
	struct FGuid LightingGuid; // 0x48(0x10)
	int32_t LevelIndex; // 0x58(0x4)
	int32_t LODBias; // 0x5C(0x4)
	uint8_t CompressionSettings; // 0x60(0x1)
	uint8_t Filter; // 0x61(0x1)
	enum class ETextureMipLoadOptions MipLoadOptions; // 0x62(0x1)
	uint8_t LODGroup; // 0x63(0x1)
	uint8_t SRGB : 1; // 0x64(0x1), Mask(0x1)
	uint8_t bNoTiling : 1; // 0x64(0x1), Mask(0x2)
	uint8_t VirtualTextureStreaming : 1; // 0x64(0x1), Mask(0x4)
	uint8_t CompressionYCoCg : 1; // 0x64(0x1), Mask(0x8)
	uint8_t BitPad_0x64_4 : 4; // 0x64(0x1)
	uint8_t Pad_0x65[0x1]; // 0x65(0x1)
	uint8_t bAsyncResourceReleaseHasBeenStarted : 1; // 0x66(0x1), Mask(0x1)
	uint8_t BitPad_0x66_1 : 7; // 0x66(0x1)
	uint8_t Pad_0x67[0x1]; // 0x67(0x1)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x68(0x10)
	uint8_t Pad_0x78[0x40]; // 0x78(0x40)
};

// Object: Class Engine.BlueprintGeneratedClass
// Size: 0x358 (Inherited: 0x260)
struct UBlueprintGeneratedClass : UClass
{
	int32_t NumReplicatedProperties; // 0x260(0x4)
	uint8_t bHasNativizedParent : 1; // 0x264(0x1), Mask(0x1)
	uint8_t bHasCookedComponentInstancingData : 1; // 0x264(0x1), Mask(0x2)
	uint8_t BitPad_0x264_2 : 6; // 0x264(0x1)
	uint8_t Pad_0x265[0x3]; // 0x265(0x3)
	struct TArray<struct UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x268(0x10)
	struct TArray<struct UActorComponent*> ComponentTemplates; // 0x278(0x10)
	struct TArray<struct UTimelineTemplate*> Timelines; // 0x288(0x10)
	struct TArray<struct FBPComponentClassOverride> ComponentClassOverrides; // 0x298(0x10)
	struct USimpleConstructionScript* SimpleConstructionScript; // 0x2A8(0x8)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0x2B0(0x8)
	struct UStructProperty* UberGraphFramePointerProperty; // 0x2B8(0x8)
	uint8_t Pad_0x2C0[0x8]; // 0x2C0(0x8)
	struct UFunction* UberGraphFunction; // 0x2C8(0x8)
	struct TMap<struct FName, struct FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x2D0(0x50)
	uint8_t Pad_0x320[0x38]; // 0x320(0x38)
};

// Object: Class Engine.AnimInstance
// Size: 0x330 (Inherited: 0x28)
struct UAnimInstance : UObject
{
	struct USkeleton* CurrentSkeleton; // 0x28(0x8)
	uint8_t RootMotionMode; // 0x30(0x1)
	uint8_t bUseMultiThreadedAnimationUpdate : 1; // 0x31(0x1), Mask(0x1)
	uint8_t bUsingCopyPoseFromMesh : 1; // 0x31(0x1), Mask(0x2)
	uint8_t BitPad_0x31_2 : 2; // 0x31(0x1)
	uint8_t bReceiveNotifiesFromLinkedInstances : 1; // 0x31(0x1), Mask(0x10)
	uint8_t bPropagateNotifiesToLinkedInstances : 1; // 0x31(0x1), Mask(0x20)
	uint8_t bUseMainInstanceMontageEvaluationData : 1; // 0x31(0x1), Mask(0x40)
	uint8_t bQueueMontageEvents : 1; // 0x31(0x1), Mask(0x80)
	uint8_t Pad_0x32[0x16]; // 0x32(0x16)
	struct TArray<struct UAnimationAsset*> CachedOriginalAnimAssets; // 0x48(0x10)
	struct TArray<struct UOverrideAnimConfig*> CachedOverrideAnimConfig; // 0x58(0x10)
	uint8_t Pad_0x68[0x30]; // 0x68(0x30)
	struct FMulticastInlineDelegate OnMontageBlendingOut; // 0x98(0x10)
	struct FMulticastInlineDelegate OnMontageStarted; // 0xA8(0x10)
	struct FMulticastInlineDelegate OnMontageEnded; // 0xB8(0x10)
	struct FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0xC8(0x10)
	uint8_t Pad_0xD8[0xD8]; // 0xD8(0xD8)
	struct FAnimNotifyQueue NotifyQueue; // 0x1B0(0x80)
	struct TArray<struct FAnimNotifyEvent> ActiveAnimNotifyState; // 0x230(0x10)
	uint8_t Pad_0x240[0xF0]; // 0x240(0xF0)


	// Object: Function Engine.AnimInstance.UnlockAIResources
	// Flags: [Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable]
	// Offset: 0xa47875c
	// Params: [ Num(2) Size(0x2) ]
	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic);

	// Object: Function Engine.AnimInstance.UnlinkAnimClassLayers
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa479ebc
	// Params: [ Num(1) Size(0x8) ]
	void UnlinkAnimClassLayers(struct UAnimInstance* InClass);

	// Object: Function Engine.AnimInstance.TryGetPawnOwner
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47c3c4
	// Params: [ Num(1) Size(0x8) ]
	struct APawn* TryGetPawnOwner();

	// Object: Function Engine.AnimInstance.StopSlotAnimation
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47b948
	// Params: [ Num(2) Size(0xC) ]
	void StopSlotAnimation(float InBlendOutTime, struct FName SlotNodeName);

	// Object: Function Engine.AnimInstance.SnapshotPose
	// Flags: [Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa47c234
	// Params: [ Num(1) Size(0x38) ]
	void SnapshotPose(struct FPoseSnapshot& Snapshot);

	// Object: Function Engine.AnimInstance.SetUseMainInstanceMontageEvaluationData
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47bfac
	// Params: [ Num(1) Size(0x1) ]
	void SetUseMainInstanceMontageEvaluationData(bool bSet);

	// Object: Function Engine.AnimInstance.SetRootMotionMode
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa479b8c
	// Params: [ Num(1) Size(0x1) ]
	void SetRootMotionMode(uint8_t Value);

	// Object: Function Engine.AnimInstance.SetReceiveNotifiesFromLinkedInstances
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47c15c
	// Params: [ Num(1) Size(0x1) ]
	void SetReceiveNotifiesFromLinkedInstances(bool bSet);

	// Object: Function Engine.AnimInstance.SetPropagateNotifiesToLinkedInstances
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47c084
	// Params: [ Num(1) Size(0x1) ]
	void SetPropagateNotifiesToLinkedInstances(bool bSet);

	// Object: Function Engine.AnimInstance.SetMorphTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa478a68
	// Params: [ Num(2) Size(0xC) ]
	void SetMorphTarget(struct FName MorphTargetName, float Value);

	// Object: Function Engine.AnimInstance.SavePoseSnapshot
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa47c314
	// Params: [ Num(1) Size(0x8) ]
	void SavePoseSnapshot(struct FName SnapshotName);

	// Object: Function Engine.AnimInstance.ResetDynamics
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa478250
	// Params: [ Num(1) Size(0x1) ]
	void ResetDynamics(enum class ETeleportType InTeleportType);

	// Object: Function Engine.AnimInstance.RequestSlotGroupInertialization
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa479c34
	// Params: [ Num(3) Size(0x18) ]
	void RequestSlotGroupInertialization(struct FName InSlotGroupName, float Duration, struct UBlendProfile* BlendProfile);

	// Object: Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47ba30
	// Params: [ Num(9) Size(0x30) ]
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt);

	// Object: Function Engine.AnimInstance.PlaySlotAnimation
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47bc98
	// Params: [ Num(7) Size(0x24) ]
	float PlaySlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount);

	// Object: Function Engine.AnimInstance.Montage_StopWithBlendSettings
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa47aedc
	// Params: [ Num(2) Size(0x28) ]
	void Montage_StopWithBlendSettings(struct FMontageBlendSettings& BlendOutSettings, struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_StopWithBlendOut
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa47afd4
	// Params: [ Num(2) Size(0x18) ]
	void Montage_StopWithBlendOut(struct FAlphaBlendArgs& BlendOut, struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_StopGroupByName
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47adf4
	// Params: [ Num(2) Size(0xC) ]
	void Montage_StopGroupByName(float InBlendOutTime, struct FName GroupName);

	// Object: Function Engine.AnimInstance.Montage_Stop
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47b0cc
	// Params: [ Num(2) Size(0x10) ]
	void Montage_Stop(float InBlendOutTime, struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_SetPosition
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47a520
	// Params: [ Num(2) Size(0xC) ]
	void Montage_SetPosition(struct UAnimMontage* Montage, float NewPosition);

	// Object: Function Engine.AnimInstance.Montage_SetPlayRate
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47a8d0
	// Params: [ Num(2) Size(0xC) ]
	void Montage_SetPlayRate(struct UAnimMontage* Montage, float NewPlayRate);

	// Object: Function Engine.AnimInstance.Montage_SetNextSection
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47a9b8
	// Params: [ Num(3) Size(0x18) ]
	void Montage_SetNextSection(struct FName SectionNameToChange, struct FName NextSection, struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_Resume
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47aca4
	// Params: [ Num(1) Size(0x8) ]
	void Montage_Resume(struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_PlayWithBlendSettings
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa47b1b4
	// Params: [ Num(7) Size(0x3C) ]
	float Montage_PlayWithBlendSettings(struct UAnimMontage* MontageToPlay, struct FMontageBlendSettings& BlendInSettings, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages);

	// Object: Function Engine.AnimInstance.Montage_PlayWithBlendIn
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa47b3c4
	// Params: [ Num(7) Size(0x2C) ]
	float Montage_PlayWithBlendIn(struct UAnimMontage* MontageToPlay, struct FAlphaBlendArgs& BlendIn, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages);

	// Object: Function Engine.AnimInstance.Montage_Play
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47b5d4
	// Params: [ Num(9) Size(0x28) ]
	float Montage_Play(struct UAnimMontage* MontageToPlay, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages, float CustomBlendInTime, float CustomBlendOutTime, bool bUseNewBlendInToBlendOutOldMontage);

	// Object: Function Engine.AnimInstance.Montage_Pause
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47ad4c
	// Params: [ Num(1) Size(0x8) ]
	void Montage_Pause(struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_JumpToSectionsEnd
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47aadc
	// Params: [ Num(2) Size(0x10) ]
	void Montage_JumpToSectionsEnd(struct FName SectionName, struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_JumpToSection
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47abc0
	// Params: [ Num(2) Size(0x10) ]
	void Montage_JumpToSection(struct FName SectionName, struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_IsPlaying
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47a768
	// Params: [ Num(2) Size(0x9) ]
	bool Montage_IsPlaying(struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_IsActive
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47a81c
	// Params: [ Num(2) Size(0x9) ]
	bool Montage_IsActive(struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_GetPosition
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47a608
	// Params: [ Num(2) Size(0xC) ]
	float Montage_GetPosition(struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_GetPlayRate
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47a30c
	// Params: [ Num(2) Size(0xC) ]
	float Montage_GetPlayRate(struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_GetIsStopped
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47a46c
	// Params: [ Num(2) Size(0x9) ]
	bool Montage_GetIsStopped(struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_GetCurrentSection
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47a6b8
	// Params: [ Num(2) Size(0x10) ]
	struct FName Montage_GetCurrentSection(struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.Montage_GetBlendTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47a3bc
	// Params: [ Num(2) Size(0xC) ]
	float Montage_GetBlendTime(struct UAnimMontage* Montage);

	// Object: Function Engine.AnimInstance.LockAIResources
	// Flags: [Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable]
	// Offset: 0xa478854
	// Params: [ Num(2) Size(0x2) ]
	void LockAIResources(bool bLockMovement, bool LockAILogic);

	// Object: Function Engine.AnimInstance.LinkAnimGraphByTag
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa47a00c
	// Params: [ Num(2) Size(0x10) ]
	void LinkAnimGraphByTag(struct FName InTag, struct UAnimInstance* InClass);

	// Object: Function Engine.AnimInstance.LinkAnimClassLayers
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa479f64
	// Params: [ Num(1) Size(0x8) ]
	void LinkAnimClassLayers(struct UAnimInstance* InClass);

	// Object: Function Engine.AnimInstance.IsUsingMainInstanceMontageEvaluationData
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47c064
	// Params: [ Num(1) Size(0x1) ]
	bool IsUsingMainInstanceMontageEvaluationData();

	// Object: Function Engine.AnimInstance.IsSyncGroupBetweenMarkers
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4783b8
	// Params: [ Num(5) Size(0x1A) ]
	bool IsSyncGroupBetweenMarkers(struct FName InSyncGroupName, struct FName PreviousMarker, struct FName NextMarker, bool bRespectMarkerOrder);

	// Object: Function Engine.AnimInstance.IsPlayingSlotAnimation
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47b858
	// Params: [ Num(3) Size(0x11) ]
	bool IsPlayingSlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName);

	// Object: Function Engine.AnimInstance.IsAnyMontagePlaying
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47a2d4
	// Params: [ Num(1) Size(0x1) ]
	bool IsAnyMontagePlaying();

	// Object: Function Engine.AnimInstance.HasMarkerBeenHitThisFrame
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa478530
	// Params: [ Num(3) Size(0x11) ]
	bool HasMarkerBeenHitThisFrame(struct FName SyncGroup, struct FName MarkerName);

	// Object: Function Engine.AnimInstance.GetTimeToClosestMarker
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa478620
	// Params: [ Num(4) Size(0x15) ]
	bool GetTimeToClosestMarker(struct FName SyncGroup, struct FName MarkerName, float& OutMarkerTime);

	// Object: Function Engine.AnimInstance.GetSyncGroupPosition
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4782f8
	// Params: [ Num(2) Size(0x1C) ]
	struct FMarkerSyncAnimPosition GetSyncGroupPosition(struct FName InSyncGroupName);

	// Object: Function Engine.AnimInstance.GetRelevantAnimTimeRemainingFraction
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa479134
	// Params: [ Num(3) Size(0xC) ]
	float GetRelevantAnimTimeRemainingFraction(int32_t MachineIndex, int32_t StateIndex);

	// Object: Function Engine.AnimInstance.GetRelevantAnimTimeRemaining
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa479220
	// Params: [ Num(3) Size(0xC) ]
	float GetRelevantAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex);

	// Object: Function Engine.AnimInstance.GetRelevantAnimTimeFraction
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa478e70
	// Params: [ Num(3) Size(0xC) ]
	float GetRelevantAnimTimeFraction(int32_t MachineIndex, int32_t StateIndex);

	// Object: Function Engine.AnimInstance.GetRelevantAnimTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa478f5c
	// Params: [ Num(3) Size(0xC) ]
	float GetRelevantAnimTime(int32_t MachineIndex, int32_t StateIndex);

	// Object: Function Engine.AnimInstance.GetRelevantAnimLength
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa479048
	// Params: [ Num(3) Size(0xC) ]
	float GetRelevantAnimLength(int32_t MachineIndex, int32_t StateIndex);

	// Object: Function Engine.AnimInstance.GetReceiveNotifiesFromLinkedInstances
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47c214
	// Params: [ Num(1) Size(0x1) ]
	bool GetReceiveNotifiesFromLinkedInstances();

	// Object: Function Engine.AnimInstance.GetPropagateNotifiesToLinkedInstances
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47c13c
	// Params: [ Num(1) Size(0x1) ]
	bool GetPropagateNotifiesToLinkedInstances();

	// Object: Function Engine.AnimInstance.GetOwningComponent
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47bf44
	// Params: [ Num(1) Size(0x8) ]
	struct USkeletalMeshComponent* GetOwningComponent();

	// Object: Function Engine.AnimInstance.GetOwningActor
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47bf78
	// Params: [ Num(1) Size(0x8) ]
	struct AActor* GetOwningActor();

	// Object: Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroup
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa479e0c
	// Params: [ Num(2) Size(0x10) ]
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup);

	// Object: Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByClass
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa479d5c
	// Params: [ Num(2) Size(0x10) ]
	struct UAnimInstance* GetLinkedAnimLayerInstanceByClass(struct UAnimInstance* InClass);

	// Object: Function Engine.AnimInstance.GetLinkedAnimGraphInstancesByTag
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47a0f0
	// Params: [ Num(2) Size(0x18) ]
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<struct UAnimInstance*>& OutLinkedInstances);

	// Object: Function Engine.AnimInstance.GetLinkedAnimGraphInstanceByTag
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47a1f0
	// Params: [ Num(2) Size(0x10) ]
	struct UAnimInstance* GetLinkedAnimGraphInstanceByTag(struct FName InTag);

	// Object: Function Engine.AnimInstance.GetInstanceTransitionTimeElapsedFraction
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa47930c
	// Params: [ Num(3) Size(0xC) ]
	float GetInstanceTransitionTimeElapsedFraction(int32_t MachineIndex, int32_t TransitionIndex);

	// Object: Function Engine.AnimInstance.GetInstanceTransitionTimeElapsed
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa4793f8
	// Params: [ Num(3) Size(0xC) ]
	float GetInstanceTransitionTimeElapsed(int32_t MachineIndex, int32_t TransitionIndex);

	// Object: Function Engine.AnimInstance.GetInstanceTransitionCrossfadeDuration
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa4794e4
	// Params: [ Num(3) Size(0xC) ]
	float GetInstanceTransitionCrossfadeDuration(int32_t MachineIndex, int32_t TransitionIndex);

	// Object: Function Engine.AnimInstance.GetInstanceStateWeight
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa479680
	// Params: [ Num(3) Size(0xC) ]
	float GetInstanceStateWeight(int32_t MachineIndex, int32_t StateIndex);

	// Object: Function Engine.AnimInstance.GetInstanceMachineWeight
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa47976c
	// Params: [ Num(2) Size(0x8) ]
	float GetInstanceMachineWeight(int32_t MachineIndex);

	// Object: Function Engine.AnimInstance.GetInstanceCurrentStateElapsedTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa4795d0
	// Params: [ Num(2) Size(0x8) ]
	float GetInstanceCurrentStateElapsedTime(int32_t MachineIndex);

	// Object: Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEndFraction
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa47981c
	// Params: [ Num(2) Size(0x8) ]
	float GetInstanceAssetPlayerTimeFromEndFraction(int32_t AssetPlayerIndex);

	// Object: Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEnd
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa4798cc
	// Params: [ Num(2) Size(0x8) ]
	float GetInstanceAssetPlayerTimeFromEnd(int32_t AssetPlayerIndex);

	// Object: Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFraction
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa47997c
	// Params: [ Num(2) Size(0x8) ]
	float GetInstanceAssetPlayerTimeFraction(int32_t AssetPlayerIndex);

	// Object: Function Engine.AnimInstance.GetInstanceAssetPlayerTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa479a2c
	// Params: [ Num(2) Size(0x8) ]
	float GetInstanceAssetPlayerTime(int32_t AssetPlayerIndex);

	// Object: Function Engine.AnimInstance.GetInstanceAssetPlayerLength
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa479adc
	// Params: [ Num(2) Size(0x8) ]
	float GetInstanceAssetPlayerLength(int32_t AssetPlayerIndex);

	// Object: Function Engine.AnimInstance.GetCurveValue
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa478dc0
	// Params: [ Num(2) Size(0xC) ]
	float GetCurveValue(struct FName CurveName);

	// Object: Function Engine.AnimInstance.GetCurrentStateName
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xa478b50
	// Params: [ Num(2) Size(0xC) ]
	struct FName GetCurrentStateName(int32_t MachineIndex);

	// Object: Function Engine.AnimInstance.GetCurrentActiveMontage
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47a2a0
	// Params: [ Num(1) Size(0x8) ]
	struct UAnimMontage* GetCurrentActiveMontage();

	// Object: Function Engine.AnimInstance.GetAllCurveNames
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa478c00
	// Params: [ Num(1) Size(0x10) ]
	void GetAllCurveNames(struct TArray<struct FName>& OutNames);

	// Object: Function Engine.AnimInstance.GetAllAnimBlendInfo
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xa47be84
	// Params: [ Num(1) Size(0x10) ]
	void GetAllAnimBlendInfo(struct TArray<struct FAnimBlendInfo>& AnimBlendInfo);

	// Object: Function Engine.AnimInstance.GetActiveCurveNames
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa478cc0
	// Params: [ Num(2) Size(0x18) ]
	void GetActiveCurveNames(enum class EAnimCurveType CurveType, struct TArray<struct FName>& OutNames);

	// Object: Function Engine.AnimInstance.ClearMorphTargets
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa478a54
	// Params: [ Num(0) Size(0x0) ]
	void ClearMorphTargets();

	// Object: Function Engine.AnimInstance.CalculateDirection
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa47894c
	// Params: [ Num(3) Size(0x1C) ]
	float CalculateDirection(struct FVector& Velocity, struct FRotator& BaseRotation);

	// Object: Function Engine.AnimInstance.BlueprintUpdateAnimation
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x4) ]
	void BlueprintUpdateAnimation(float DeltaTimeX);

	// Object: Function Engine.AnimInstance.BlueprintPostEvaluateAnimation
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void BlueprintPostEvaluateAnimation();

	// Object: Function Engine.AnimInstance.BlueprintLinkedAnimationLayersInitialized
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void BlueprintLinkedAnimationLayersInitialized();

	// Object: Function Engine.AnimInstance.BlueprintInitializeAnimation
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void BlueprintInitializeAnimation();

	// Object: Function Engine.AnimInstance.BlueprintBeginPlay
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(0) Size(0x0) ]
	void BlueprintBeginPlay();
};

// Object: Class Engine.DynamicBlueprintBinding
// Size: 0x28 (Inherited: 0x28)
struct UDynamicBlueprintBinding : UObject
{
};

// Object: Class Engine.InputDelegateBinding
// Size: 0x28 (Inherited: 0x28)
struct UInputDelegateBinding : UDynamicBlueprintBinding
{
};

// Object: Class Engine.InputComponent
// Size: 0x160 (Inherited: 0xD8)
struct UInputComponent : UActorComponent
{
	uint8_t Pad_0xD8[0x70]; // 0xD8(0x70)
	struct TArray<struct FCachedKeyToActionInfo> CachedKeyToActionInfo; // 0x148(0x10)
	uint8_t Pad_0x158[0x8]; // 0x158(0x8)


	// Object: Function Engine.InputComponent.WasControllerKeyJustReleased
	// Flags: [Final|Native|Private|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa53c98c
	// Params: [ Num(2) Size(0x19) ]
	bool WasControllerKeyJustReleased(struct FKey Key);

	// Object: Function Engine.InputComponent.WasControllerKeyJustPressed
	// Flags: [Final|Native|Private|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa53cb1c
	// Params: [ Num(2) Size(0x19) ]
	bool WasControllerKeyJustPressed(struct FKey Key);

	// Object: Function Engine.InputComponent.IsControllerKeyDown
	// Flags: [Final|Native|Private|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa53ccac
	// Params: [ Num(2) Size(0x19) ]
	bool IsControllerKeyDown(struct FKey Key);

	// Object: Function Engine.InputComponent.GetTouchState
	// Flags: [Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa53c4dc
	// Params: [ Num(4) Size(0xD) ]
	void GetTouchState(int32_t FingerIndex, float& LocationX, float& LocationY, bool& bIsCurrentlyPressed);

	// Object: Function Engine.InputComponent.GetControllerVectorKeyState
	// Flags: [Final|Native|Private|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa53c670
	// Params: [ Num(2) Size(0x24) ]
	struct FVector GetControllerVectorKeyState(struct FKey Key);

	// Object: Function Engine.InputComponent.GetControllerMouseDelta
	// Flags: [Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa53c250
	// Params: [ Num(2) Size(0x8) ]
	void GetControllerMouseDelta(float& DeltaX, float& DeltaY);

	// Object: Function Engine.InputComponent.GetControllerKeyTimeDown
	// Flags: [Final|Native|Private|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa53c350
	// Params: [ Num(2) Size(0x1C) ]
	float GetControllerKeyTimeDown(struct FKey Key);

	// Object: Function Engine.InputComponent.GetControllerAnalogStickState
	// Flags: [Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa53c110
	// Params: [ Num(3) Size(0xC) ]
	void GetControllerAnalogStickState(uint8_t WhichStick, float& StickX, float& StickY);

	// Object: Function Engine.InputComponent.GetControllerAnalogKeyState
	// Flags: [Final|Native|Private|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa53c800
	// Params: [ Num(2) Size(0x1C) ]
	float GetControllerAnalogKeyState(struct FKey Key);
};

// Object: Class Engine.DynamicSubsystem
// Size: 0x30 (Inherited: 0x30)
struct UDynamicSubsystem : USubsystem
{
};

// Object: Class Engine.EngineSubsystem
// Size: 0x30 (Inherited: 0x30)
struct UEngineSubsystem : UDynamicSubsystem
{
};

// Object: Class Engine.Controller
// Size: 0x370 (Inherited: 0x2E0)
struct AController : AActor
{
	uint8_t Pad_0x2E0[0x8]; // 0x2E0(0x8)
	struct APlayerState* PlayerState; // 0x2E8(0x8)
	uint8_t Pad_0x2F0[0x8]; // 0x2F0(0x8)
	struct FMulticastInlineDelegate OnInstigatedAnyDamage; // 0x2F8(0x10)
	struct FName StateName; // 0x308(0x8)
	struct APawn* Pawn; // 0x310(0x8)
	uint8_t Pad_0x318[0x8]; // 0x318(0x8)
	struct ACharacter* Character; // 0x320(0x8)
	struct USceneComponent* TransformComponent; // 0x328(0x8)
	uint8_t Pad_0x330[0x30]; // 0x330(0x30)
	struct FRotator ControlRotation; // 0x360(0xC)
	uint8_t bAttachToPawn : 1; // 0x36C(0x1), Mask(0x1)
	uint8_t BitPad_0x36C_1 : 7; // 0x36C(0x1)
	uint8_t Pad_0x36D[0x3]; // 0x36D(0x3)


	// Object: Function Engine.Controller.UnPossess
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4e3c7c
	// Params: [ Num(0) Size(0x0) ]
	void UnPossess();

	// Object: Function Engine.Controller.StopMovement
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4e3c60
	// Params: [ Num(0) Size(0x0) ]
	void StopMovement();

	// Object: Function Engine.Controller.SetInitialLocationAndRotation
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa4e4230
	// Params: [ Num(2) Size(0x18) ]
	void SetInitialLocationAndRotation(struct FVector& NewLocation, struct FRotator& NewRotation);

	// Object: Function Engine.Controller.SetIgnoreMoveInput
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4e3ba8
	// Params: [ Num(1) Size(0x1) ]
	void SetIgnoreMoveInput(bool bNewMoveInput);

	// Object: Function Engine.Controller.SetIgnoreLookInput
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4e3a94
	// Params: [ Num(1) Size(0x1) ]
	void SetIgnoreLookInput(bool bNewLookInput);

	// Object: Function Engine.Controller.SetControlRotation
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xa4e4330
	// Params: [ Num(1) Size(0xC) ]
	void SetControlRotation(struct FRotator& NewRotation);

	// Object: Function Engine.Controller.ResetIgnoreMoveInput
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4e3b8c
	// Params: [ Num(0) Size(0x0) ]
	void ResetIgnoreMoveInput();

	// Object: Function Engine.Controller.ResetIgnoreLookInput
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4e3a78
	// Params: [ Num(0) Size(0x0) ]
	void ResetIgnoreLookInput();

	// Object: Function Engine.Controller.ResetIgnoreInputFlags
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4e3a1c
	// Params: [ Num(0) Size(0x0) ]
	void ResetIgnoreInputFlags();

	// Object: Function Engine.Controller.ReceiveUnPossess
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x8) ]
	void ReceiveUnPossess(struct APawn* UnpossessedPawn);

	// Object: Function Engine.Controller.ReceivePossess
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x8) ]
	void ReceivePossess(struct APawn* PossessedPawn);

	// Object: Function Engine.Controller.ReceiveInstigatedAnyDamage
	// Flags: [BlueprintAuthorityOnly|Event|Protected|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(4) Size(0x20) ]
	void ReceiveInstigatedAnyDamage(float Damage, struct UDamageType* DamageType, struct AActor* DamagedActor, struct AActor* DamageCauser);

	// Object: Function Engine.Controller.Possess
	// Flags: [Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable]
	// Offset: 0xa4e3c90
	// Params: [ Num(1) Size(0x8) ]
	void Possess(struct APawn* InPawn);

	// Object: Function Engine.Controller.OnRep_PlayerState
	// Flags: [Native|Public]
	// Offset: 0xa4e40b4
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_PlayerState();

	// Object: Function Engine.Controller.OnRep_Pawn
	// Flags: [Native|Public]
	// Offset: 0xa4e40d0
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_Pawn();

	// Object: Function Engine.Controller.LineOfSightTo
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4e40ec
	// Params: [ Num(4) Size(0x16) ]
	bool LineOfSightTo(struct AActor* Other, struct FVector ViewPoint, bool bAlternateChecks);

	// Object: Function Engine.Controller.K2_GetPawn
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4e3e64
	// Params: [ Num(1) Size(0x8) ]
	struct APawn* K2_GetPawn();

	// Object: Function Engine.Controller.IsPlayerController
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4e3dc8
	// Params: [ Num(1) Size(0x1) ]
	bool IsPlayerController();

	// Object: Function Engine.Controller.IsMoveInputIgnored
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4e3b4c
	// Params: [ Num(1) Size(0x1) ]
	bool IsMoveInputIgnored();

	// Object: Function Engine.Controller.IsLookInputIgnored
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4e3a38
	// Params: [ Num(1) Size(0x1) ]
	bool IsLookInputIgnored();

	// Object: Function Engine.Controller.IsLocalPlayerController
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4e3d78
	// Params: [ Num(1) Size(0x1) ]
	bool IsLocalPlayerController();

	// Object: Function Engine.Controller.IsLocalController
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4e3d38
	// Params: [ Num(1) Size(0x1) ]
	bool IsLocalController();

	// Object: Function Engine.Controller.GetViewTarget
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4e3e28
	// Params: [ Num(1) Size(0x8) ]
	struct AActor* GetViewTarget();

	// Object: Function Engine.Controller.GetDesiredRotation
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4e3de8
	// Params: [ Num(1) Size(0xC) ]
	struct FRotator GetDesiredRotation();

	// Object: Function Engine.Controller.GetControlRotation
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4e43e8
	// Params: [ Num(1) Size(0xC) ]
	struct FRotator GetControlRotation();

	// Object: Function Engine.Controller.ClientSetRotation
	// Flags: [Net|NetReliableNative|Event|Public|HasDefaults|NetClient]
	// Offset: 0xa4e3e98
	// Params: [ Num(2) Size(0xD) ]
	void ClientSetRotation(struct FRotator NewRotation, bool bResetCamera);

	// Object: Function Engine.Controller.ClientSetLocation
	// Flags: [Net|NetReliableNative|Event|Public|HasDefaults|NetClient]
	// Offset: 0xa4e3f90
	// Params: [ Num(2) Size(0x18) ]
	void ClientSetLocation(struct FVector NewLocation, struct FRotator NewRotation);

	// Object: Function Engine.Controller.CastToPlayerController
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4e4080
	// Params: [ Num(1) Size(0x8) ]
	struct APlayerController* CastToPlayerController();
};

// Object: Class Engine.PlayerController
// Size: 0x698 (Inherited: 0x370)
struct APlayerController : AController
{
	struct UPlayer* Player; // 0x370(0x8)
	struct APawn* AcknowledgedPawn; // 0x378(0x8)
	struct UInterpTrackInstDirector* ControllingDirTrackInst; // 0x380(0x8)
	struct AHUD* MyHUD; // 0x388(0x8)
	struct APlayerCameraManager* PlayerCameraManager; // 0x390(0x8)
	struct APlayerCameraManager* PlayerCameraManagerClass; // 0x398(0x8)
	bool bAutoManageActiveCameraTarget; // 0x3A0(0x1)
	uint8_t Pad_0x3A1[0x3]; // 0x3A1(0x3)
	struct FRotator TargetViewRotation; // 0x3A4(0xC)
	uint8_t Pad_0x3B0[0xC]; // 0x3B0(0xC)
	float SmoothTargetViewRotationSpeed; // 0x3BC(0x4)
	uint8_t Pad_0x3C0[0x8]; // 0x3C0(0x8)
	struct TArray<struct AActor*> HiddenActors; // 0x3C8(0x10)
	struct TArray<struct TWeakObjectPtr<struct UPrimitiveComponent>> HiddenPrimitiveComponents; // 0x3D8(0x10)
	uint8_t Pad_0x3E8[0x4]; // 0x3E8(0x4)
	float LastSpectatorStateSynchTime; // 0x3EC(0x4)
	struct FVector LastSpectatorSyncLocation; // 0x3F0(0xC)
	struct FRotator LastSpectatorSyncRotation; // 0x3FC(0xC)
	int32_t ClientCap; // 0x408(0x4)
	uint8_t Pad_0x40C[0x4]; // 0x40C(0x4)
	struct UCheatManager* CheatManager; // 0x410(0x8)
	struct UCheatManager* CheatClass; // 0x418(0x8)
	struct UPlayerInput* PlayerInput; // 0x420(0x8)
	struct TArray<struct FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x428(0x10)
	uint8_t Pad_0x438[0x70]; // 0x438(0x70)
	uint8_t BitPad_0x4A8_0 : 4; // 0x4A8(0x1)
	uint8_t bPlayerIsWaiting : 1; // 0x4A8(0x1), Mask(0x10)
	uint8_t BitPad_0x4A8_5 : 3; // 0x4A8(0x1)
	uint8_t NetPlayerIndex; // 0x4A9(0x1)
	uint8_t Pad_0x4AA[0x3E]; // 0x4AA(0x3E)
	struct UNetConnection* PendingSwapConnection; // 0x4E8(0x8)
	struct UNetConnection* NetConnection; // 0x4F0(0x8)
	uint8_t Pad_0x4F8[0xC]; // 0x4F8(0xC)
	float InputYawScale; // 0x504(0x4)
	float InputPitchScale; // 0x508(0x4)
	float InputRollScale; // 0x50C(0x4)
	uint8_t bShowMouseCursor : 1; // 0x510(0x1), Mask(0x1)
	uint8_t bEnableClickEvents : 1; // 0x510(0x1), Mask(0x2)
	uint8_t bEnableTouchEvents : 1; // 0x510(0x1), Mask(0x4)
	uint8_t bEnableMouseOverEvents : 1; // 0x510(0x1), Mask(0x8)
	uint8_t bEnableTouchOverEvents : 1; // 0x510(0x1), Mask(0x10)
	uint8_t bForceFeedbackEnabled : 1; // 0x510(0x1), Mask(0x20)
	uint8_t BitPad_0x510_6 : 2; // 0x510(0x1)
	uint8_t Pad_0x511[0x3]; // 0x511(0x3)
	float ForceFeedbackScale; // 0x514(0x4)
	struct TArray<struct FKey> ClickEventKeys; // 0x518(0x10)
	uint8_t DefaultMouseCursor; // 0x528(0x1)
	uint8_t CurrentMouseCursor; // 0x529(0x1)
	uint8_t DefaultClickTraceChannel; // 0x52A(0x1)
	uint8_t CurrentClickTraceChannel; // 0x52B(0x1)
	float HitResultTraceDistance; // 0x52C(0x4)
	uint16_t SeamlessTravelCount; // 0x530(0x2)
	uint16_t LastCompletedSeamlessTravelCount; // 0x532(0x2)
	uint8_t Pad_0x534[0xC4]; // 0x534(0xC4)
	struct UInputComponent* InactiveStateInputComponent; // 0x5F8(0x8)
	uint8_t BitPad_0x600_0 : 2; // 0x600(0x1)
	uint8_t bShouldPerformFullTickWhenPaused : 1; // 0x600(0x1), Mask(0x4)
	uint8_t BitPad_0x600_3 : 5; // 0x600(0x1)
	uint8_t Pad_0x601[0x17]; // 0x601(0x17)
	struct UTouchInterface* CurrentTouchInterface; // 0x618(0x8)
	uint8_t Pad_0x620[0x50]; // 0x620(0x50)
	struct ASpectatorPawn* SpectatorPawn; // 0x670(0x8)
	uint8_t Pad_0x678[0x4]; // 0x678(0x4)
	bool bIsLocalPlayerController; // 0x67C(0x1)
	uint8_t Pad_0x67D[0x3]; // 0x67D(0x3)
	struct FVector SpawnLocation; // 0x680(0xC)
	uint8_t Pad_0x68C[0xC]; // 0x68C(0xC)


	// Object: Function Engine.PlayerController.WasInputKeyJustReleased
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa643950
	// Params: [ Num(2) Size(0x19) ]
	bool WasInputKeyJustReleased(struct FKey Key);

	// Object: Function Engine.PlayerController.WasInputKeyJustPressed
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa643ae0
	// Params: [ Num(2) Size(0x19) ]
	bool WasInputKeyJustPressed(struct FKey Key);

	// Object: Function Engine.PlayerController.ToggleSpeaking
	// Flags: [Exec|Native|Public]
	// Offset: 0xa648c04
	// Params: [ Num(1) Size(0x1) ]
	void ToggleSpeaking(bool bInSpeaking);

	// Object: Function Engine.PlayerController.TestServerLevelVisibilityChange
	// Flags: [Final|Exec|Native|Private]
	// Offset: 0xa645ad8
	// Params: [ Num(2) Size(0x10) ]
	void TestServerLevelVisibilityChange(struct FName PackageName, struct FName Filename);

	// Object: Function Engine.PlayerController.SwitchLevel
	// Flags: [Exec|Native|Public]
	// Offset: 0xa649c38
	// Params: [ Num(1) Size(0x10) ]
	void SwitchLevel(struct FString URL);

	// Object: Function Engine.PlayerController.StopHapticEffect
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6458c0
	// Params: [ Num(1) Size(0x1) ]
	void StopHapticEffect(enum class EControllerHand Hand);

	// Object: Function Engine.PlayerController.StartFire
	// Flags: [Exec|Native|Public]
	// Offset: 0xa648d74
	// Params: [ Num(1) Size(0x1) ]
	void StartFire(uint8_t FireModeNum);

	// Object: Function Engine.PlayerController.SetVirtualJoystickVisibility
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa642cc8
	// Params: [ Num(1) Size(0x1) ]
	void SetVirtualJoystickVisibility(bool bVisible);

	// Object: Function Engine.PlayerController.SetViewTargetWithBlend
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa642a60
	// Params: [ Num(5) Size(0x15) ]
	void SetViewTargetWithBlend(struct AActor* NewViewTarget, float BlendTime, uint8_t BlendFunc, float BlendExp, bool bLockOutgoing);

	// Object: Function Engine.PlayerController.SetName
	// Flags: [Exec|Native|Public]
	// Offset: 0xa649cf4
	// Params: [ Num(1) Size(0x10) ]
	void SetName(struct FString S);

	// Object: Function Engine.PlayerController.SetMouseLocation
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa648e24
	// Params: [ Num(2) Size(0x8) ]
	void SetMouseLocation(int32_t X, int32_t Y);

	// Object: Function Engine.PlayerController.SetMouseCursorWidget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa6466d0
	// Params: [ Num(2) Size(0x10) ]
	void SetMouseCursorWidget(uint8_t Cursor, struct UUserWidget* CursorWidget);

	// Object: Function Engine.PlayerController.SetHapticsByValue
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa645798
	// Params: [ Num(3) Size(0x9) ]
	void SetHapticsByValue(float Frequency, float Amplitude, enum class EControllerHand Hand);

	// Object: Function Engine.PlayerController.SetDisableHaptics
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa6456e0
	// Params: [ Num(1) Size(0x1) ]
	void SetDisableHaptics(bool bNewDisabled);

	// Object: Function Engine.PlayerController.SetControllerLightColor
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa64563c
	// Params: [ Num(1) Size(0x4) ]
	void SetControllerLightColor(struct FColor Color);

	// Object: Function Engine.PlayerController.SetCinematicMode
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa642600
	// Params: [ Num(5) Size(0x5) ]
	void SetCinematicMode(bool bInCinematicMode, bool bHidePlayer, bool bAffectsHUD, bool bAffectsMovement, bool bAffectsTurning);

	// Object: Function Engine.PlayerController.SetAudioListenerOverride
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa642938
	// Params: [ Num(3) Size(0x20) ]
	void SetAudioListenerOverride(struct USceneComponent* AttachToComponent, struct FVector Location, struct FRotator Rotation);

	// Object: Function Engine.PlayerController.SetAudioListenerAttenuationOverride
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa64283c
	// Params: [ Num(2) Size(0x14) ]
	void SetAudioListenerAttenuationOverride(struct USceneComponent* AttachToComponent, struct FVector AttenuationLocationOVerride);

	// Object: Function Engine.PlayerController.ServerViewSelf
	// Flags: [Net|Native|Event|Public|NetServer|NetValidate]
	// Offset: 0xa6441e8
	// Params: [ Num(1) Size(0x18) ]
	void ServerViewSelf(struct FViewTargetTransitionParams TransitionParams);

	// Object: Function Engine.PlayerController.ServerViewPrevPlayer
	// Flags: [Net|Native|Event|Public|NetServer|NetValidate]
	// Offset: 0xa6442f8
	// Params: [ Num(0) Size(0x0) ]
	void ServerViewPrevPlayer();

	// Object: Function Engine.PlayerController.ServerViewNextPlayer
	// Flags: [Net|Native|Event|Public|NetServer|NetValidate]
	// Offset: 0xa644354
	// Params: [ Num(0) Size(0x0) ]
	void ServerViewNextPlayer();

	// Object: Function Engine.PlayerController.ServerVerifyViewTarget
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa6443b0
	// Params: [ Num(0) Size(0x0) ]
	void ServerVerifyViewTarget();

	// Object: Function Engine.PlayerController.ServerUpdateMultipleLevelsVisibility
	// Flags: [Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa64440c
	// Params: [ Num(1) Size(0x10) ]
	void ServerUpdateMultipleLevelsVisibility(struct TArray<struct FUpdateLevelVisibilityLevelInfo> LevelVisibilities);

	// Object: Function Engine.PlayerController.ServerUpdateLevelVisibility
	// Flags: [Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa6444e0
	// Params: [ Num(1) Size(0x14) ]
	void ServerUpdateLevelVisibility(struct FUpdateLevelVisibilityLevelInfo LevelVisibility);

	// Object: Function Engine.PlayerController.ServerUpdateCamera
	// Flags: [Net|Native|Event|Public|NetServer|NetValidate]
	// Offset: 0xa6445ac
	// Params: [ Num(1) Size(0x30) ]
	void ServerUpdateCamera(struct FCameraUpdateData Data);

	// Object: Function Engine.PlayerController.ServerUnmutePlayer
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa6486a8
	// Params: [ Num(1) Size(0x28) ]
	void ServerUnmutePlayer(struct FUniqueNetIdRepl PlayerID);

	// Object: Function Engine.PlayerController.ServerToggleAILogging
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa644010
	// Params: [ Num(0) Size(0x0) ]
	void ServerToggleAILogging();

	// Object: Function Engine.PlayerController.ServerShortTimeout
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa6446b0
	// Params: [ Num(0) Size(0x0) ]
	void ServerShortTimeout();

	// Object: Function Engine.PlayerController.ServerSetSpectatorWaiting
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa64a438
	// Params: [ Num(1) Size(0x1) ]
	void ServerSetSpectatorWaiting(bool bWaiting);

	// Object: Function Engine.PlayerController.ServerSetSpectatorLocation
	// Flags: [Net|Native|Event|Public|NetServer|HasDefaults|NetValidate]
	// Offset: 0xa6447c4
	// Params: [ Num(2) Size(0x18) ]
	void ServerSetSpectatorLocation(struct FVector NewLoc, struct FRotator NewRot);

	// Object: Function Engine.PlayerController.ServerRestartPlayer
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa6448e8
	// Params: [ Num(0) Size(0x0) ]
	void ServerRestartPlayer();

	// Object: Function Engine.PlayerController.ServerReportReplicationError_SerializeNewActor
	// Flags: [Final|Net|NetReliableNative|Event|Private|NetServer]
	// Offset: 0xa642380
	// Params: [ Num(1) Size(0x4) ]
	void ServerReportReplicationError_SerializeNewActor(uint32_t NetGUID);

	// Object: Function Engine.PlayerController.ServerReportReplicationError
	// Flags: [Final|Net|NetReliableNative|Event|Private|NetServer]
	// Offset: 0xa642430
	// Params: [ Num(1) Size(0x10) ]
	void ServerReportReplicationError(struct FString ErrorString);

	// Object: Function Engine.PlayerController.ServerReportNetGUIDError
	// Flags: [Final|Net|NetReliableNative|Event|Private|NetServer]
	// Offset: 0xa6422d0
	// Params: [ Num(1) Size(0x4) ]
	void ServerReportNetGUIDError(uint32_t NetGUID);

	// Object: Function Engine.PlayerController.ServerPause
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa644944
	// Params: [ Num(0) Size(0x0) ]
	void ServerPause();

	// Object: Function Engine.PlayerController.ServerNotifyLoadedWorld
	// Flags: [Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa6449a0
	// Params: [ Num(1) Size(0x8) ]
	void ServerNotifyLoadedWorld(struct FName WorldPackageName);

	// Object: Function Engine.PlayerController.ServerMutePlayer
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa648948
	// Params: [ Num(1) Size(0x28) ]
	void ServerMutePlayer(struct FUniqueNetIdRepl PlayerID);

	// Object: Function Engine.PlayerController.ServerExecRPC
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa64a0f8
	// Params: [ Num(1) Size(0x10) ]
	void ServerExecRPC(struct FString Msg);

	// Object: Function Engine.PlayerController.ServerExec
	// Flags: [Final|Exec|Native|Public]
	// Offset: 0xa64a044
	// Params: [ Num(1) Size(0x10) ]
	void ServerExec(struct FString Msg);

	// Object: Function Engine.PlayerController.ServerCheckClientPossessionReliable
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa64470c
	// Params: [ Num(0) Size(0x0) ]
	void ServerCheckClientPossessionReliable();

	// Object: Function Engine.PlayerController.ServerCheckClientPossession
	// Flags: [Net|Native|Event|Public|NetServer|NetValidate]
	// Offset: 0xa644768
	// Params: [ Num(0) Size(0x0) ]
	void ServerCheckClientPossession();

	// Object: Function Engine.PlayerController.ServerChangeName
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa644a68
	// Params: [ Num(1) Size(0x10) ]
	void ServerChangeName(struct FString S);

	// Object: Function Engine.PlayerController.ServerCamera
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa644b4c
	// Params: [ Num(1) Size(0x8) ]
	void ServerCamera(struct FName NewMode);

	// Object: Function Engine.PlayerController.ServerAcknowledgePossession
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|NetValidate]
	// Offset: 0xa644c24
	// Params: [ Num(1) Size(0x8) ]
	void ServerAcknowledgePossession(struct APawn* P);

	// Object: Function Engine.PlayerController.SendToConsole
	// Flags: [Exec|Native|Public]
	// Offset: 0xa6480b8
	// Params: [ Num(1) Size(0x10) ]
	void SendToConsole(struct FString Command);

	// Object: Function Engine.PlayerController.RestartLevel
	// Flags: [Exec|Native|Public]
	// Offset: 0xa64a298
	// Params: [ Num(0) Size(0x0) ]
	void RestartLevel();

	// Object: Function Engine.PlayerController.ResetControllerLightColor
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa645628
	// Params: [ Num(0) Size(0x0) ]
	void ResetControllerLightColor();

	// Object: Function Engine.PlayerController.ProjectWorldLocationToScreen
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa648f08
	// Params: [ Num(4) Size(0x16) ]
	bool ProjectWorldLocationToScreen(struct FVector WorldLocation, struct FVector2D& ScreenLocation, bool bPlayerViewportRelative);

	// Object: Function Engine.PlayerController.PlayHapticEffect
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa645968
	// Params: [ Num(4) Size(0x11) ]
	void PlayHapticEffect(struct UHapticFeedbackEffect_Base* HapticEffect, enum class EControllerHand Hand, float Scale, bool bLoop);

	// Object: Function Engine.PlayerController.PlayDynamicForceFeedback
	// Flags: [Final|Native|Private|BlueprintCallable]
	// Offset: 0xa645bbc
	// Params: [ Num(8) Size(0x28) ]
	void PlayDynamicForceFeedback(float Intensity, float Duration, bool bAffectsLeftLarge, bool bAffectsLeftSmall, bool bAffectsRightLarge, bool bAffectsRightSmall, uint8_t Action, struct FLatentActionInfo LatentInfo);

	// Object: Function Engine.PlayerController.Pause
	// Flags: [Exec|Native|Public]
	// Offset: 0xa649db0
	// Params: [ Num(0) Size(0x0) ]
	void Pause();

	// Object: Function Engine.PlayerController.OnServerStartedVisualLogger
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa642548
	// Params: [ Num(1) Size(0x1) ]
	void OnServerStartedVisualLogger(bool bIsLogging);

	// Object: Function Engine.PlayerController.LocalTravel
	// Flags: [Exec|Native|Public]
	// Offset: 0xa64a1dc
	// Params: [ Num(1) Size(0x10) ]
	void LocalTravel(struct FString URL);

	// Object: Function Engine.PlayerController.K2_ClientPlayForceFeedback
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa646084
	// Params: [ Num(5) Size(0x13) ]
	void K2_ClientPlayForceFeedback(struct UForceFeedbackEffect* ForceFeedbackEffect, struct FName Tag, bool bLooping, bool bIgnoreTimeDilation, bool bPlayWhilePaused);

	// Object: Function Engine.PlayerController.IsInputKeyDown
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa643c70
	// Params: [ Num(2) Size(0x19) ]
	bool IsInputKeyDown(struct FKey Key);

	// Object: Function Engine.PlayerController.GetViewportSize
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6467ec
	// Params: [ Num(2) Size(0x8) ]
	void GetViewportSize(int32_t& SizeX, int32_t& SizeY);

	// Object: Function Engine.PlayerController.GetSpectatorPawn
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa64252c
	// Params: [ Num(1) Size(0x8) ]
	struct ASpectatorPawn* GetSpectatorPawn();

	// Object: Function Engine.PlayerController.GetMousePosition
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6431fc
	// Params: [ Num(3) Size(0x9) ]
	bool GetMousePosition(float& LocationX, float& LocationY);

	// Object: Function Engine.PlayerController.GetInputVectorKeyState
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa643634
	// Params: [ Num(2) Size(0x24) ]
	struct FVector GetInputVectorKeyState(struct FKey Key);

	// Object: Function Engine.PlayerController.GetInputTouchState
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6434a0
	// Params: [ Num(4) Size(0xD) ]
	void GetInputTouchState(uint8_t FingerIndex, float& LocationX, float& LocationY, bool& bIsCurrentlyPressed);

	// Object: Function Engine.PlayerController.GetInputMouseDelta
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa642f70
	// Params: [ Num(2) Size(0x8) ]
	void GetInputMouseDelta(float& DeltaX, float& DeltaY);

	// Object: Function Engine.PlayerController.GetInputMotionState
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa643310
	// Params: [ Num(4) Size(0x30) ]
	void GetInputMotionState(struct FVector& Tilt, struct FVector& RotationRate, struct FVector& Gravity, struct FVector& Acceleration);

	// Object: Function Engine.PlayerController.GetInputKeyTimeDown
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa643070
	// Params: [ Num(2) Size(0x1C) ]
	float GetInputKeyTimeDown(struct FKey Key);

	// Object: Function Engine.PlayerController.GetInputAnalogStickState
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa642e30
	// Params: [ Num(3) Size(0xC) ]
	void GetInputAnalogStickState(uint8_t WhichStick, float& StickX, float& StickY);

	// Object: Function Engine.PlayerController.GetInputAnalogKeyState
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6437c4
	// Params: [ Num(2) Size(0x1C) ]
	float GetInputAnalogKeyState(struct FKey Key);

	// Object: Function Engine.PlayerController.GetHUD
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6467b8
	// Params: [ Num(1) Size(0x8) ]
	struct AHUD* GetHUD();

	// Object: Function Engine.PlayerController.GetHitResultUnderFingerForObjects
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6492e8
	// Params: [ Num(5) Size(0xA5) ]
	bool GetHitResultUnderFingerForObjects(uint8_t FingerIndex, struct TArray<uint8_t>& ObjectTypes, bool bTraceComplex, struct FHitResult& HitResult);

	// Object: Function Engine.PlayerController.GetHitResultUnderFingerByChannel
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6494a8
	// Params: [ Num(5) Size(0x8D) ]
	bool GetHitResultUnderFingerByChannel(uint8_t FingerIndex, uint8_t TraceChannel, bool bTraceComplex, struct FHitResult& HitResult);

	// Object: Function Engine.PlayerController.GetHitResultUnderFinger
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa64964c
	// Params: [ Num(5) Size(0x8D) ]
	bool GetHitResultUnderFinger(uint8_t FingerIndex, uint8_t TraceChannel, bool bTraceComplex, struct FHitResult& HitResult);

	// Object: Function Engine.PlayerController.GetHitResultUnderCursorForObjects
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6497f0
	// Params: [ Num(4) Size(0x9D) ]
	bool GetHitResultUnderCursorForObjects(struct TArray<uint8_t>& ObjectTypes, bool bTraceComplex, struct FHitResult& HitResult);

	// Object: Function Engine.PlayerController.GetHitResultUnderCursorByChannel
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa649970
	// Params: [ Num(4) Size(0x8D) ]
	bool GetHitResultUnderCursorByChannel(uint8_t TraceChannel, bool bTraceComplex, struct FHitResult& HitResult);

	// Object: Function Engine.PlayerController.GetHitResultUnderCursor
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa649ad4
	// Params: [ Num(4) Size(0x8D) ]
	bool GetHitResultUnderCursor(uint8_t TraceChannel, bool bTraceComplex, struct FHitResult& HitResult);

	// Object: Function Engine.PlayerController.GetFocalLocation
	// Flags: [Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6424ec
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetFocalLocation();

	// Object: Function Engine.PlayerController.FOV
	// Flags: [Exec|Native|Public]
	// Offset: 0xa64a2b4
	// Params: [ Num(1) Size(0x4) ]
	void FOV(float NewFOV);

	// Object: Function Engine.PlayerController.EnableCheats
	// Flags: [Exec|Native|Public]
	// Offset: 0xa64a364
	// Params: [ Num(0) Size(0x0) ]
	void EnableCheats();

	// Object: Function Engine.PlayerController.DeprojectScreenPositionToWorld
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa649054
	// Params: [ Num(5) Size(0x21) ]
	bool DeprojectScreenPositionToWorld(float ScreenX, float ScreenY, struct FVector& WorldLocation, struct FVector& WorldDirection);

	// Object: Function Engine.PlayerController.DeprojectMousePositionToWorld
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa6491dc
	// Params: [ Num(3) Size(0x19) ]
	bool DeprojectMousePositionToWorld(struct FVector& WorldLocation, struct FVector& WorldDirection);

	// Object: Function Engine.PlayerController.ConsoleKey
	// Flags: [Exec|Native|Public]
	// Offset: 0xa648174
	// Params: [ Num(1) Size(0x18) ]
	void ConsoleKey(struct FKey Key);

	// Object: Function Engine.PlayerController.ClientWasKicked
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa644f90
	// Params: [ Num(1) Size(0x18) ]
	void ClientWasKicked(struct FText KickReason);

	// Object: Function Engine.PlayerController.ClientVoiceHandshakeComplete
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa648be8
	// Params: [ Num(0) Size(0x0) ]
	void ClientVoiceHandshakeComplete();

	// Object: Function Engine.PlayerController.ClientUpdateMultipleLevelsStreamingStatus
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa64509c
	// Params: [ Num(1) Size(0x10) ]
	void ClientUpdateMultipleLevelsStreamingStatus(struct TArray<struct FUpdateLevelStreamingLevelStatus> LevelStatuses);

	// Object: Function Engine.PlayerController.ClientUpdateLevelStreamingStatus
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa645158
	// Params: [ Num(5) Size(0x10) ]
	void ClientUpdateLevelStreamingStatus(struct FName PackageName, bool bNewShouldBeLoaded, bool bNewShouldBeVisible, bool bNewShouldBlockOnLoad, int32_t LODIndex);

	// Object: Function Engine.PlayerController.ClientUnmutePlayer
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa648300
	// Params: [ Num(1) Size(0x28) ]
	void ClientUnmutePlayer(struct FUniqueNetIdRepl PlayerID);

	// Object: Function Engine.PlayerController.ClientTravelInternal
	// Flags: [Net|NetReliableNative|Event|Public|HasDefaults|NetClient]
	// Offset: 0xa645328
	// Params: [ Num(4) Size(0x24) ]
	void ClientTravelInternal(struct FString URL, uint8_t TravelType, bool bSeamless, struct FGuid MapPackageGuid);

	// Object: Function Engine.PlayerController.ClientTravel
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xa6454ac
	// Params: [ Num(4) Size(0x24) ]
	void ClientTravel(struct FString URL, uint8_t TravelType, bool bSeamless, struct FGuid MapPackageGuid);

	// Object: Function Engine.PlayerController.ClientTeamMessage
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa64406c
	// Params: [ Num(4) Size(0x24) ]
	void ClientTeamMessage(struct APlayerState* SenderPlayerState, struct FString S, struct FName Type, float MsgLifeTime);

	// Object: Function Engine.PlayerController.ClientStopForceFeedback
	// Flags: [Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable]
	// Offset: 0xa645e68
	// Params: [ Num(2) Size(0x10) ]
	void ClientStopForceFeedback(struct UForceFeedbackEffect* ForceFeedbackEffect, struct FName Tag);

	// Object: Function Engine.PlayerController.ClientStopCameraShakesFromSource
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa64624c
	// Params: [ Num(2) Size(0x9) ]
	void ClientStopCameraShakesFromSource(struct UCameraShakeSourceComponent* SourceComponent, bool bImmediately);

	// Object: Function Engine.PlayerController.ClientStopCameraShake
	// Flags: [Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable]
	// Offset: 0xa64633c
	// Params: [ Num(2) Size(0x9) ]
	void ClientStopCameraShake(struct UCameraShake* Shake, bool bImmediately);

	// Object: Function Engine.PlayerController.ClientStopCameraAnim
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa646434
	// Params: [ Num(1) Size(0x8) ]
	void ClientStopCameraAnim(struct UCameraAnim* AnimToStop);

	// Object: Function Engine.PlayerController.ClientStartOnlineSession
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa644f74
	// Params: [ Num(0) Size(0x0) ]
	void ClientStartOnlineSession();

	// Object: Function Engine.PlayerController.ClientSpawnCameraLensEffect
	// Flags: [Net|Native|Event|Public|NetClient|BlueprintCallable]
	// Offset: 0xa646500
	// Params: [ Num(1) Size(0x8) ]
	void ClientSpawnCameraLensEffect(struct AEmitterCameraLensEffectBase* LensEffectEmitterClass);

	// Object: Function Engine.PlayerController.ClientSetViewTarget
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa6465b0
	// Params: [ Num(2) Size(0x20) ]
	void ClientSetViewTarget(struct AActor* A, struct FViewTargetTransitionParams TransitionParams);

	// Object: Function Engine.PlayerController.ClientSetSpectatorWaiting
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa64a380
	// Params: [ Num(1) Size(0x1) ]
	void ClientSetSpectatorWaiting(bool bWaiting);

	// Object: Function Engine.PlayerController.ClientSetHUD
	// Flags: [Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable]
	// Offset: 0xa6468ec
	// Params: [ Num(1) Size(0x8) ]
	void ClientSetHUD(struct AHUD* NewHUDClass);

	// Object: Function Engine.PlayerController.ClientSetForceMipLevelsToBeResident
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa64699c
	// Params: [ Num(3) Size(0x10) ]
	void ClientSetForceMipLevelsToBeResident(struct UMaterialInterface* Material, float ForceDuration, int32_t CinematicTextureGroups);

	// Object: Function Engine.PlayerController.ClientSetCinematicMode
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa646acc
	// Params: [ Num(4) Size(0x4) ]
	void ClientSetCinematicMode(bool bInCinematicMode, bool bAffectsMovement, bool bAffectsTurning, bool bAffectsHUD);

	// Object: Function Engine.PlayerController.ClientSetCameraMode
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa646c64
	// Params: [ Num(1) Size(0x8) ]
	void ClientSetCameraMode(struct FName NewCamMode);

	// Object: Function Engine.PlayerController.ClientSetCameraFade
	// Flags: [Net|NetReliableNative|Event|Public|HasDefaults|NetClient]
	// Offset: 0xa646d14
	// Params: [ Num(5) Size(0x15) ]
	void ClientSetCameraFade(bool bEnableFading, struct FColor FadeColor, struct FVector2D FadeAlpha, float FadeTime, bool bFadeAudio);

	// Object: Function Engine.PlayerController.ClientSetBlockOnAsyncLoading
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa646ecc
	// Params: [ Num(0) Size(0x0) ]
	void ClientSetBlockOnAsyncLoading();

	// Object: Function Engine.PlayerController.ClientReturnToMainMenuWithTextReason
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa649e7c
	// Params: [ Num(1) Size(0x18) ]
	void ClientReturnToMainMenuWithTextReason(struct FText ReturnReason);

	// Object: Function Engine.PlayerController.ClientReturnToMainMenu
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa649f88
	// Params: [ Num(1) Size(0x10) ]
	void ClientReturnToMainMenu(struct FString ReturnReason);

	// Object: Function Engine.PlayerController.ClientRetryClientRestart
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa644ea8
	// Params: [ Num(1) Size(0x8) ]
	void ClientRetryClientRestart(struct APawn* NewPawn);

	// Object: Function Engine.PlayerController.ClientRestart
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa646ee8
	// Params: [ Num(1) Size(0x8) ]
	void ClientRestart(struct APawn* NewPawn);

	// Object: Function Engine.PlayerController.ClientReset
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa646f98
	// Params: [ Num(0) Size(0x0) ]
	void ClientReset();

	// Object: Function Engine.PlayerController.ClientRepObjRef
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa649dcc
	// Params: [ Num(1) Size(0x8) ]
	void ClientRepObjRef(struct UObject* Object);

	// Object: Function Engine.PlayerController.ClientReceiveLocalizedMessage
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa644cfc
	// Params: [ Num(5) Size(0x28) ]
	void ClientReceiveLocalizedMessage(struct ULocalMessage* Message, int32_t Switch, struct APlayerState* RelatedPlayerState_1, struct APlayerState* RelatedPlayerState_2, struct UObject* OptionalObject);

	// Object: Function Engine.PlayerController.ClientPrestreamTextures
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa646fb4
	// Params: [ Num(4) Size(0x14) ]
	void ClientPrestreamTextures(struct AActor* ForcedActor, float ForceDuration, bool bEnableStreaming, int32_t CinematicTextureGroups);

	// Object: Function Engine.PlayerController.ClientPrepareMapChange
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa64712c
	// Params: [ Num(3) Size(0xA) ]
	void ClientPrepareMapChange(struct FName LevelName, bool bFirst, bool bLast);

	// Object: Function Engine.PlayerController.ClientPlaySoundAtLocation
	// Flags: [Net|Native|Event|Public|HasDefaults|NetClient]
	// Offset: 0xa64726c
	// Params: [ Num(4) Size(0x1C) ]
	void ClientPlaySoundAtLocation(struct USoundBase* Sound, struct FVector Location, float VolumeMultiplier, float PitchMultiplier);

	// Object: Function Engine.PlayerController.ClientPlaySound
	// Flags: [Net|Native|Event|Public|NetClient]
	// Offset: 0xa6473d8
	// Params: [ Num(3) Size(0x10) ]
	void ClientPlaySound(struct USoundBase* Sound, float VolumeMultiplier, float PitchMultiplier);

	// Object: Function Engine.PlayerController.ClientPlayForceFeedback_Internal
	// Flags: [Final|Net|Native|Event|Private|NetClient]
	// Offset: 0xa645f54
	// Params: [ Num(2) Size(0x2C) ]
	void ClientPlayForceFeedback_Internal(struct UForceFeedbackEffect* ForceFeedbackEffect, struct FForceFeedbackParameters Params);

	// Object: Function Engine.PlayerController.ClientPlayCameraShakeFromSource
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa647504
	// Params: [ Num(2) Size(0x10) ]
	void ClientPlayCameraShakeFromSource(struct UCameraShake* Shake, struct UCameraShakeSourceComponent* SourceComponent);

	// Object: Function Engine.PlayerController.ClientPlayCameraShake
	// Flags: [Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable]
	// Offset: 0xa6475e8
	// Params: [ Num(4) Size(0x1C) ]
	void ClientPlayCameraShake(struct UCameraShake* Shake, float Scale, uint8_t PlaySpace, struct FRotator UserPlaySpaceRot);

	// Object: Function Engine.PlayerController.ClientPlayCameraAnim
	// Flags: [Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable]
	// Offset: 0xa647758
	// Params: [ Num(9) Size(0x28) ]
	void ClientPlayCameraAnim(struct UCameraAnim* AnimToPlay, float Scale, float Rate, float BlendInTime, float BlendOutTime, bool bLoop, bool bRandomStartTime, uint8_t Space, struct FRotator CustomPlaySpace);

	// Object: Function Engine.PlayerController.ClientMutePlayer
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa6484d4
	// Params: [ Num(1) Size(0x28) ]
	void ClientMutePlayer(struct FUniqueNetIdRepl PlayerID);

	// Object: Function Engine.PlayerController.ClientMessage
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa647a1c
	// Params: [ Num(3) Size(0x1C) ]
	void ClientMessage(struct FString S, struct FName Type, float MsgLifeTime);

	// Object: Function Engine.PlayerController.ClientIgnoreMoveInput
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa647b58
	// Params: [ Num(1) Size(0x1) ]
	void ClientIgnoreMoveInput(bool bIgnore);

	// Object: Function Engine.PlayerController.ClientIgnoreLookInput
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa647c10
	// Params: [ Num(1) Size(0x1) ]
	void ClientIgnoreLookInput(bool bIgnore);

	// Object: Function Engine.PlayerController.ClientGotoState
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa647cc8
	// Params: [ Num(1) Size(0x8) ]
	void ClientGotoState(struct FName NewState);

	// Object: Function Engine.PlayerController.ClientGameEnded
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa647d78
	// Params: [ Num(2) Size(0x9) ]
	void ClientGameEnded(struct AActor* EndGameFocus, bool bIsWinner);

	// Object: Function Engine.PlayerController.ClientForceGarbageCollection
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa647e70
	// Params: [ Num(0) Size(0x0) ]
	void ClientForceGarbageCollection();

	// Object: Function Engine.PlayerController.ClientFlushLevelStreaming
	// Flags: [Final|Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa647e8c
	// Params: [ Num(0) Size(0x0) ]
	void ClientFlushLevelStreaming();

	// Object: Function Engine.PlayerController.ClientEndOnlineSession
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa644f58
	// Params: [ Num(0) Size(0x0) ]
	void ClientEndOnlineSession();

	// Object: Function Engine.PlayerController.ClientEnableNetworkVoice
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa648cbc
	// Params: [ Num(1) Size(0x1) ]
	void ClientEnableNetworkVoice(bool bEnable);

	// Object: Function Engine.PlayerController.ClientCommitMapChange
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa647ea0
	// Params: [ Num(0) Size(0x0) ]
	void ClientCommitMapChange();

	// Object: Function Engine.PlayerController.ClientClearCameraLensEffects
	// Flags: [Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable]
	// Offset: 0xa6464e4
	// Params: [ Num(0) Size(0x0) ]
	void ClientClearCameraLensEffects();

	// Object: Function Engine.PlayerController.ClientCapBandwidth
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa647ebc
	// Params: [ Num(1) Size(0x4) ]
	void ClientCapBandwidth(int32_t Cap);

	// Object: Function Engine.PlayerController.ClientCancelPendingMapChange
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa647f6c
	// Params: [ Num(0) Size(0x0) ]
	void ClientCancelPendingMapChange();

	// Object: Function Engine.PlayerController.ClientAddTextureStreamingLoc
	// Flags: [Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient]
	// Offset: 0xa647f88
	// Params: [ Num(3) Size(0x11) ]
	void ClientAddTextureStreamingLoc(struct FVector InLoc, float Duration, bool bOverrideLocation);

	// Object: Function Engine.PlayerController.ClearAudioListenerOverride
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa642924
	// Params: [ Num(0) Size(0x0) ]
	void ClearAudioListenerOverride();

	// Object: Function Engine.PlayerController.ClearAudioListenerAttenuationOverride
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa642828
	// Params: [ Num(0) Size(0x0) ]
	void ClearAudioListenerAttenuationOverride();

	// Object: Function Engine.PlayerController.CanRestartPlayer
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa6427e8
	// Params: [ Num(1) Size(0x1) ]
	bool CanRestartPlayer();

	// Object: Function Engine.PlayerController.Camera
	// Flags: [Exec|Native|Public]
	// Offset: 0xa642c18
	// Params: [ Num(1) Size(0x8) ]
	void Camera(struct FName NewMode);

	// Object: Function Engine.PlayerController.AddYawInput
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa643eb0
	// Params: [ Num(1) Size(0x4) ]
	void AddYawInput(float Val);

	// Object: Function Engine.PlayerController.AddRollInput
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa643e00
	// Params: [ Num(1) Size(0x4) ]
	void AddRollInput(float Val);

	// Object: Function Engine.PlayerController.AddPitchInput
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa643f60
	// Params: [ Num(1) Size(0x4) ]
	void AddPitchInput(float Val);

	// Object: Function Engine.PlayerController.ActivateTouchInterface
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa642d80
	// Params: [ Num(1) Size(0x8) ]
	void ActivateTouchInterface(struct UTouchInterface* NewTouchInterface);
};

// Object: Class Engine.PlayerInput
// Size: 0x3A8 (Inherited: 0x28)
struct UPlayerInput : UObject
{
	uint8_t Pad_0x28[0xF8]; // 0x28(0xF8)
	struct TArray<struct FKeyBind> DebugExecBindings; // 0x120(0x10)
	uint8_t Pad_0x130[0x30]; // 0x130(0x30)
	struct TArray<struct FName> InvertedAxis; // 0x160(0x10)
	uint8_t Pad_0x170[0x238]; // 0x170(0x238)


	// Object: Function Engine.PlayerInput.SetMouseSensitivity
	// Flags: [Final|Exec|Native|Public]
	// Offset: 0xa6517b8
	// Params: [ Num(1) Size(0x4) ]
	void SetMouseSensitivity(float Sensitivity);

	// Object: Function Engine.PlayerInput.SetBind
	// Flags: [Final|Exec|Native|Public]
	// Offset: 0xa6516c4
	// Params: [ Num(2) Size(0x18) ]
	void SetBind(struct FName BindName, struct FString Command);

	// Object: Function Engine.PlayerInput.InvertAxisKey
	// Flags: [Final|Exec|Native|Public]
	// Offset: 0xa651540
	// Params: [ Num(1) Size(0x18) ]
	void InvertAxisKey(struct FKey AxisKey);

	// Object: Function Engine.PlayerInput.InvertAxis
	// Flags: [Final|Exec|Native|Public]
	// Offset: 0xa651498
	// Params: [ Num(1) Size(0x8) ]
	void InvertAxis(struct FName AxisName);

	// Object: Function Engine.PlayerInput.ClearSmoothing
	// Flags: [Final|Exec|Native|Public]
	// Offset: 0xa651484
	// Params: [ Num(0) Size(0x0) ]
	void ClearSmoothing();
};

// Object: Class Engine.ParticleModule
// Size: 0x30 (Inherited: 0x28)
struct UParticleModule : UObject
{
	uint8_t bSpawnModule : 1; // 0x28(0x1), Mask(0x1)
	uint8_t bUpdateModule : 1; // 0x28(0x1), Mask(0x2)
	uint8_t bFinalUpdateModule : 1; // 0x28(0x1), Mask(0x4)
	uint8_t bUpdateForGPUEmitter : 1; // 0x28(0x1), Mask(0x8)
	uint8_t bCurvesAsColor : 1; // 0x28(0x1), Mask(0x10)
	uint8_t b3DDrawMode : 1; // 0x28(0x1), Mask(0x20)
	uint8_t bSupported3DDrawMode : 1; // 0x28(0x1), Mask(0x40)
	uint8_t bEnabled : 1; // 0x28(0x1), Mask(0x80)
	uint8_t bEditable : 1; // 0x29(0x1), Mask(0x1)
	uint8_t LODDuplicate : 1; // 0x29(0x1), Mask(0x2)
	uint8_t bSupportsRandomSeed : 1; // 0x29(0x1), Mask(0x4)
	uint8_t bRequiresLoopingNotification : 1; // 0x29(0x1), Mask(0x8)
	uint8_t BitPad_0x29_4 : 4; // 0x29(0x1)
	uint8_t LODValidity; // 0x2A(0x1)
	uint8_t Pad_0x2B[0x5]; // 0x2B(0x5)
};

// Object: Class Engine.DecalComponent
// Size: 0x390 (Inherited: 0x350)
struct UDecalComponent : USceneComponent
{
	struct UMaterialInterface* DecalMaterial; // 0x348(0x8)
	int32_t SortOrder; // 0x350(0x4)
	float FadeScreenSize; // 0x354(0x4)
	float FadeStartDelay; // 0x358(0x4)
	float FadeDuration; // 0x35C(0x4)
	float FadeInDuration; // 0x360(0x4)
	float FadeInStartDelay; // 0x364(0x4)
	uint8_t bDestroyOwnerAfterFade : 1; // 0x368(0x1), Mask(0x1)
	struct FVector DecalSize; // 0x36C(0xC)
	int32_t DecalLayer; // 0x378(0x4)
	uint8_t BitPad_0x380_1 : 7; // 0x380(0x1)
	uint8_t Pad_0x381[0xF]; // 0x381(0xF)


	// Object: Function Engine.DecalComponent.SetSortOrder
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4ee4b0
	// Params: [ Num(1) Size(0x4) ]
	void SetSortOrder(int32_t Value);

	// Object: Function Engine.DecalComponent.SetFadeScreenSize
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4ee558
	// Params: [ Num(1) Size(0x4) ]
	void SetFadeScreenSize(float NewFadeScreenSize);

	// Object: Function Engine.DecalComponent.SetFadeOut
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4ee6e4
	// Params: [ Num(3) Size(0x9) ]
	void SetFadeOut(float StartDelay, float Duration, bool DestroyOwnerAfterFade);

	// Object: Function Engine.DecalComponent.SetFadeIn
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4ee600
	// Params: [ Num(2) Size(0x8) ]
	void SetFadeIn(float StartDelay, float Duaration);

	// Object: Function Engine.DecalComponent.SetDecalMaterial
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4ee408
	// Params: [ Num(1) Size(0x8) ]
	void SetDecalMaterial(struct UMaterialInterface* NewDecalMaterial);

	// Object: Function Engine.DecalComponent.GetFadeStartDelay
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4ee8b0
	// Params: [ Num(1) Size(0x4) ]
	float GetFadeStartDelay();

	// Object: Function Engine.DecalComponent.GetFadeInStartDelay
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4ee848
	// Params: [ Num(1) Size(0x4) ]
	float GetFadeInStartDelay();

	// Object: Function Engine.DecalComponent.GetFadeInDuration
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4ee814
	// Params: [ Num(1) Size(0x4) ]
	float GetFadeInDuration();

	// Object: Function Engine.DecalComponent.GetFadeDuration
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4ee87c
	// Params: [ Num(1) Size(0x4) ]
	float GetFadeDuration();

	// Object: Function Engine.DecalComponent.GetDecalMaterial
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4ee3d4
	// Params: [ Num(1) Size(0x8) ]
	struct UMaterialInterface* GetDecalMaterial();

	// Object: Function Engine.DecalComponent.CreateDynamicMaterialInstance
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4ee398
	// Params: [ Num(1) Size(0x8) ]
	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance();
};

// Object: Class Engine.CurveBase
// Size: 0x30 (Inherited: 0x28)
struct UCurveBase : UObject
{
	uint8_t Pad_0x28[0x8]; // 0x28(0x8)


	// Object: Function Engine.CurveBase.GetValueRange
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4e57f0
	// Params: [ Num(2) Size(0x8) ]
	void GetValueRange(float& MinValue, float& MaxValue);

	// Object: Function Engine.CurveBase.GetTimeRange
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4e58f0
	// Params: [ Num(2) Size(0x8) ]
	void GetTimeRange(float& MinTime, float& MaxTime);
};

// Object: Class Engine.MaterialExpression
// Size: 0x40 (Inherited: 0x28)
struct UMaterialExpression : UObject
{
	struct UMaterial* Material; // 0x28(0x8)
	struct UMaterialFunction* Function; // 0x30(0x8)
	uint8_t bIsParameterExpression : 1; // 0x38(0x1), Mask(0x1)
	uint8_t BitPad_0x38_1 : 7; // 0x38(0x1)
	uint8_t Pad_0x39[0x7]; // 0x39(0x7)
};

// Object: Class Engine.MaterialExpressionTextureBase
// Size: 0x50 (Inherited: 0x40)
struct UMaterialExpressionTextureBase : UMaterialExpression
{
	struct UTexture* Texture; // 0x40(0x8)
	uint8_t SamplerType; // 0x48(0x1)
	uint8_t IsDefaultMeshpaintTexture : 1; // 0x49(0x1), Mask(0x1)
	uint8_t BitPad_0x49_1 : 7; // 0x49(0x1)
	uint8_t Pad_0x4A[0x6]; // 0x4A(0x6)
};

// Object: Class Engine.MaterialExpressionTextureSample
// Size: 0xD0 (Inherited: 0x50)
struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase
{
	struct FExpressionInput Coordinates; // 0x4C(0xC)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
	struct FExpressionInput TextureObject; // 0x60(0xC)
	uint8_t Pad_0x6C[0x8]; // 0x6C(0x8)
	struct FExpressionInput MipValue; // 0x74(0xC)
	uint8_t Pad_0x80[0x8]; // 0x80(0x8)
	struct FExpressionInput CoordinatesDX; // 0x88(0xC)
	uint8_t Pad_0x94[0x8]; // 0x94(0x8)
	struct FExpressionInput CoordinatesDY; // 0x9C(0xC)
	uint8_t Pad_0xA8[0x8]; // 0xA8(0x8)
	struct FExpressionInput AutomaticViewMipBiasValue; // 0xB0(0xC)
	uint8_t Pad_0xBC[0x8]; // 0xBC(0x8)
	uint8_t MipValueMode; // 0xC4(0x1)
	uint8_t SamplerSource; // 0xC5(0x1)
	uint8_t AutomaticViewMipBias : 1; // 0xC6(0x1), Mask(0x1)
	uint8_t BitPad_0xC6_1 : 7; // 0xC6(0x1)
	uint8_t ConstCoordinate; // 0xC7(0x1)
	int32_t ConstMipValue; // 0xC8(0x4)
	uint8_t Pad_0xCC[0x4]; // 0xCC(0x4)
};

// Object: Class Engine.MaterialExpressionTextureSampleParameter
// Size: 0xF0 (Inherited: 0xD0)
struct UMaterialExpressionTextureSampleParameter : UMaterialExpressionTextureSample
{
	struct FName ParameterName; // 0xCC(0x8)
	struct FGuid ExpressionGUID; // 0xD4(0x10)
	struct FName Group; // 0xE4(0x8)
};

// Object: Class Engine.MaterialExpressionTextureSampleParameter2D
// Size: 0xF0 (Inherited: 0xF0)
struct UMaterialExpressionTextureSampleParameter2D : UMaterialExpressionTextureSampleParameter
{
};

// Object: Class Engine.Character
// Size: 0x590 (Inherited: 0x340)
struct ACharacter : APawn
{
	struct USkeletalMeshComponent* Mesh; // 0x340(0x8)
	struct UCharacterMovementComponent* CharacterMovement; // 0x348(0x8)
	struct UCapsuleComponent* CapsuleComponent; // 0x350(0x8)
	struct FBasedMovementInfo BasedMovement; // 0x358(0x30)
	struct FBasedMovementInfo ReplicatedBasedMovement; // 0x388(0x30)
	float AnimRootMotionTranslationScale; // 0x3B8(0x4)
	uint8_t MovementTimeStampMask; // 0x3BC(0x1)
	uint8_t Pad_0x3BD[0x3]; // 0x3BD(0x3)
	struct FVector BaseTranslationOffset; // 0x3C0(0xC)
	uint8_t Pad_0x3CC[0x4]; // 0x3CC(0x4)
	struct FQuat BaseRotationOffset; // 0x3D0(0x10)
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x3E0(0x4)
	float ReplayLastTransformUpdateTimeStamp; // 0x3E4(0x4)
	uint8_t ReplicatedMovementMode; // 0x3E8(0x1)
	bool bInBaseReplication; // 0x3E9(0x1)
	uint8_t Pad_0x3EA[0x2]; // 0x3EA(0x2)
	float CrouchedEyeHeight; // 0x3EC(0x4)
	uint8_t bIsCrouched : 1; // 0x3F0(0x1), Mask(0x1)
	uint8_t bProxyIsJumpForceApplied : 1; // 0x3F0(0x1), Mask(0x2)
	uint8_t bPressedJump : 1; // 0x3F0(0x1), Mask(0x4)
	uint8_t bClientUpdating : 1; // 0x3F0(0x1), Mask(0x8)
	uint8_t bClientWasFalling : 1; // 0x3F0(0x1), Mask(0x10)
	uint8_t bClientResimulateRootMotion : 1; // 0x3F0(0x1), Mask(0x20)
	uint8_t bClientResimulateRootMotionSources : 1; // 0x3F0(0x1), Mask(0x40)
	uint8_t bSimGravityDisabled : 1; // 0x3F0(0x1), Mask(0x80)
	uint8_t bClientCheckEncroachmentOnNetUpdate : 1; // 0x3F1(0x1), Mask(0x1)
	uint8_t bServerMoveIgnoreRootMotion : 1; // 0x3F1(0x1), Mask(0x2)
	uint8_t bWasJumping : 1; // 0x3F1(0x1), Mask(0x4)
	uint8_t BitPad_0x3F1_3 : 5; // 0x3F1(0x1)
	uint8_t Pad_0x3F2[0x2]; // 0x3F2(0x2)
	float JumpKeyHoldTime; // 0x3F4(0x4)
	float JumpForceTimeRemaining; // 0x3F8(0x4)
	float ProxyJumpForceStartedTime; // 0x3FC(0x4)
	float JumpMaxHoldTime; // 0x400(0x4)
	int32_t JumpMaxCount; // 0x404(0x4)
	int32_t JumpCurrentCount; // 0x408(0x4)
	uint8_t Pad_0x40C[0x4]; // 0x40C(0x4)
	struct FMulticastInlineDelegate OnReachedJumpApex; // 0x410(0x10)
	uint8_t Pad_0x420[0x10]; // 0x420(0x10)
	struct FMulticastInlineDelegate MovementModeChangedDelegate; // 0x430(0x10)
	struct FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x440(0x10)
	struct FRootMotionSourceGroup SavedRootMotion; // 0x450(0x38)
	uint8_t Pad_0x488[0x8]; // 0x488(0x8)
	struct FRootMotionMovementParams ClientRootMotionParams; // 0x490(0x40)
	struct TArray<struct FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x4D0(0x10)
	struct FRepRootMotionMontage RepRootMotion; // 0x4E0(0x98)
	uint8_t Pad_0x578[0x18]; // 0x578(0x18)


	// Object: Function Engine.Character.UnCrouch
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4d0ff8
	// Params: [ Num(1) Size(0x1) ]
	void UnCrouch(bool bClientSimulation);

	// Object: Function Engine.Character.StopJumping
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4d1728
	// Params: [ Num(0) Size(0x0) ]
	void StopJumping();

	// Object: Function Engine.Character.StopAnimMontage
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4d1488
	// Params: [ Num(1) Size(0x8) ]
	void StopAnimMontage(struct UAnimMontage* AnimMontage);

	// Object: Function Engine.Character.SetAnimRootMotionTranslationScale
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4d0d7c
	// Params: [ Num(1) Size(0x4) ]
	void SetAnimRootMotionTranslationScale(float InAnimRootMotionTranslationScale);

	// Object: Function Engine.Character.ServerMoveOld
	// Flags: [Net|Native|Event|Public|NetServer|NetValidate]
	// Offset: 0xa4d2854
	// Params: [ Num(3) Size(0x11) ]
	void ServerMoveOld(float OldTimeStamp, struct FVector_NetQuantize10 OldAccel, uint8_t OldMoveFlags);

	// Object: Function Engine.Character.ServerMoveNoBase
	// Flags: [Net|Native|Event|Public|NetServer|NetValidate]
	// Offset: 0xa4d3534
	// Params: [ Num(7) Size(0x25) ]
	void ServerMoveNoBase(float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, uint8_t CompressedMoveFlags, uint8_t ClientRoll, uint32_t View, uint8_t ClientMovementMode);

	// Object: Function Engine.Character.ServerMoveDualNoBase
	// Flags: [Net|Native|Event|Public|NetServer|NetValidate]
	// Offset: 0xa4d2dac
	// Params: [ Num(11) Size(0x3D) ]
	void ServerMoveDualNoBase(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, uint8_t PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, uint8_t NewFlags, uint8_t ClientRoll, uint32_t View, uint8_t ClientMovementMode);

	// Object: Function Engine.Character.ServerMoveDualHybridRootMotion
	// Flags: [Net|Native|Event|Public|NetServer|NetValidate]
	// Offset: 0xa4d29a8
	// Params: [ Num(13) Size(0x51) ]
	void ServerMoveDualHybridRootMotion(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, uint8_t PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, uint8_t NewFlags, uint8_t ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, uint8_t ClientMovementMode);

	// Object: Function Engine.Character.ServerMoveDual
	// Flags: [Net|Native|Event|Public|NetServer|NetValidate]
	// Offset: 0xa4d3130
	// Params: [ Num(13) Size(0x51) ]
	void ServerMoveDual(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, uint8_t PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, uint8_t NewFlags, uint8_t ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, uint8_t ClientMovementMode);

	// Object: Function Engine.Character.ServerMove
	// Flags: [Net|Native|Event|Public|NetServer|NetValidate]
	// Offset: 0xa4d3794
	// Params: [ Num(9) Size(0x39) ]
	void ServerMove(float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, uint8_t CompressedMoveFlags, uint8_t ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, uint8_t ClientMovementMode);

	// Object: Function Engine.Character.RootMotionDebugClientPrintOnScreen
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa4d0ea8
	// Params: [ Num(1) Size(0x10) ]
	void RootMotionDebugClientPrintOnScreen(struct FString inString);

	// Object: Function Engine.Character.PlayAnimMontage
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4d1538
	// Params: [ Num(4) Size(0x18) ]
	float PlayAnimMontage(struct UAnimMontage* AnimMontage, float InPlayRate, struct FName StartSectionName);

	// Object: Function Engine.Character.OnWalkingOffLedge
	// Flags: [Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent]
	// Offset: 0xa4d1168
	// Params: [ Num(4) Size(0x28) ]
	void OnWalkingOffLedge(struct FVector& PreviousFloorImpactNormal, struct FVector& PreviousFloorContactNormal, struct FVector& PreviousLocation, float TimeDelta);

	// Object: Function Engine.Character.OnRep_RootMotion
	// Flags: [Final|Native|Public]
	// Offset: 0xa4d0e94
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_RootMotion();

	// Object: Function Engine.Character.OnRep_ReplicatedBasedMovement
	// Flags: [Native|Public]
	// Offset: 0xa4d1848
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_ReplicatedBasedMovement();

	// Object: Function Engine.Character.OnRep_ReplayLastTransformUpdateTimeStamp
	// Flags: [Final|Native|Public]
	// Offset: 0xa4d1818
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_ReplayLastTransformUpdateTimeStamp();

	// Object: Function Engine.Character.OnRep_MovementTimeStampMask
	// Flags: [Final|Native|Protected]
	// Offset: 0xa4d1864
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_MovementTimeStampMask();

	// Object: Function Engine.Character.OnRep_IsCrouched
	// Flags: [Native|Public]
	// Offset: 0xa4d1760
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_IsCrouched();

	// Object: Function Engine.Character.OnLaunched
	// Flags: [Event|Public|HasDefaults|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(3) Size(0xE) ]
	void OnLaunched(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride);

	// Object: Function Engine.Character.OnLanded
	// Flags: [Event|Public|HasOutParms|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x88) ]
	void OnLanded(struct FHitResult& Hit);

	// Object: Function Engine.Character.OnJumped
	// Flags: [Native|Event|Public|BlueprintEvent]
	// Offset: 0xa4d12f8
	// Params: [ Num(0) Size(0x0) ]
	void OnJumped();

	// Object: Function Engine.Character.LaunchCharacter
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xa4d1314
	// Params: [ Num(3) Size(0xE) ]
	void LaunchCharacter(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride);

	// Object: Function Engine.Character.K2_UpdateCustomMovement
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(1) Size(0x4) ]
	void K2_UpdateCustomMovement(float DeltaTime);

	// Object: Function Engine.Character.K2_OnStartCrouch
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(2) Size(0x8) ]
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);

	// Object: Function Engine.Character.K2_OnMovementModeChanged
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(4) Size(0x4) ]
	void K2_OnMovementModeChanged(uint8_t PrevMovementMode, uint8_t NewMovementMode, uint8_t PrevCustomMode, uint8_t NewCustomMode);

	// Object: Function Engine.Character.K2_OnEndCrouch
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x88270d8
	// Params: [ Num(2) Size(0x8) ]
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);

	// Object: Function Engine.Character.Jump
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4d1744
	// Params: [ Num(0) Size(0x0) ]
	void Jump();

	// Object: Function Engine.Character.IsPlayingRootMotion
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4d0e5c
	// Params: [ Num(1) Size(0x1) ]
	bool IsPlayingRootMotion();

	// Object: Function Engine.Character.IsJumpProvidingForce
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4d1670
	// Params: [ Num(1) Size(0x1) ]
	bool IsJumpProvidingForce();

	// Object: Function Engine.Character.HasAnyRootMotion
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4d0e24
	// Params: [ Num(1) Size(0x1) ]
	bool HasAnyRootMotion();

	// Object: Function Engine.Character.GetCurrentMontage
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa4d1454
	// Params: [ Num(1) Size(0x8) ]
	struct UAnimMontage* GetCurrentMontage();

	// Object: Function Engine.Character.GetBaseTranslationOffset
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4d17f4
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetBaseTranslationOffset();

	// Object: Function Engine.Character.GetBaseRotationOffsetRotator
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4d177c
	// Params: [ Num(1) Size(0xC) ]
	struct FRotator GetBaseRotationOffsetRotator();

	// Object: Function Engine.Character.GetAnimRootMotionTranslationScale
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xa4d0d48
	// Params: [ Num(1) Size(0x4) ]
	float GetAnimRootMotionTranslationScale();

	// Object: Function Engine.Character.Crouch
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa4d10b0
	// Params: [ Num(1) Size(0x1) ]
	void Crouch(bool bClientSimulation);

	// Object: Function Engine.Character.ClientVeryShortAdjustPosition
	// Flags: [Net|Native|Event|Public|HasDefaults|NetClient]
	// Offset: 0xa4d22fc
	// Params: [ Num(7) Size(0x23) ]
	void ClientVeryShortAdjustPosition(float Timestamp, struct FVector NewLoc, struct UPrimitiveComponent* NewBase, struct FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, uint8_t ServerMovementMode);

	// Object: Function Engine.Character.ClientResetPredictionData
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa4d182c
	// Params: [ Num(0) Size(0x0) ]
	void ClientResetPredictionData();

	// Object: Function Engine.Character.ClientCheatWalk
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa4d0f9c
	// Params: [ Num(0) Size(0x0) ]
	void ClientCheatWalk();

	// Object: Function Engine.Character.ClientCheatGhost
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa4d0f64
	// Params: [ Num(0) Size(0x0) ]
	void ClientCheatGhost();

	// Object: Function Engine.Character.ClientCheatFly
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xa4d0f80
	// Params: [ Num(0) Size(0x0) ]
	void ClientCheatFly();

	// Object: Function Engine.Character.ClientAdjustRootMotionSourcePosition
	// Flags: [Net|Native|Event|Public|HasDefaults|NetClient]
	// Offset: 0xa4d1968
	// Params: [ Num(12) Size(0x7B) ]
	void ClientAdjustRootMotionSourcePosition(float Timestamp, struct FRootMotionSourceGroup ServerRootMotion, bool bHasAnimRootMotion, float ServerMontageTrackPosition, struct FVector ServerLoc, struct FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, struct UPrimitiveComponent* ServerBase, struct FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, uint8_t ServerMovementMode);

	// Object: Function Engine.Character.ClientAdjustRootMotionPosition
	// Flags: [Net|Native|Event|Public|HasDefaults|NetClient]
	// Offset: 0xa4d2000
	// Params: [ Num(10) Size(0x3B) ]
	void ClientAdjustRootMotionPosition(float Timestamp, float ServerMontageTrackPosition, struct FVector ServerLoc, struct FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, struct UPrimitiveComponent* ServerBase, struct FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, uint8_t ServerMovementMode);

