// @AnubisCheatz
//
// sdk genrated by @crusher_14
//
// https://t.me/AnubisCheatz

#pragma once

namespace SDK
{

// Object: Class Slate.ButtonWidgetStyle
// Size: 0x510 (Inherited: 0x30)
struct UButtonWidgetStyle : USlateWidgetStyleContainerBase
{
	struct FButtonStyle ButtonStyle; // 0x30(0x4E0)
};

// Object: Class Slate.CheckBoxWidgetStyle
// Size: 0xB10 (Inherited: 0x30)
struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase
{
	struct FCheckBoxStyle CheckBoxStyle; // 0x30(0xAE0)
};

// Object: Class Slate.ComboBoxWidgetStyle
// Size: 0x7D0 (Inherited: 0x30)
struct UComboBoxWidgetStyle : USlateWidgetStyleContainerBase
{
	struct FComboBoxStyle ComboBoxStyle; // 0x30(0x7A0)
};

// Object: Class Slate.ComboButtonWidgetStyle
// Size: 0x790 (Inherited: 0x30)
struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase
{
	struct FComboButtonStyle ComboButtonStyle; // 0x30(0x760)
};

// Object: Class Slate.EditableTextBoxWidgetStyle
// Size: 0x1000 (Inherited: 0x30)
struct UEditableTextBoxWidgetStyle : USlateWidgetStyleContainerBase
{
	struct FEditableTextBoxStyle EditableTextBoxStyle; // 0x30(0xFD0)
};

// Object: Class Slate.EditableTextWidgetStyle
// Size: 0x440 (Inherited: 0x30)
struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase
{
	struct FEditableTextStyle EditableTextStyle; // 0x30(0x410)
};

// Object: Class Slate.ProgressWidgetStyle
// Size: 0x3A0 (Inherited: 0x30)
struct UProgressWidgetStyle : USlateWidgetStyleContainerBase
{
	struct FProgressBarStyle ProgressBarStyle; // 0x30(0x370)
};

// Object: Class Slate.ScrollBarWidgetStyle
// Size: 0xA60 (Inherited: 0x30)
struct UScrollBarWidgetStyle : USlateWidgetStyleContainerBase
{
	struct FScrollBarStyle ScrollBarStyle; // 0x30(0xA30)
};

// Object: Class Slate.ScrollBoxWidgetStyle
// Size: 0x4C0 (Inherited: 0x30)
struct UScrollBoxWidgetStyle : USlateWidgetStyleContainerBase
{
	struct FScrollBoxStyle ScrollBoxStyle; // 0x30(0x490)
};

// Object: Class Slate.SlateSettings
// Size: 0x30 (Inherited: 0x28)
struct USlateSettings : UObject
{
	bool bExplicitCanvasChildZOrder; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
};

// Object: Class Slate.SpinBoxWidgetStyle
// Size: 0x620 (Inherited: 0x30)
struct USpinBoxWidgetStyle : USlateWidgetStyleContainerBase
{
	struct FSpinBoxStyle SpinBoxStyle; // 0x30(0x5F0)
};

// Object: Class Slate.TextBlockWidgetStyle
// Size: 0x5C0 (Inherited: 0x30)
struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase
{
	struct FTextBlockStyle TextBlockStyle; // 0x30(0x590)
};

// Object: Class Slate.ToolMenuBase
// Size: 0x28 (Inherited: 0x28)
struct UToolMenuBase : UObject
{
};

} // namespace SDK
