// @AnubisCheatz
//
// sdk genrated by @crusher_14
//
// https://t.me/AnubisCheatz

#pragma once

namespace SDK
{

// Object: Enum Solarland.ERoleSkillOperation
enum class ERoleSkillOperation : uint8_t
{
	None = 0,
	ToNormal = 1,
	ClearCD = 2,
	ResetCD = 3,
	Forbid = 4,
	Unforbid = 5,
	Disable = 6,
	Enable = 7,
	ERoleSkillOperation_MAX = 8
};

// Object: Enum Solarland.ECustomParamType
enum class ECustomParamType : uint8_t
{
	None = 0,
	WeaponDamageScale = 1,
	SkillDamageScale = 2,
	HeadShootDamageScale = 3,
	VehicleDamageScale = 4,
	MoveSpeedScale = 5,
	ShieldScale = 6,
	HealthScale = 7,
	Resurgence = 8,
	GravityScale = 9,
	ECustomParamType_MAX = 10
};

// Object: Enum Solarland.EBattleEndType
enum class EBattleEndType : uint8_t
{
	None = 0,
	BattleOver = 1,
	PlayerNotEnough = 2,
	BeginTimeOut = 3,
	Abandoned = 4,
	EBattleEndType_MAX = 5
};

// Object: Enum Solarland.ESCTournamentType
enum class ESCTournamentType : uint8_t
{
	None = 0,
	SingleRace = 1,
	PointRace = 2,
	KnockoutRace = 3,
	PointRaceV2 = 4,
	ESCTournamentType_MAX = 5
};

// Object: Enum Solarland.ESCRoomType
enum class ESCRoomType : uint8_t
{
	None = 0,
	Normal = 1,
	Tournament = 2,
	CustomServer = 3,
	ESCRoomType_MAX = 4
};

// Object: Enum Solarland.ETutorialTriggerType
enum class ETutorialTriggerType : uint8_t
{
	TickActivateTutorials = 0,
	AlreadyTriggeredMaxCount = 1,
	HasSpecifiedItem = 2,
	HasTakenDamage = 3,
	PlayerAcountLevel = 4,
	SprintingContinuously = 5,
	StartShrinkSafeArea = 6,
	PlayerInOrOutSafeArea = 7,
	JumpBegin = 8,
	BackpackGeneralItemSlotChanged = 10,
	ShieldNotFull = 17,
	WidgetClicked = 19,
	CanUseSpecifiedVehicleAbility = 20,
	CanUseSpecifiedVehicleWeapon = 21,
	AirDropBoxLanded = 22,
	CommonEventHappened = 23,
	OpenBigMapUMG = 24,
	CanUseSpecifiedWeaponAbility = 25,
	TeammateStateInGameChanged = 28,
	InteractionBtnVisibleChanged = 29,
	PlayerInTargetStage = 30,
	EquipSpecifiedWeapon = 34,
	FeatureUnlock = 35,
	ApproachSpecifyActor = 36,
	BotAIDying = 38,
	RunningStep = 39,
	HasSpecifiedEquipmentByType = 40,
	TutorialLevelDone = 42,
	WeaponSlotHasSpecifiedItem = 45,
	PlayerBattleLevelUpgrade = 46,
	PlayerTalentPointChanged = 47,
	HasUIPanelOpened = 48,
	SpecifiedPlayerProficiency = 53,
	PlayerBattleLevelCompare = 54,
	PlayerHasAbilityTagChanged = 55,
	InteractionActorSpawn = 57,
	PlayerInOrOutExpSpring = 58,
	PlayerExpSpringStateChanged = 59,
	PlayerOperationTimes = 60,
	PlayerGameProgressChanged = 61,
	PlayerHasNotAbilityTagChanged = 62,
	BattleToSafeAreaIndex = 63,
	PlayerInMatchType = 64,
	ETutorialTriggerType_MAX = 65
};

// Object: Enum Solarland.ESCMInGameState
enum class ESCMInGameState : uint8_t
{
	None = 0,
	InPrepare = 1,
	InBattle = 2,
	InBattleEnd = 3,
	ESCMInGameState_MAX = 4
};

// Object: Enum Solarland.ESCMHostType
enum class ESCMHostType : uint8_t
{
	Global = 0,
	Side = 1,
	Player = 2,
	ESCMHostType_MAX = 3
};

// Object: Enum Solarland.ESCMDataRankType
enum class ESCMDataRankType : uint8_t
{
	None = 0,
	Ascending = 1,
	AscendingReplace = 2,
	Descending = 3,
	DescendingReplace = 4,
	ESCMDataRankType_MAX = 5
};

// Object: Enum Solarland.ESCMDataChangeType
enum class ESCMDataChangeType : uint8_t
{
	Add = 0,
	Change = 1,
	Delete = 2,
	DeleteAll = 3,
	ESCMDataChangeType_MAX = 4
};

// Object: Enum Solarland.EStatisticsType
enum class EStatisticsType : uint8_t
{
	None = 0,
	KillNum = 1,
	P_KillStreak = 2,
	KillDownNum = 3,
	AssistNum = 4,
	KillPlayer = 5,
	DeathNum = 6,
	LifeTime = 7,
	HealSelf = 8,
	DeathPos = 9,
	SaveCount = 10,
	ReceivedHeal = 11,
	KillTeammate = 12,
	KillDownTeammate = 13,
	CarSkillCount = 14,
	P_BattleResult = 15,
	S_KillCount = 16,
	S_KillDownCount = 17,
	S_AssistCount = 18,
	S_DeathCount = 19,
	S_SaveCount = 20,
	S_UnBattleEndPlayerCount = 21,
	G_KillNum = 22,
	G_KillDown = 23,
	KillNumToPlayerID = 24,
	KillNumToRealPlayer = 25,
	KillStreakHistory = 26,
	CharacterKillNumWithID = 27,
	AssistKillAINum = 28,
	AssistKillPlayerNum = 29,
	AssistKillToPlayerID = 30,
	KillNpcNum = 31,
	KillMonster = 32,
	TotalWeaponKillNum = 33,
	WeaponAssistWithID = 34,
	WeaponKillNumWithID = 35,
	FinalWeaponKillNumWithID = 36,
	FinalUnarmKillNum = 37,
	KillNumWithIDByVechile = 38,
	TotalVehicleKillNum = 39,
	RevengeNum = 40,
	AccurateKillTimes = 41,
	AccurateKillDownTimes = 42,
	WeaponSkillKillNum = 43,
	PunchKill = 44,
	PunchDamage = 45,
	AreaKillNum_Bubble = 46,
	KillSameCharacterCount = 47,
	KillFlyingEnemyNum = 48,
	KillPretendStateNum = 49,
	KillSlidingEnemyNum = 50,
	VictoryKillNum = 51,
	FirstBloodNum = 52,
	CriticalHeathKillNum = 53,
	DeathNumByPlayerID = 54,
	DyingCount = 55,
	DyingByNpc = 56,
	DyingByMonster = 57,
	DeathByVechile = 58,
	DeathByBombingArea = 59,
	CauseDamage = 60,
	CauseDamageToPlayerID = 61,
	CauseDamageToRealPlayer = 62,
	CauseDamageByHero = 63,
	WeaponDamageWithIDToPlayer = 64,
	WeaponDamageWithTypeToPlayer = 65,
	VechileDamageWithIDToPlayer = 66,
	TotalVehicleDamage = 67,
	ReceivedDamage = 68,
	ReceivedDamageByPlayerID = 69,
	DamageByAI = 70,
	DamageByMonster = 71,
	DamageToMonster = 72,
	DamageToNpc = 73,
	AccurateDamage = 74,
	AttackTimes = 75,
	FireShrapnelTimes = 76,
	HitTimes = 77,
	HitedTimes = 78,
	AccurateDameageTimes = 79,
	BeAccurateDameageTimes = 80,
	TeammateHeal = 81,
	ResurrectionCount = 82,
	RecoveryNum = 83,
	RescueSocialMatesNum = 84,
	VechileDistance = 85,
	TotalVechileDistance = 86,
	FriendVehicleDistance = 87,
	VehicleTime = 88,
	UseVehicleTypes = 89,
	LastUseVehicleID = 90,
	TakeTheCarOfEnemy = 91,
	DriveCarInAirTime = 92,
	DriveHoverCarInWaterDistance = 93,
	RepairVehicleCount = 94,
	WeaponID1 = 95,
	WeaponID2 = 96,
	WeaponLevel1 = 97,
	WeaponLevel2 = 98,
	UseWeaponSkillNum = 99,
	WeaponUseStartTimeWithID = 100,
	WeaponUseTimeWithID = 101,
	MaxGodWeaponNum = 102,
	CollectEnergy = 103,
	EscapeTimes = 104,
	CollectBoxNum = 105,
	CollectBoxNumWithHighQuality = 106,
	FlyCount = 107,
	ArmorUseCount = 108,
	ShieldRechargeCount = 109,
	EChestOpenNumForID = 110,
	LandingPos = 111,
	LandingTime = 112,
	DropoutEvent = 113,
	DropoutTime = 114,
	MedicineUseCount = 115,
	RadarUseCount = 116,
	OpenAirBoxNum = 117,
	KillInAirNum = 118,
	KillDownInAirNum = 119,
	ResurrectionNum = 120,
	ResurrectionCapsule = 121,
	TeamFriendRevive = 122,
	BuyESElectricNum = 123,
	CarFireCount = 124,
	HangTimeDuration = 125,
	SkydiveLandingDuration = 126,
	SwimDistance = 127,
	DanceCount = 128,
	PosionWalkDistance = 129,
	WalkDistance = 130,
	ShieldExpGainCount = 131,
	UpgradeShieldCount = 132,
	UpgradeRedShieldCount = 133,
	JumpBoardUseCount = 134,
	TerminaterCount = 135,
	ItemTypeCollectCount = 136,
	ZiplineUseCount = 137,
	LevelUpCount = 138,
	SlideShovelDistance = 139,
	FullSquadTerminators = 140,
	UltraLongKillCount = 141,
	UltimateSkillUseCount = 142,
	TacticalSkillUseCount = 143,
	SkillTotalDamage = 144,
	TacticalSkill1UseCount = 145,
	TacticalSkill2UseCount = 146,
	UltimateSkillDamage = 147,
	TacticalSkillDamage = 148,
	TacticalSkill2Damage = 149,
	UltimateSkillTakenDamage = 150,
	TacticalSkillTakenDamage = 151,
	TacticalSkill2TakenDamage = 152,
	UltimateSkillKillNum = 153,
	TacticalSkillKillNum = 154,
	TacticalSkill2KillNum = 155,
	UltimateSkillDamageCount = 156,
	TacticalSkillDamageCount = 157,
	TacticalSkill2DamageCount = 158,
	UltimateSkillDamageAvgDistance = 159,
	TacticalSkillDamageAvgDistance = 160,
	TacticalSkill2DamageAvgDistance = 161,
	SkillDamageHighestDistance = 162,
	HasHighlight = 163,
	WeaponID3 = 164,
	BackpackItems = 165,
	CurrentWeaponID = 166,
	StrongholdVisitCount = 167,
	StrongholdKillCount = 168,
	StrongholdBoxCollectCount = 169,
	StrongholdDanceCount = 170,
	StrongholdWalkDistance = 171,
	StrongholdDamage = 172,
	StrongholdItemCollectCount = 173,
	GameplayEnterIsland = 174,
	BuddyHighestDamage = 175,
	CollectBuddyBallCount = 176,
	CollectBuddyCount = 177,
	TesselationBuddyCount = 178,
	UseBuddyCount = 179,
	CauseDamageByBuddy = 180,
	MoveSafeAreaCount = 181,
	TotalCatchChillCount = 182,
	CatchChillMaxCountOneTime = 183,
	StayInBuddySmokeMaxSec = 184,
	MoveDeathBoxCount = 185,
	BuddyDeformMoveMaxDistance = 186,
	BuddyDeformTime = 187,
	BuddyEmissionselfCount = 188,
	BuddyWipeOutCount = 189,
	BuddyGetSuppliesCount = 190,
	BuddyGetItemCount = 191,
	BuddyScanEnemiesCount = 192,
	BuddyInWindSec = 193,
	BuddyPickUpCount = 194,
	HumanCannonSlamDownHit = 195,
	CollectRemoteBuddy = 196,
	MoveBuddyHelpMateCount = 197,
	BackpackBuddyItems = 198,
	BuddyUsedData = 199,
	MAX = 200
};

// Object: Enum Solarland.EPlayHighlightEntryType
enum class EPlayHighlightEntryType : uint8_t
{
	Settlement = 0,
	HistoricalMatch = 1,
	TournamentList = 2,
	CustomRoomList = 3,
	EPlayHighlightEntryType_MAX = 4
};

// Object: Enum Solarland.EReplayState
enum class EReplayState : uint8_t
{
	Idle = 0,
	Recording = 1,
	PlayingRequestAddress = 2,
	PlayingTryToStart = 3,
	PlayingStarted = 4,
	PlayingLoadLevelsStarted = 5,
	PlayingLevelLoaded = 6,
	PlayingStreamReadied = 7,
	PlayingFirstScrubing = 8,
	Playing = 9,
	PlayingAtEnd = 10,
	EReplayState_MAX = 11
};

// Object: Enum Solarland.EReplayType
enum class EReplayType : uint8_t
{
	None = 0,
	CustomRoom = 1,
	Tournament = 2,
	LiveWatchOnly = 3,
	LocalHighlight = 4,
	LocalMonitor = 5,
	DSMonitor = 6,
	SequencerToVideo = 7,
	EReplayType_MAX = 8
};

// Object: Enum Solarland.EWalkMode
enum class EWalkMode : uint8_t
{
	Idle = 0,
	Run = 1,
	Sprint = 2,
	CrouchIdle = 3,
	CrouchRun = 4,
	CrouchSprint = 5,
	Crawl = 6,
	SlideTackle = 7,
	EWalkMode_MAX = 8
};

// Object: Enum Solarland.EAirFloatType
enum class EAirFloatType : uint8_t
{
	None = 0,
	JetBoots = 1,
	AirFloat = 2,
	EtherCannonFloat = 3,
	NezhaFloat = 4,
	EAirFloatType_MAX = 5
};

// Object: Enum Solarland.EAirMoveMode
enum class EAirMoveMode : uint8_t
{
	None = 0,
	Jump = 1,
	JetFly = 2,
	Cruise = 3,
	Skydive = 4,
	Launch = 5,
	Fall = 6,
	Fly = 7,
	WallRun = 8,
	SkywardFly = 9,
	ZipLine = 10,
	HumanCannon = 11,
	CatchOwl = 12,
	SlidingRail = 13,
	Tornado = 14,
	CatchWall = 15,
	Gliding = 16,
	EAirMoveMode_MAX = 17
};

// Object: Enum Solarland.EClientMoveTrustType
enum class EClientMoveTrustType : uint8_t
{
	TrustLocation = 0,
	TrustLocationAndMovementMode = 1,
	EClientMoveTrustType_MAX = 2
};

// Object: Enum Solarland.EBoolean
enum class EBoolean : uint8_t
{
	BranchFalse = 0,
	BranchTrue = 1,
	EBoolean_MAX = 2
};

// Object: Enum Solarland.EActorRegisterType
enum class EActorRegisterType : uint8_t
{
	EART_None = 0,
	EART_Character = 1,
	EART_Vehicle = 2,
	EART_Turret = 4,
	EART_TreasureBox = 8,
	EART_ChargingPile = 16,
	EART_Summon = 32,
	EART_HumanoidTarget = 64,
	EART_Water = 128,
	EART_MAX = 129
};

// Object: Enum Solarland.ESolarStageAssetPlatformFlags
enum class ESolarStageAssetPlatformFlags : uint8_t
{
	None = 0,
	Mobile = 1,
	Desktop = 2,
	AllPlatform = 3,
	ESolarStageAssetPlatformFlags_MAX = 4
};

// Object: Enum Solarland.ESolarNetMode
enum class ESolarNetMode : uint8_t
{
	NM_Standalone = 0,
	NM_DedicatedServer = 1,
	NM_ListenServer = 2,
	NM_Client = 3,
	NM_MAX = 4,
	NM_Unknown = 5
};

// Object: Enum Solarland.ESolarPlayStage
enum class ESolarPlayStage : uint8_t
{
	None = 0,
	Login = 1,
	Lobby = 2,
	Battle = 3,
	Settlement = 4,
	PlaceHolder1 = 5,
	PlaceHolder2 = 6,
	PlaceHolder3 = 7,
	ESolarPlayStage_MAX = 8
};

// Object: Enum Solarland.ESolarStageFlags
enum class ESolarStageFlags : uint8_t
{
	None = 0,
	Login = 1,
	Lobby = 2,
	Tutorial = 4,
	Battle = 8,
	Settlement = 16,
	Training = 32,
	All = 63,
	ESolarStageFlags_MAX = 64
};

// Object: Enum Solarland.EItemModifyResult
enum class EItemModifyResult : uint8_t
{
	Succeed = 0,
	Overflow = 1,
	Deficient = 2,
	IllegalParam = 3,
	Error = 4,
	EItemModifyResult_MAX = 5
};

// Object: Enum Solarland.EItemAppearanceType
enum class EItemAppearanceType : uint8_t
{
	EApprenace_None = 0,
	EApprenace_Outline = 1,
	EApprenace_Float = 2,
	EApprenace_All = 3,
	EApprenace_MAX = 4
};

// Object: Enum Solarland.EItemType
enum class EItemType : uint8_t
{
	NONE = 0,
	SHIELD = 1,
	ARMOR = 2,
	BULLET = 3,
	CARIRIDGE_BAG = 4,
	ARMOR_MATERIAL = 5,
	ENERGY_MODULE = 6,
	EXTRA_ENERGY = 7,
	RADAR_OPERATOR = 8,
	BACKPACK_ENERGY = 9,
	BACKUP_ENERGY = 10,
	SHIELD_RECHARGER = 11,
	BACKPACK_ITEM = 12,
	WEAPON_PARTS = 13,
	JETPACK_MODULE_HORIZONTAL = 14,
	JETPACK_MODULE_VERTICAL = 15,
	REVIVE_ITEM = 16,
	SELF_RESCUE = 17,
	TREASUREBOX = 18,
	AIRDROPBOX = 19,
	DEATHBOX = 20,
	HOTSPRINTBOX = 21,
	TACTICALBOX = 22,
	NEUTRAL_CARD = 23,
	COLLECTION_ITEM = 24,
	DRAGONBALL = 25,
	TALENT_POINT = 26,
	COLLECTION_CHEST = 27,
	KEY_CARD = 28,
	HELMET = 29,
	ENHANCER_AMMO = 30,
	ENHANCER_MEDIC = 31,
	ENHANCER_SHIELD_RECHARGER = 32,
	ENHANCER_BACKPACK = 33,
	TACTICAL_EQUIPMENTS = 34,
	SHIELD_UPGRADE_MATERIAL = 35,
	EXP_ITEM = 36,
	EXP_TOKEN = 37,
	WEAPON = 38,
	MISSIONSPAWN = 39,
	MISSIONCHEST = 40,
	MISSIONWORSHIP = 41,
	WEAPON_SKIN = 42,
	MELEE_WEAPON = 43,
	BACKPACK = 44,
	TAILFLAME = 45,
	CARDPOSE = 46,
	CARDBACKGROUND = 47,
	CAPSULE = 48,
	CHAR_SKIN_MIN = 49,
	CHAR_ANIMATION_MVP = 50,
	CHAR_SKIN_MAX = 51,
	CHARACTER = 52,
	EXPERIENCE = 53,
	GIFTBAG = 54,
	CHARACTER_TRIALCARD = 55,
	CHARACTERSKIN_TRIALCARD = 56,
	ACTIVENESS = 57,
	WEAPONSKIN_TRIALCARD = 58,
	GIFTBAG_ONBACKPACK = 59,
	BACKPACK_TRIALCARD = 60,
	TAILFLAME_TRIALCARD = 61,
	COUPON = 62,
	LOTCOIN = 63,
	ZOMBORG = 64,
	WISHCOIN = 65,
	SURPRISECOIN = 66,
	STARCOIN = 67,
	TOKEN = 68,
	BUSINESSCARDFRAME = 69,
	AVATARFRAME = 70,
	CHARACTER_SHARD = 71,
	CHARACTER_SKIN_SHARD = 72,
	WEAPON_SKIN_SHARD = 73,
	BACKPACK_SHARD = 74,
	TAILFLAME_SHARD = 75,
	CAPSULE_SHARD = 76,
	VEHICLE_SKIN_SHARD = 77,
	ACCOUNT_AVATAR = 78,
	EMOTE = 79,
	SIGNIN_CARD = 80,
	RAFFLE_TICKET = 81,
	BUDDYBALL = 82,
	VEHICLE_SKIN = 83,
	SUPPLYBOX = 84,
	RANDOM_PACK = 85,
	DISPLAY_ITEM = 86,
	EItemType_MAX = 87
};

// Object: Enum Solarland.EBagScopeSlotType
enum class EBagScopeSlotType : uint8_t
{
	None = 0,
	BandageSlot = 1,
	CarrageBagSlot = 2,
	ShieldRechargerSlot = 3,
	BigShieldRechargerSlot = 4,
	SMGAmmoSlot = 5,
	ShotGunAmmoSlot = 6,
	RifleAmmoSlot = 7,
	SniperAmmoSlot = 8,
	HelmetSlot = 9,
	Primary = 10,
	Second = 11,
	Bag = 12,
	BagSlot_0 = 13,
	BagSlot_1 = 14,
	BagSlot_2 = 15,
	BagSlot_3 = 16,
	BagSlot_4 = 17,
	BagSlot_5 = 18,
	PassiveSlot_0 = 19,
	PassiveSlot_1 = 20,
	PassiveSlot_2 = 21,
	ActiveSlot = 22,
	EnhancedBagSlot = 23,
	MuzzleSlot = 24,
	ScopeSlot = 25,
	ClipSlot = 26,
	GripSlot = 27,
	GunStockSlot = 28,
	ExclusivePartSlot = 29,
	TacticalEquipment1 = 30,
	TacticalEquipment2 = 31,
	KeyCardSlot_0 = 32,
	KeyCardSlot_1 = 33,
	KeyCardSlot_2 = 34,
	HeroCore = 35,
	ExclusivePartSlot_2 = 36,
	EBagScopeSlotType_MAX = 37
};

// Object: Enum Solarland.EWeaponSlotType
enum class EWeaponSlotType : uint8_t
{
	Primary = 0,
	Secondary = 1,
	UnArm = 2,
	EWeaponSlotType_MAX = 3
};

// Object: Enum Solarland.EGmType
enum class EGmType : uint8_t
{
	Fetch = 0,
	Discard = 1,
	ClearBackPack = 2,
	Use = 3,
	RemoveWeapon = 4,
	EGmType_MAX = 5
};

// Object: Enum Solarland.ESolarSummonDeathReason
enum class ESolarSummonDeathReason : uint8_t
{
	None = 0,
	Unknown = 1,
	SelfTimeDecay = 2,
	OtherDestroy = 3,
	Recycle = 4,
	AutoRecycle = 5,
	OwlExplodeHit = 6,
	InValid = 7,
	TargetLost = 8,
	ManualStop = 9,
	OwnerDeath = 10,
	SelfHealthDecay = 11,
	ESolarSummonDeathReason_MAX = 12
};

// Object: Enum Solarland.EHitSoundTargetType
enum class EHitSoundTargetType : uint8_t
{
	Default = 0,
	CharacterBody = 1,
	CharacterHead = 2,
	CharacterShieldBody = 3,
	CharacterShieldHead = 4,
	CharacterHeadshotSpecial = 5,
	CharacterHitDown = 6,
	CharacterHeadshotDown = 7,
	CharacterKill = 8,
	CharacterKill2 = 9,
	Vehicle = 10,
	VehicleWeakPoint = 11,
	SummonItemSolid = 12,
	SummonItemVirtual = 13,
	SummonBuddy = 14,
	EHitSoundTargetType_MAX = 15
};

// Object: Enum Solarland.EHitSoundSourceType
enum class EHitSoundSourceType : uint8_t
{
	Default = 0,
	Weapon = 1,
	Melee = 2,
	Skill = 3,
	VehicleWeapon = 4,
	VehicleSkill = 5,
	VehicleHit = 6,
	Poison = 7,
	AirDrop = 8,
	Bomb = 9,
	EHitSoundSourceType_MAX = 10
};

// Object: Enum Solarland.ESolarSummonSoundType
enum class ESolarSummonSoundType : uint8_t
{
	SummonSoundType_1P = 0,
	SummonSoundType_3P = 1,
	SummonSoundType_3P_Enemy = 2,
	SummonSoundType_MAX = 3
};

// Object: Enum Solarland.OnLSDestroyStrategy
enum class EOnLSDestroyStrategy : uint8_t
{
	Custom = 0,
	SelfDestroy = 1,
	FreeFall = 2,
	OnLSDestroyStrategy_MAX = 3
};

// Object: Enum Solarland.OnLSModifiedStrategy
enum class EOnLSModifiedStrategy : uint8_t
{
	Custom = 0,
	UpdateHeight = 1,
	OnLSModifiedStrategy_MAX = 2
};

// Object: Enum Solarland.EForceMovementSource
enum class EForceMovementSource : uint8_t
{
	E_BlackHole = 0,
	E_WindField = 1,
	E_MagneticDevice = 2,
	E_Max = 3
};

// Object: Enum Solarland.ETeamType
enum class ETeamType : uint8_t
{
	PlayerTeam = 0,
	AITeam = 1,
	OnlyPlayerTeam = 2,
	EmptyTeam = 3,
	AnyTeam = 4,
	ETeamType_MAX = 5
};

// Object: Enum Solarland.EMatchResult
enum class EMatchResult : uint8_t
{
	None = 0,
	Victory = 1,
	Fail = 2,
	Draw = 3,
	EMatchResult_MAX = 4
};

// Object: Enum Solarland.ESocialActionType
enum class ESocialActionType : uint8_t
{
	None = 0,
	Like = 1,
	Unlike = 2,
	ESocialActionType_MAX = 3
};

// Object: Enum Solarland.EWeaponScopeType
enum class EWeaponScopeType : uint8_t
{
	None = 0,
	ScopeX0 = 1,
	ScopeX1 = 2,
	ScopeX2 = 3,
	ScopeX3 = 4,
	ScopeX4 = 5,
	ScopeX6 = 6,
	ScopeX8 = 7,
	ScopeX2Tac = 8,
	ScopeX1Holo = 9,
	ScopeX1X3 = 10,
	ScopeX4X8 = 11,
	ScopeX1Hot = 12,
	ScopeHighHot = 13,
	Count = 14,
	EWeaponScopeType_MAX = 15
};

// Object: Enum Solarland.EFindSpectateTargetType
enum class EFindSpectateTargetType : uint8_t
{
	Teammate = 0,
	PlayerKiller = 1,
	AIKiller = 2,
	AllNonBot = 3,
	All = 4,
	EFindSpectateTargetType_MAX = 5
};

// Object: Enum Solarland.EAssistLockState
enum class EAssistLockState : uint8_t
{
	None = 0,
	PreEnterAssistLock = 1,
	EnterAssistLock = 2,
	HoldAssistLock = 3,
	LeaveAssistLock = 4,
	EAssistLockState_MAX = 5
};

// Object: Enum Solarland.ESolarTablesEnum_BattleUpgradeEffectType
enum class ESolarTablesEnum_BattleUpgradeEffectType : uint8_t
{
	MaxHp = 0,
	BulletDamage = 1,
	CharacterSkillDamage = 2,
	VehicleWeaponDamage = 3,
	VehicleSkillDamage = 4,
	VehicleStrikeDamage = 5,
	CharacterPunchDamage = 6,
	CharacterUpgradeDamage = 7,
	SuperSkillCD = 8,
	Tactical_1_SkillCD = 9,
	Tactical_2_SkillCD = 10,
	Tactical_3_SkillCD = 11,
	_Count = 12,
	ESolarTablesEnum_MAX = 13
};

// Object: Enum Solarland.ESpectatePhase
enum class ESpectatePhase : uint8_t
{
	NotSpectate = 0,
	LookAtSelfDeathBox = 1,
	SpectateTeammates = 2,
	BlockWhenAced = 3,
	SpectateAllPlayers = 4,
	ESpectatePhase_MAX = 5
};

// Object: Enum Solarland.EPlayerStateRepType
enum class EPlayerStateRepType : uint8_t
{
	Character = 0,
	Controller = 1,
	EPlayerStateRepType_MAX = 2
};

// Object: Enum Solarland.EExpBehaviorType
enum class EExpBehaviorType : uint8_t
{
	None = 0,
	Kill = 1,
	Assist = 2,
	Damage = 3,
	Pickup = 4,
	Survival = 5,
	Spawner = 6,
	Device = 7,
	TreasureBox = 8,
	DeathBox = 9,
	Airdrop = 10,
	PureDrop = 11,
	ExpSpring = 12,
	DmgToCharacter = 13,
	DmgToVehicle = 14,
	DmgToSummon = 15,
	SlotMachine = 16,
	TacticalBox = 19,
	ShieldUpgrade = 20,
	TeamDestroy = 21,
	RevengeKilling = 22,
	WeakReward = 23,
	KillDown = 24,
	AssistingKillDown = 25,
	OpenHotSprintBox = 26,
	OpenAirdrop = 27,
	UseRespawnDevice = 28,
	ReviveTeammates = 29,
	ReviveReward = 30,
	HelpReward = 31,
	CollectBuddy = 32,
	CollectRareBuddy = 33,
	DynamicKillDown = 34,
	DynamicAssistingKillDown = 35,
	ScanningConsoleDevice = 36,
	PoisonProphetDevice = 37,
	BuddyMachine = 38,
	CollectGoldBuddy = 39,
	VaultDoor = 40,
	CargoBot = 41,
	RevivalModeReviveTeammates = 42,
	EExpBehaviorType_MAX = 43
};

// Object: Enum Solarland.ECharacterStateInGame
enum class ECharacterStateInGame : uint8_t
{
	None = 0,
	InVehicle = 1,
	Dying = 2,
	Dead = 4,
	MaxState = 7,
	ECharacterStateInGame_MAX = 8
};

// Object: Enum Solarland.EPlayerStateInGame
enum class EPlayerStateInGame : uint8_t
{
	None = 0,
	AppHasDeactivated = 1,
	AppHasReactivated = 2,
	Talking = 4,
	MaxState = 7,
	EPlayerStateInGame_MAX = 8
};

// Object: Enum Solarland.ESolarSupportLanguages
enum class ESolarSupportLanguages : uint8_t
{
	DefaultLanguage = 0,
	SimplifiedChinese = 1,
	TraditionalChinese = 2,
	Arabic = 3,
	German = 4,
	English = 5,
	Spanish = 6,
	French = 7,
	Hindi = 8,
	Indonesian = 9,
	Italian = 10,
	Japanese = 11,
	Korean = 12,
	Malay = 13,
	Polish = 14,
	Portuguese = 15,
	Russian = 16,
	Thai = 17,
	Turkish = 18,
	Vietnamese = 19,
	Tagalog = 20,
	PO = 253,
	OP = 254,
	ESolarSupportLanguages_MAX = 255
};

// Object: Enum Solarland.ESCMDamageType
enum class ESCMDamageType : uint8_t
{
	Point = 0,
	Poison = 1,
	Bomb = 2,
	AirDrop = 3,
	Dying = 4,
	VehicleHit = 5,
	VehicleExplosion = 6,
	Weapon = 7,
	UnarmWeapon = 8,
	VehicleWeapon = 9,
	SummonWeapon = 10,
	VehicleAbility = 11,
	WeaponAbility = 12,
	HelplessDeathVerge = 13,
	DeathVergeInWater = 14,
	GMCmd = 15,
	BackToLobby = 16,
	AppEnterBackground = 17,
	LongTimeDisconnect = 18,
	ClassSkill = 19,
	TacticalSkill = 20,
	Outbound = 21,
	BuddySkill = 22,
	ExecutedDamage = 23,
	PersistentDamage = 24,
	BattleGroundHome = 25,
	ESCMDamageType_MAX = 26
};

// Object: Enum Solarland.EReplayActivityHeatKillUseType
enum class EReplayActivityHeatKillUseType : uint8_t
{
	None = 0,
	Weapon = 1,
	Vehicle = 2,
	Skill = 3,
	Punch = 4,
	EReplayActivityHeatKillUseType_MAX = 5
};

// Object: Enum Solarland.ESolarTablesEnum_CharacterType
enum class ESolarTablesEnum_CharacterType : uint8_t
{
	None = 0,
	Assault = 1,
	Defence = 2,
	Support = 3,
	Scout = 4,
	Control = 5,
	_Count = 6,
	ESolarTablesEnum_MAX = 7
};

// Object: Enum Solarland.EInteractionBuffState
enum class EInteractionBuffState : uint8_t
{
	None = 0,
	SpeedUp = 1,
	SpeedDown = 2,
	EInteractionBuffState_MAX = 3
};

// Object: Enum Solarland.EPlayerNetStateInGame
enum class EPlayerNetStateInGame : uint8_t
{
	None = 0,
	Online = 1,
	Offline = 2,
	EPlayerNetStateInGame_MAX = 3
};

// Object: Enum Solarland.ESkydiveStage
enum class ESkydiveStage : uint8_t
{
	None = 0,
	Flying = 1,
	Landing = 2,
	ESkydiveStage_MAX = 3
};

// Object: Enum Solarland.ETalentState
enum class ETalentState : uint8_t
{
	Activating = 0,
	CoolingDown = 1,
	Unactivated = 2,
	Invalid = 3,
	ETalentState_MAX = 4
};

// Object: Enum Solarland.EInteractableActorType
enum class EInteractableActorType : uint8_t
{
	None = 0,
	AirDropBox = 1,
	CarPad = 2,
	ConsoleDevice = 3,
	DragonSummoner = 4,
	BasicChest = 5,
	IntermediateChest = 6,
	AdvancedChest = 7,
	HotSpringChest = 8,
	BouncePad = 9,
	AdvancedBouncePad = 10,
	RespawnDevice = 11,
	ShieldUpgrade = 12,
	SkywardDive = 13,
	VendingMachine = 14,
	TacticalChest = 15,
	AdvancedTacticalChest = 16,
	ZipLine = 17,
	TreasureVaultDoor = 18,
	Door = 19,
	SlidingRail = 20,
	SlidingRailJumpPad = 21,
	PoisonProphetDevice = 22,
	VaultDoor = 23,
	BuddyMachineDevice = 24,
	DeathTreasureBox = 25,
	FabricationDevice = 26,
	ItemGiver = 27,
	EInteractableActorType_MAX = 28
};

// Object: Enum Solarland.EWorldMarkType
enum class EWorldMarkType : uint8_t
{
	ITEM = 0,
	INVALID = 1,
	WARNING = 2,
	MINIMAP = 3,
	BIGMAP = 4,
	VEHICLE = 5,
	INTERACTABLEACTOR = 6,
	QUICKCHATWHEEL = 7,
	ATTACHED = 8,
	SUMMONACTOR = 9,
	LASTVEHICLE = 10,
	PERMANENTMARK = 11,
	OTHER = 12,
	BUDDY = 13,
	STEALBUDDY = 14,
	KILLLEADER = 15,
	SKILLAREAALERT = 16,
	MAX = 17
};

// Object: Enum Solarland.ESolarDeviceLevel
enum class ESolarDeviceLevel : uint8_t
{
	ESDL_Invalid = 0,
	ESDL_Level1 = 1,
	ESDL_Level2 = 2,
	ESDL_Level3 = 3,
	ESDL_Level4 = 4,
	ESDL_Level5 = 5,
	ESDL_Level6 = 6,
	ESDL_Level7 = 7,
	ESDL_VALUE_MIN = 8,
	ESDL_VALUE_MAX = 9,
	ESDL_MAX = 10
};

// Object: Enum Solarland.EWeaponInfiniteAmmoMode
enum class EWeaponInfiniteAmmoMode : uint8_t
{
	Default = 0,
	InfiniteClip = 1,
	InfinitePkg = 2,
	InfiniteBoth = 3,
	EWeaponInfiniteAmmoMode_MAX = 4
};

// Object: Enum Solarland.EClientReplayMonitorReason
enum class EClientReplayMonitorReason : uint8_t
{
	ForceByStartUpParam = 0,
	AMTClientReplay = 1,
	SsmMonitorPlayerRequest = 2,
	DeviceLevelMeetCond = 3,
	DynamicCmd = 4,
	EClientReplayMonitorReason_MAX = 5
};

// Object: Enum Solarland.EHitBodyPart
enum class EHitBodyPart : uint8_t
{
	Default = 0,
	Head = 1,
	UpperBody = 2,
	EHitBodyPart_MAX = 3
};

// Object: Enum Solarland.ECombatScoreChangeReason
enum class ECombatScoreChangeReason : uint8_t
{
	Normal = 0,
	RankingScoreLimitInMatch = 1,
	PerformanceScoreLimitInMatch = 2,
	CombatScoreLimitInMatch = 3,
	RankingScoreLimitInRank = 4,
	PerformanceScoreLimitInRank = 5,
	CombatScoreLimitInRank = 6,
	TeamNotFull = 7,
	RankDiffToLarge = 8,
	Cheat = 9,
	HangUp = 10,
	ECombatScoreChangeReason_MAX = 11
};

// Object: Enum Solarland.EAppLifetimeState
enum class EAppLifetimeState : uint8_t
{
	NONE = 0,
	NORMAL = 1,
	Background = 2,
	Deactive = 3,
	Terminated = 4,
	EAppLifetimeState_MAX = 5
};

// Object: Enum Solarland.ESkydivingState
enum class ESkydivingState : uint8_t
{
	NotStarted = 0,
	PreStart = 1,
	InProgress = 2,
	Completed = 3,
	ESkydivingState_MAX = 4
};

// Object: Enum Solarland.ECruiseState
enum class ECruiseState : uint8_t
{
	None = 0,
	Boarded = 1,
	CruiseStarted = 2,
	ParachuteAllowed = 3,
	ParachuteStarted = 4,
	End = 5,
	Max = 6
};

// Object: Enum Solarland.ESCMPlayerOutPath
enum class ESCMPlayerOutPath : uint8_t
{
	None = 0,
	OutFromSettingUI = 1,
	OutBySelf = 2,
	KickOutByServer = 3,
	OBSwitchScene = 4,
	Victory = 5,
	ESCMPlayerOutPath_MAX = 6
};

// Object: Enum Solarland.ESCMPlayerPunishType
enum class ESCMPlayerPunishType : uint8_t
{
	None = 0,
	HangUp = 1,
	DropOut = 2,
	IsolationPool = 3,
	KillTeammate = 4,
	Cheat = 5,
	RankTooLarge = 6,
	ESCMPlayerPunishType_MAX = 7
};

// Object: Enum Solarland.EReplayCameraMode
enum class EReplayCameraMode : uint8_t
{
	None = 0,
	PlayerViewMode = 1,
	FPPPlayerViewMode = 2,
	LockMode = 3,
	FreeMode = 4,
	LookAtMode = 5,
	CircularMode = 6,
	FreeLookAtMode = 7,
	CloseUpMode = 8,
	VictimMode = 9,
	FollowProjectileMode = 10,
	SequenceMode = 11,
	AnchorPointMode = 12,
	EReplayCameraMode_MAX = 13
};

// Object: Enum Solarland.EResurrectType
enum class EResurrectType : uint8_t
{
	None = 0,
	DirectResurrect = 1,
	ResurrectCapsule = 2,
	Parachute = 3,
	EResurrectType_MAX = 4
};

// Object: Enum Solarland.ESolarSpatialAudioRoomMaterial
enum class ESolarSpatialAudioRoomMaterial : uint8_t
{
	Invalid = 0,
	Common = 10,
	Metal = 20,
	Tunnel = 30,
	ESolarSpatialAudioRoomMaterial_MAX = 31
};

// Object: Enum Solarland.ESolarSpatialAudioRoomSize
enum class ESolarSpatialAudioRoomSize : uint8_t
{
	Invalid = 0,
	Room_Small = 10,
	Room_Medium = 20,
	Room_Large = 30,
	Room_UltraLarge = 40,
	ESolarSpatialAudioRoomSize_MAX = 41
};

// Object: Enum Solarland.ESolarCharacterType
enum class ESolarCharacterType : uint8_t
{
	ESolarCharacterType_None = 0,
	ESolarCharacterType_Player = 1,
	ESolarCharacterType_Bot = 2,
	ESolarCharacterType_Monster = 3,
	ESolarCharacterType_MAX = 4
};

// Object: Enum Solarland.ECharacterSoundOpt
enum class ECharacterSoundOpt : uint8_t
{
	None = 0,
	Shield_Hit_1P = 1,
	Shield_Hit_3P = 2,
	Shield_Broken_1P = 3,
	Shield_Broken_3P = 4,
	Vehicle_Speedboard_1P = 5,
	Body_Hit_With_Bullet_Common_1P = 6,
	Body_Hit_By_Bullet_Common_1P = 7,
	Body_Hit_With_Punch_Common_1P = 8,
	Body_Hit_By_Punch_Common_1P = 9,
	Headshot_1P = 10,
	Headshot_Kill_UI = 11,
	Shot_Down_UI = 12,
	Shot_Down_1P = 13,
	Shot_Down_3P = 14,
	Shot_Down_3P_Enemy = 15,
	Death_UI = 16,
	Death_1P = 17,
	Death_3P = 18,
	Airborne_Fall_Start_1P = 19,
	Water_Fall_1P = 20,
	Water_Fall_3P = 21,
	Water_Fall_3P_Enemy = 22,
	Squat_1P = 23,
	Squat_3P = 24,
	Squat_3P_Enemy = 25,
	Stop_Climb_1P = 26,
	Stop_Climb_3P = 27,
	Stop_Climb_3P_Enemy = 28,
	Loop_Knapsack_Solar_Percent_1P = 29,
	Stop_Knapsack_Solar_Percent_1P = 30,
	Knapsack_Solar_Charging_Done_1P = 31,
	Knapsack_Solar_On_1P = 32,
	Knapsack_Solar_Off_1P = 33,
	Knapsack_Landing_1P = 34,
	Knapsack_Landing_3P = 35,
	Knapsack_Landing_3P_Enemy = 36,
	Knapsack_Fly_Water_1P = 37,
	Knapsack_Fly_Water_3P = 38,
	Knapsack_Fly_Water_3P_Enemy = 39,
	Play_Shield_OneSet_1P = 40,
	Play_Shield_OneSet_3P = 41,
	Play_Shield_OneSet_3P_Enemy = 42,
	Play_Shield_Charging_1P = 43,
	Play_Shield_Multi_Charging_1P = 44,
	Play_Shield_Charging_3P = 45,
	Play_Shield_Charging_3P_Enemy = 46,
	Play_Shield_Charged_1P = 47,
	Play_Shield_Charged_3P = 48,
	Play_Shield_Charged_3P_Enemy = 49,
	Play_Shield_Charge_To_Max_1P = 50,
	Play_Shield_Charge_To_Max_3P = 51,
	Play_Shield_Charge_To_Max_3P_Enemy = 52,
	Play_Shield_Charge_Break_1P = 53,
	Play_Shield_Charge_Break_3P = 54,
	Play_Shield_Charge_Break_3P_Enemy = 55,
	Play_Hit_By_EMP_1P = 56,
	Play_Hit_By_EMP_3P = 57,
	Play_Hit_By_EMP_3P_Enemy = 58,
	Stop_Hit_By_EMP_1P = 59,
	Stop_Hit_By_EMP_3P = 60,
	Stop_Hit_By_EMP_3P_Enemy = 61,
	Play_Monster_Appear = 62,
	Play_Monster_Die = 63,
	Play_Heal_Wrap_1P = 64,
	Play_Heal_Wrap_3P = 65,
	Play_Heal_Wrap_3P_Enemy = 66,
	Stop_Heal_Wrap_1P = 67,
	Stop_Heal_Wrap_3P = 68,
	Stop_Heal_Wrap_3P_Enemy = 69,
	Play_Heal_Wrap_Cancel_1P = 70,
	Play_Heal_Wrap_Cancel_3P = 71,
	Play_Heal_Wrap_Cancel_3P_Enemy = 72,
	Play_Heal_Wrap_Complete_1P = 73,
	Play_Heal_Wrap_Complete_3P = 74,
	Play_Heal_Wrap_Complete_3P_Enemy = 75,
	Stop_Shield_Charging_1P = 76,
	Stop_Shield_Charging_3P = 77,
	Stop_Shield_Charging_3P_Enemy = 78,
	Mark_Select_Dial_UI = 79,
	Mark_Select_Pin_UI = 80,
	Mark_Select_Cancel_UI = 81,
	Mark_Select_Common_UI = 82,
	Mark_Danger_UI = 83,
	Play_Skill_Fast_Reload = 84,
	Play_char_skill_passive_targetlock = 85,
	Max = 86
};

// Object: Enum Solarland.EDamageResultType
enum class EDamageResultType : uint8_t
{
	Normal = 0,
	Down = 1,
	Die = 2,
	EDamageResultType_MAX = 3
};

// Object: Enum Solarland.EHealthChangeType
enum class EHealthChangeType : uint8_t
{
	Normal = 0,
	Self = 1,
	Ability = 2,
	Ability_Deadly = 3,
	Item = 4,
	Teammate = 5,
	Environment = 6,
	EHealthChangeType_MAX = 7
};

// Object: Enum Solarland.EWeaponPartType
enum class EWeaponPartType : uint8_t
{
	Muzzle = 0,
	Scope = 1,
	Clip = 2,
	Grip = 3,
	GunStock = 4,
	Exclusive = 5,
	Exclusive2 = 6,
	MAX = 7
};

// Object: Enum Solarland.EShieldUpgradeInteractAckType
enum class EShieldUpgradeInteractAckType : uint8_t
{
	Success = 0,
	ItemReachLimit = 1,
	AlreadyInteracted = 2,
	SuccessWithReconnect = 3,
	InteractedByTeammate = 4,
	EShieldUpgradeInteractAckType_MAX = 5
};

// Object: Enum Solarland.ECancelRespawnDeviceReason
enum class ECancelRespawnDeviceReason : uint8_t
{
	OutOfRange = 0,
	CharacterDead = 1,
	AbilityIterupted = 2,
	NoNeedRevive = 3,
	IsInUse = 4,
	DeviceDestroyed = 5,
	ECancelRespawnDeviceReason_MAX = 6
};

// Object: Enum Solarland.EWeaponShootPattern
enum class EWeaponShootPattern : uint8_t
{
	Normal = 0,
	Single = 1,
	Burst = 2,
	Bolt = 3,
	EWeaponShootPattern_MAX = 4
};

// Object: Enum Solarland.ESolarHitType
enum class ESolarHitType : uint8_t
{
	None = 0,
	Character_Hit = 1,
	Character_Kill = 2,
	Character_BreakArmor = 3,
	Character_BreakShield = 4,
	Character_PendingKill = 5,
	Character_Headshot = 6,
	Character_HitShield = 7,
	Character_HitArmor = 8,
	Character_HitDown = 9,
	Character_HeadshotKill = 10,
	Character_HeadshotDown = 11,
	Character_HitShieldAndHeadshot = 12,
	Character_BreakShieldAndHeadshot = 13,
	Vehicle_Hit = 51,
	Vehicle_HitWeakness = 52,
	ESolarHitType_MAX = 53
};

// Object: Enum Solarland.EQuickCommunicationType
enum class EQuickCommunicationType : uint8_t
{
	NotifyRescueOrResurrect = 0,
	Appreciation = 1,
	NormalCommunication = 2,
	Max = 3
};

// Object: Enum Solarland.EShieldRechargeState
enum class EShieldRechargeState : uint8_t
{
	AutoRecharge = 0,
	ManualRecharge = 1,
	None = 2,
	EShieldRechargeState_MAX = 3
};

// Object: Enum Solarland.ESolarCharacterCameraPerspective
enum class ESolarCharacterCameraPerspective : uint8_t
{
	ThirdPerson = 0,
	FirstPerson = 1,
	ESolarCharacterCameraPerspective_MAX = 2
};

// Object: Enum Solarland.EItemChangeType
enum class EItemChangeType : uint8_t
{
	Default = 0,
	PickUp = 1,
	Drop = 2,
	EItemChangeType_MAX = 3
};

// Object: Enum Solarland.ERiftReportType
enum class ERiftReportType : uint8_t
{
	NormalVolume = 0,
	GuaranteeVolume = 1,
	ZLimit = 2,
	ERiftReportType_MAX = 3
};

// Object: Enum Solarland.EDriveState
enum class EDriveState : uint8_t
{
	None = 0,
	Driver = 1,
	Passenger = 2,
	EDriveState_MAX = 3
};

// Object: Enum Solarland.EExpressMarkState
enum class EExpressMarkState : uint8_t
{
	None = 0,
	Normal = 1,
	HoldingOrInBackpack = 2,
	Expressing = 3,
	BeyondTheDistance = 4,
	Interacting = 5,
	CoolDown = 6,
	EExpressMarkState_MAX = 7
};

// Object: Enum Solarland.ESpecAnimInstType
enum class ESpecAnimInstType : uint8_t
{
	Base = 0,
	Vehicle = 1,
	OneHandThrow = 2,
	KeepFiring = 3,
	Gatling = 4,
	CardsThrow = 5,
	DuckRolling = 6,
	InvisibleZone = 7,
	GrapplingHook = 8,
	ArrowRain = 9,
	BurstDagger = 10,
	ThunderFlash = 11,
	SmokeDevil = 12,
	ChargeCannon = 13,
	TrapMine = 14,
	HotWheels = 15,
	SlitheringDragon = 16,
	SummonRex = 17,
	ShieldCreator = 18,
	GenericOneHandThrow = 19,
	NormalSummon = 20,
	HellStrike = 21,
	EmbroideredBall = 22,
	MassInvisibility = 23,
	ESpecAnimInstType_MAX = 24
};

// Object: Enum Solarland.ERoleSkillStatus
enum class ERoleSkillStatus : uint8_t
{
	None = 0,
	Normal = 1,
	Active = 2,
	InCost = 4,
	InCD = 8,
	Forbidden = 16,
	Disable = 32,
	ERoleSkillStatus_MAX = 33
};

// Object: Enum Solarland.EVelocityStatus
enum class EVelocityStatus : uint8_t
{
	Any = 0,
	Stationary = 1,
	Moving = 2,
	EVelocityStatus_MAX = 3
};

// Object: Enum Solarland.EHitTraceType
enum class EHitTraceType : uint8_t
{
	None = 0,
	Default = 1,
	Shield = 2,
	Vehicle = 3,
	NezhaHitShield = 4,
	EHitTraceType_MAX = 5
};

// Object: Enum Solarland.EWeaponType
enum class EWeaponType : uint8_t
{
	AssualtRifle = 0,
	Submachinegun = 1,
	Shotgun = 2,
	Sniper = 3,
	VehicleMounted = 4,
	ItemWeapon = 5,
	SummonWeapon = 6,
	AntiVehicle = 7,
	ShooterRifle = 8,
	HandGun = 9,
	LightMachineGun = 10,
	Poker = 11,
	Unarm = 12,
	Unknown = 13,
	EWeaponType_MAX = 14
};

// Object: Enum Solarland.EShieldWidgetState
enum class EShieldWidgetState : uint8_t
{
	None = 0,
	DoAdd = 1,
	DoSub = 2,
	EShieldWidgetState_MAX = 3
};

// Object: Enum Solarland.ECharacterEjectState
enum class ECharacterEjectState : uint8_t
{
	Eject = 0,
	Land = 1,
	ECharacterEjectState_MAX = 2
};

// Object: Enum Solarland.EEnterBattleType
enum class EEnterBattleType : uint8_t
{
	OnHit = 0,
	OnWeaponFire = 1,
	NotEnter = 2,
	EEnterBattleType_MAX = 3
};

// Object: Enum Solarland.EInvincibleEndReason
enum class EInvincibleEndReason : uint8_t
{
	None = 0,
	Timeout = 1,
	Interrupt = 2,
	CharacterDestroyed = 3,
	Other = 4,
	EInvincibleEndReason_MAX = 5
};

// Object: Enum Solarland.EJetFlyType
enum class EJetFlyType : uint8_t
{
	None = 0,
	VerticalJetFly = 1,
	HorizontalJetFly = 2,
	CustomJetFly = 3,
	TemporaryVerticalJetFly = 4,
	TemporaryHorizontalJetFly = 5,
	EJetFlyType_MAX = 6
};

// Object: Enum Solarland.EScopeRecoverType
enum class EScopeRecoverType : uint8_t
{
	Shield = 0,
	Health = 1,
	EScopeRecoverType_MAX = 2
};

// Object: Enum Solarland.EShieldState
enum class EShieldState : uint8_t
{
	NONE = 0,
	NORMAL = 1,
	RECHARGE = 2,
	BREAK = 3,
	MAX = 4
};

// Object: Enum Solarland.ESingleCruiseState
enum class ESingleCruiseState : uint8_t
{
	NONE = 0,
	Fly = 1,
	RequestParachute = 2,
	Parachute = 3,
	ESingleCruiseState_MAX = 4
};

// Object: Enum Solarland.ESolarTreatmentState
enum class ESolarTreatmentState : uint8_t
{
	None = 0,
	Treating = 1,
	End = 2,
	ESolarTreatmentState_MAX = 3
};

// Object: Enum Solarland.ESlidingRailInteractState
enum class ESlidingRailInteractState : uint8_t
{
	None = 0,
	CanGetOn = 1,
	CanGetOff = 2,
	ESlidingRailInteractState_MAX = 3
};

// Object: Enum Solarland.EZiplineInteractState
enum class EZiplineInteractState : uint8_t
{
	None = 0,
	CanGetOn = 1,
	CanGetOff = 2,
	EZiplineInteractState_MAX = 3
};

// Object: Enum Solarland.EShieldSoundType
enum class EShieldSoundType : uint8_t
{
	StartRecharge = 0,
	Charging = 1,
	Charged = 2,
	ChargeBreak = 3,
	ShieldHitted = 4,
	ShieldBroken = 5,
	StopRecharge = 6,
	MultiCharging = 7,
	EShieldSoundType_MAX = 8
};

// Object: Enum Solarland.ETreatmentSoundType
enum class ETreatmentSoundType : uint8_t
{
	Healing = 0,
	Cancel = 1,
	StopHealing = 2,
	Completed = 3,
	ETreatmentSoundType_MAX = 4
};

// Object: Enum Solarland.EVMInteractFace
enum class EVMInteractFace : uint8_t
{
	None = 0,
	Forward = 1,
	Backward = 2,
	Left = 3,
	Right = 4,
	EVMInteractFace_MAX = 5
};

// Object: Enum Solarland.EIdleTurnType
enum class EIdleTurnType : uint8_t
{
	Turn_Idle = 0,
	Turn_Left = 1,
	Turn_Right = 2,
	Turn_MAX = 3
};

// Object: Enum Solarland.ETreasureBoxState
enum class ETreasureBoxState : uint8_t
{
	None = 0,
	Close = 1,
	Open = 2,
	ETreasureBoxState_MAX = 3
};

// Object: Enum Solarland.EDoorInteractionType
enum class EDoorInteractionType : uint8_t
{
	FButton = 0,
	HitLatch = 1,
	AutoOpen = 2,
	Combat = 3,
	EDoorInteractionType_MAX = 4
};

// Object: Enum Solarland.EWallRunState
enum class EWallRunState : uint8_t
{
	WallRunning = 0,
	Success = 1,
	Cancel = 2,
	EWallRunState_MAX = 3
};

// Object: Enum Solarland.EHumanCannonMoveState
enum class EHumanCannonMoveState : uint8_t
{
	None = 0,
	Prep = 1,
	Ascending = 2,
	Descending = 3,
	Landing = 4,
	EHumanCannonMoveState_MAX = 5
};

// Object: Enum Solarland.ESlidingRailSide
enum class ESlidingRailSide : uint8_t
{
	None = 0,
	Cable = 1,
	A = 2,
	B = 3,
	ESlidingRailSide_MAX = 4
};

// Object: Enum Solarland.ESlidingRailMoveState
enum class ESlidingRailMoveState : uint8_t
{
	None = 0,
	PreStart = 1,
	OnSlidingRail = 2,
	ESlidingRailMoveState_MAX = 3
};

// Object: Enum Solarland.EZiplineSide
enum class EZiplineSide : uint8_t
{
	None = 0,
	Cable = 1,
	A = 2,
	B = 3,
	MidwayBox = 4,
	EZiplineSide_MAX = 5
};

// Object: Enum Solarland.EZiplineMoveState
enum class EZiplineMoveState : uint8_t
{
	None = 0,
	PreStart = 1,
	OnZipline = 2,
	EZiplineMoveState_MAX = 3
};

// Object: Enum Solarland.EHitRecoverType
enum class EHitRecoverType : uint8_t
{
	None = 0,
	Normal = 1,
	DeathVerge = 2,
	DuckDunk = 4,
	C4Explosive = 8,
	SelfC4Explosive = 16,
	CounterForce = 32,
	RexCombo = 64,
	HumanCannonFallenSlam = 128,
	EHitRecoverType_MAX = 129
};

// Object: Enum Solarland.ESkillAnimType
enum class ESkillAnimType : uint8_t
{
	None = 0,
	SkillWithoutAnim = 1,
	OneHandThrow = 2,
	DoubleHandsThrow = 3,
	KeepFiring = 4,
	Gatling = 5,
	CardsThrow = 6,
	DuckRolling = 7,
	InvisibleZone = 8,
	GrapplingHook = 9,
	ArrowRain = 10,
	BurstDagger = 11,
	ThunderFlash = 12,
	SmokeDevil = 13,
	ChargeCannon = 14,
	TrapMine = 15,
	HotWheels = 16,
	SummonRex = 17,
	ShieldCreator = 18,
	GenericOneHandThrow = 19,
	NormalSummon = 20,
	HellStrike = 21,
	EmbroideredBall = 22,
	MassInvisibility = 23,
	ESkillAnimType_MAX = 24
};

// Object: Enum Solarland.EBGMInBattle
enum class EBGMInBattle : uint8_t
{
	None = 0,
	Curise = 1,
	Skydiving = 2,
	Land = 3,
	End = 4,
	EBGMInBattle_MAX = 5
};

// Object: Enum Solarland.EJetFlyAnimType
enum class EJetFlyAnimType : uint8_t
{
	Default = 0,
	HotWheelsNormalDash = 1,
	HotWheelsSuperDash = 2,
	EJetFlyAnimType_MAX = 3
};

// Object: Enum Solarland.EShieldSoundEventType
enum class EShieldSoundEventType : uint8_t
{
	Type_1P = 0,
	Type_3P = 1,
	Type_3P_Enemy = 2,
	Type_MAX = 3
};

// Object: Enum Solarland.ERescueState
enum class ERescueState : uint8_t
{
	EState_None = 0,
	EState_Dying = 1,
	EState_Rescuing = 2,
	EState_BeingRescue = 3,
	EState_MAX = 4
};

// Object: Enum Solarland.ECharacterLifeState
enum class ECharacterLifeState : uint8_t
{
	Normal = 0,
	Dead = 1,
	Dissolved = 2,
	ECharacterLifeState_MAX = 3
};

// Object: Enum Solarland.EInteractableType
enum class EInteractableType : uint8_t
{
	FIRECIRCLE = 0,
	JUMPPAD = 1,
	VEHICLEPAD = 2,
	RADARSTATION = 3,
	ELECTRICSHOP = 4,
	CHARGINGPILE = 5,
	SHIELDUPGRADEITEM = 6,
	SHIELDCREATOR = 7,
	TACTICALTREASUREBOX = 8,
	RESPAWNDEVICE = 9,
	DRAGON_SUMMONING_ALTAR = 10,
	AIRDROPTREASUREBOX = 11,
	EXPSPRING = 12,
	VALUTDOOR = 13,
	BUDDYWISHMACHINE = 14,
	CONSOLEDEVICE = 15,
	POISONPROPHETDEVICE = 16,
	MAX = 17
};

// Object: Enum Solarland.ECharacterBodyScaleType
enum class ECharacterBodyScaleType : uint8_t
{
	None = 0,
	Woman = 1,
	Man = 2,
	DuckMan = 3,
	SmallWoman = 4,
	ECharacterBodyScaleType_MAX = 5
};

// Object: Enum Solarland.EMapDarkDataType
enum class EMapDarkDataType : uint8_t
{
	POISONCIRCLE = 0,
	VICTORYSTATUE = 1,
	EMapDarkDataType_MAX = 2
};

// Object: Enum Solarland.EDirection
enum class EDirection : uint8_t
{
	TOP = 0,
	BOTTOM = 1,
	LEFT = 2,
	RIGHT = 3,
	EDirection_MAX = 4
};

// Object: Enum Solarland.EMapAirlineType
enum class EMapAirlineType : uint8_t
{
	Default = 0,
	Capsule = 1,
	Airdrop = 2,
	EMapAirlineType_MAX = 3
};

// Object: Enum Solarland.EWidgetStackAction
enum class EWidgetStackAction : uint8_t
{
	Push = 0,
	Pop = 1,
	EWidgetStackAction_MAX = 2
};

// Object: Enum Solarland.EUIRoot
enum class EUIRoot : uint8_t
{
	None = 0,
	UnderBattleRoot = 1,
	BattleNoticeRoot = 2,
	BattleRoot = 3,
	BattleRootGuide = 4,
	MiddleRoot = 5,
	CommonRoot = 6,
	Map = 7,
	MiddleNoticeRoot = 8,
	Guide = 9,
	PopRoot = 10,
	TipsRoot = 11,
	NoticeRoot = 12,
	Loading = 13,
	Reconnecting = 14,
	ExternalToolsRoot = 20,
	EUIRoot_MAX = 21
};

// Object: Enum Solarland.EUIPanelName
enum class EUIPanelName : uint8_t
{
	None = 0,
	SolarBattleControll = 1,
	UI_DeathView = 2,
	WorldMarkPanel = 3,
	WeaponCrosshairPanel = 4,
	SolarBattle_Backpack = 5,
	Separate_Discarded_MultiItem = 6,
	BigMapUMG = 7,
	HUD_CustomizedNotice = 8,
	HUD_CustomizedNotice_High = 9,
	UI_Settings = 10,
	UI_Setting_ExitPanel_Desktop = 11,
	UI_OB_Root = 12,
	UI_OB_GlobalControl = 13,
	UI_OB_BigMap = 14,
	UI_OB_Settlement = 15,
	UI_OB_Settlement_InputMask = 16,
	UI_OB_HeadInfo = 17,
	UI_OB_ShortKeyboard = 18,
	UI_OpeningShow = 19,
	UI_Eliminate = 20,
	UI_EliminateReport = 21,
	UI_BuyResurrectionPanel = 22,
	UI_Skill_Scan = 23,
	UI_RoleSkillPanel = 24,
	UI_HeroPick_Skin = 25,
	UI_HeroPick = 26,
	UI_HeroPick_Solo = 27,
	UI_HeroPick_BattleGround = 28,
	UI_HeroPick_Training = 29,
	JobEffectDetailPanel = 30,
	UI_BuffEffectScreenPanel = 31,
	UI_TestCustomPanel = 32,
	Solarland_DevDebugUI_Widget = 33,
	UI_Highlight_Overview = 34,
	UI_BattleGround_End = 35,
	UI_HUD_Teammate = 36,
	UI_HUD_Talent = 37,
	UI_HUD_HumanCannonState = 38,
	UI_HUD_BuddyInfo = 39,
	UI_HUD_TrainingModeMenu = 40,
	UI_Execution_HideHUD = 41,
	UI_Execution_CameraCut = 42,
	UI_VictoryShowEmpty = 43,
	UI_VictoryNotice = 44,
	UI_SkillAlert = 45,
	UI_ChooseWeapon = 46,
	UI_DeathMatch_BlackScreen = 47,
	UI_HUD_CommonWheel = 48,
	UI_Training_AdvancedSettings = 49,
	UI_HellStrikeSkillWidget = 50,
	UI_HUD_TipsContainer = 51,
	UI_BattleGround_ChooseLoadout = 52,
	UI_BattleGround_Deployment = 53,
	UI_Transition = 54,
	UI_ScreenEffect_Empty = 55,
	EUIPanelName_MAX = 56
};

// Object: Enum Solarland.EWidgetBackKeyType
enum class EWidgetBackKeyType : uint8_t
{
	Invalid = 0,
	FromKey = 1,
	FromClose = 2,
	EWidgetBackKeyType_MAX = 3
};

// Object: Enum Solarland.EWidgetLayerLevel
enum class EWidgetLayerLevel : uint8_t
{
	NormalWidget = 0,
	SameLevelCacheWidget = 1,
	SameLevelReplaceWidget = 2,
	CloseAllBackKeyWidget = 3,
	CloseAllBackKeyAndNormalWidget = 4,
	EWidgetLayerLevel_MAX = 5
};

// Object: Enum Solarland.EWidgetScope
enum class EWidgetScope : uint8_t
{
	World = 0,
	Global = 1,
	EWidgetScope_MAX = 2
};

// Object: Enum Solarland.EUIUserWidgetFlags
enum class EUIUserWidgetFlags : uint8_t
{
	None = 0,
	HideAllLtLayer = 1,
	EnableWidgetHide = 2,
	HideAllLtLayerOpen = 4,
	HideAllLtLayerClose = 8,
	CustomHandleAnalogX = 16,
	CustomHandleAnalogY = 32,
	DisableAnalogMovementMovement = 64,
	EUIUserWidgetFlags_MAX = 65
};

// Object: Enum Solarland.EAutoAtlasType
enum class EAutoAtlasType : uint8_t
{
	InvalidIndex = 0,
	Index1 = 1,
	Index2 = 2,
	Index3 = 3,
	Index4 = 4,
	Index5 = 5,
	Index6 = 6,
	Index7 = 7,
	Index8 = 8,
	Index9 = 9,
	Index10 = 10,
	Index11 = 11,
	Index12 = 12,
	Index13 = 13,
	Index14 = 14,
	Index15 = 15,
	Index16 = 16,
	Index17 = 17,
	Index18 = 18,
	Index19 = 19,
	Index20 = 20,
	EAutoAtlasType_MAX = 21
};

// Object: Enum Solarland.EInputCapture
enum class EInputCapture : uint8_t
{
	EIC_None = 0,
	EIC_Start = 1,
	EIC_End = 2,
	EIC_Move = 3,
	EIC_Transient = 4,
	EIC_All = 5,
	EIC_MAX = 6
};

// Object: Enum Solarland.EResurrectionState
enum class EResurrectionState : uint8_t
{
	Alive = 0,
	WaitingTeammatesHelp = 1,
	TimeOut = 2,
	AllTeammatesDied = 3,
	LeaveBattle = 4,
	EResurrectionState_MAX = 5
};

// Object: Enum Solarland.EItemState
enum class EItemState : uint8_t
{
	EItemState_NONE = 0,
	EItemState_POSSESS = 1,
	EItemState_DISCARD = 2,
	EItemState_MAX = 3
};

// Object: Enum Solarland.ECostType
enum class ECostType : uint8_t
{
	NONE = 0,
	ELECTRONIC = 1,
	ECostType_MAX = 2
};

// Object: Enum Solarland.EInteractionLayoutType
enum class EInteractionLayoutType : uint8_t
{
	CenterHorizontal = 0,
	RightVertical = 1,
	EInteractionLayoutType_MAX = 2
};

// Object: Enum Solarland.EBurstMethod
enum class EBurstMethod : uint8_t
{
	ParabCurveFitting = 0,
	GoldenSpiral = 1,
	EBurstMethod_MAX = 2
};

// Object: Enum Solarland.ESolarInputMode
enum class ESolarInputMode : uint8_t
{
	GameOnly = 0,
	GameAndUI = 1,
	UIOnly = 2,
	GameOnlyUponUI = 3,
	ESolarInputMode_MAX = 4
};

// Object: Enum Solarland.ECharacterRoleAbilityIndex
enum class ECharacterRoleAbilityIndex : uint8_t
{
	Super = 0,
	Tactical_1 = 1,
	Tactical_2 = 2,
	Tactical_3 = 3,
	Count = 4,
	ECharacterRoleAbilityIndex_MAX = 5
};

// Object: Enum Solarland.EShotMomentFlag
enum class EShotMomentFlag : uint8_t
{
	shotting = 0,
	hit = 1,
	killed = 2,
	invalid = 3,
	EShotMomentFlag_MAX = 4
};

// Object: Enum Solarland.EShotModeFlag
enum class EShotModeFlag : uint8_t
{
	orgin = 0,
	d3d = 1,
	xdm = 2,
	xbc = 3,
	xdi = 4,
	xda = 5,
	rand = 6,
	EShotModeFlag_MAX = 7
};

// Object: Enum Solarland.ESolarNetworkState
enum class ESolarNetworkState : uint8_t
{
	None = 0,
	PacketLoss = 1,
	Hitch = 2,
	ESolarNetworkState_MAX = 3
};

// Object: Enum Solarland.ESoundSyncType
enum class ESoundSyncType : uint8_t
{
	Invalid = 0,
	OnlySelf = 1,
	OnlyTeammate = 2,
	OnlyEnemy = 3,
	SelfAndTeammate = 4,
	SelfAndEnemy = 5,
	TeammateAndEnemy = 6,
	All = 7,
	ESoundSyncType_MAX = 8
};

// Object: Enum Solarland.ESoundCharacterRelationship
enum class ESoundCharacterRelationship : uint8_t
{
	Invalid = 0,
	Self = 1,
	Teammate = 2,
	Enemy = 3,
	ESoundCharacterRelationship_MAX = 4
};

// Object: Enum Solarland.EInteractiveQuickChatContentType
enum class EInteractiveQuickChatContentType : uint8_t
{
	None = 0,
	TacticalInstruction = 1,
	Appreciation = 2,
	Apology = 3,
	Gratitude = 4,
	ItemMark = 5,
	NotifyRescue = 6,
	NotifyResurrect = 7,
	Comment = 8,
	Rescue = 9,
	Resurrect = 10,
	PickUpItem = 11,
	Max = 12
};

// Object: Enum Solarland.ETalentUpgradeMode
enum class ETalentUpgradeMode : uint8_t
{
	None = 0,
	Close = 1,
	AutoUpgrade = 2,
	DelayUpgrade = 3,
	ETalentUpgradeMode_MAX = 4
};

// Object: Enum Solarland.ERespawnDeviceState
enum class ERespawnDeviceState : uint8_t
{
	Available = 0,
	InUse = 1,
	Unavailable = 2,
	ERespawnDeviceState_MAX = 3
};

// Object: Enum Solarland.EActivationType
enum class EActivationType : uint8_t
{
	None = 0,
	PlayerWeaponFire = 1,
	PlayerWeaponHit = 2,
	PlayerWeaponDown = 3,
	PlayerWeaponKill = 4,
	DriveVehicle = 5,
	VehicleWeaponFire = 6,
	VehicleWeaponHit = 7,
	VehicleWeaponDown = 8,
	VehicleWeaponKill = 9,
	SummonWeaponHit = 10,
	SummonWeaponDown = 11,
	SummonWeaponKill = 12,
	UseTacticalAbility = 13,
	TacticalAbilityHit = 14,
	TacticalAbilityDown = 15,
	TacticalAbilityKill = 16,
	UseUltimateAbility = 17,
	UltimateAbilityHit = 18,
	UltimateAbilityDown = 19,
	UltimateAbilityKill = 20,
	PlayerMelee = 21,
	PlayerMeleeHit = 22,
	PlayerMeleeDown = 23,
	PlayerMeleeKill = 24,
	Jump = 25,
	Crouch = 26,
	WallRun = 27,
	SwitchWeapon = 28,
	Sprint = 29,
	CancelSprint = 30,
	OpenOrCloseDoor = 31,
	Slide = 32,
	PlayerBeHit = 33,
	PlayerDown = 34,
	KillDown = 35,
	PlayerKilled = 36,
	Kill = 37,
	UseMedicine = 38,
	UseBigMedicine = 39,
	UseShield = 40,
	UseBigShield = 41,
	BeginUseMedicine = 42,
	EndUseMedicine = 43,
	BeginUseShield = 44,
	EndUseShield = 45,
	Reload = 46,
	VehicleBroken = 47,
	UseZipline = 48,
	UseSlidingRail = 49,
	PlayerFly = 50,
	PlayerLand = 51,
	RescueTeammate = 52,
	ReviveTeammate = 53,
	ReviveTeammateByRespawn = 54,
	KillJumpingEnemy = 55,
	KillSlidingEnemy = 56,
	KillZiplineEnemy = 57,
	KillWallRunEnemy = 58,
	KillPretendingEnemy = 59,
	UltraLongDistanceKill = 60,
	JumpDown = 61,
	JumpKill = 62,
	SlideDown = 63,
	SlideKill = 64,
	ZiplineDown = 65,
	ZiplineKill = 66,
	FinalDown = 67,
	FinalKill = 68,
	Assist = 69,
	UseBuddyItem = 70,
	HitSummonItem = 71,
	KillSummonItem = 72,
	VictoryKill = 73,
	WeaponHit100 = 74,
	WeaponHit150 = 75,
	WeaponHit200 = 76,
	WeaponHit300 = 77,
	WeaponDown100 = 78,
	WeaponDown150 = 79,
	WeaponDown200 = 80,
	WeaponDown300 = 81,
	HitHeadDown = 82,
	HitHeadKill = 83,
	LowHealthDown = 84,
	FallingDown = 85,
	FallingKill = 86,
	KillFlyingEnemy = 87,
	BlockKill = 88,
	BlockDown = 89,
	DoubleKill = 90,
	TripleKill = 91,
	QuadraKill = 92,
	PentaKill = 93,
	Legendary = 94,
	CruiseEnd = 95,
	ResurrectionParachute = 96,
	Win = 97,
	SkywardDiveStart = 98,
	SkywardDiveEnd = 99,
	BeginUseRespawnDevice = 100,
	EndUseRespawnDevice = 101,
	BeginRescueTeammate = 102,
	EndRescueTeammate = 103,
	BeginReviveTeammate = 104,
	EndReviveTeammate = 105,
	GlobalFirstBlood = 106,
	HumanCannonSlamDownHit = 107,
	CollectRemoteBuddy = 108,
	EActivationType_MAX = 109
};

// Object: Enum Solarland.EInputSwitchType
enum class EInputSwitchType : uint8_t
{
	ActionBinding = 0,
	ActionRemove = 1,
	AxisBinding = 2,
	AxisRemove = 3,
	EInputSwitchType_MAX = 4
};

// Object: Enum Solarland.ESolarIgnoreCollisionType
enum class ESolarIgnoreCollisionType : uint8_t
{
	EnergyShield = 0,
	SummonItemCore = 1,
	SummonItem = 2,
	Character = 3,
	Vehicle = 4,
	UAV = 5,
	Water = 6,
	C4 = 7,
	AIDog = 8,
	SmokeActor = 9,
	ESolarIgnoreCollisionType_MAX = 10
};

// Object: Enum Solarland.EClientBuddyState
enum class EClientBuddyState : uint8_t
{
	None = 0,
	Following = 1,
	FollowToHolding = 2,
	Holding = 3,
	Firing = 4,
	InCD = 5,
	EClientBuddyState_MAX = 6
};

// Object: Enum Solarland.EWorldMarkOperationBottomHalfStyle
enum class EWorldMarkOperationBottomHalfStyle : uint8_t
{
	None = 0,
	OnlyShowRichText = 1,
	RichTextAndIcon = 2,
	ReviveTeammates = 3,
	RichTextAndExtraInfo = 4,
	EWorldMarkOperationBottomHalfStyle_MAX = 5
};

// Object: Enum Solarland.EWorldMarkOperationUpperHalfStyle
enum class EWorldMarkOperationUpperHalfStyle : uint8_t
{
	None = 0,
	ShowInput = 1,
	HideInput = 2,
	ShowRichText = 3,
	EWorldMarkOperationUpperHalfStyle_MAX = 4
};

// Object: Enum Solarland.EAIDogSignalState
enum class EAIDogSignalState : uint8_t
{
	Signal_Normal = 0,
	Signal_Weak = 1,
	Signal_Lost = 2,
	Signal_MAX = 3
};

// Object: Enum Solarland.EBlinkRecallEndReason
enum class EBlinkRecallEndReason : uint8_t
{
	None = 0,
	TimeOut = 1,
	Cancel = 2,
	Confirm = 3,
	EBlinkRecallEndReason_MAX = 4
};

// Object: Enum Solarland.ECustomNoticeColor
enum class ECustomNoticeColor : uint8_t
{
	None = 0,
	White = 1,
	Red = 2,
	Green = 3,
	Blue = 4,
	Yellow = 5,
	ECustomNoticeColor_MAX = 6
};

// Object: Enum Solarland.ENoticeGMBlockType
enum class ENoticeGMBlockType : uint8_t
{
	None = 0,
	GameAutoNotice = 1,
	ENoticeGMBlockType_MAX = 2
};

// Object: Enum Solarland.ENoticeSpectateBlockType
enum class ENoticeSpectateBlockType : uint8_t
{
	None = 0,
	Block = 1,
	BlockOnlyTeammate = 2,
	BlockOnlyEnemy = 3,
	ClearOnSpectateTargetChange = 4,
	ENoticeSpectateBlockType_MAX = 5
};

// Object: Enum Solarland.ECustomNoticeType
enum class ECustomNoticeType : uint8_t
{
	SmallNotice = 0,
	MediumNotice = 1,
	BigNotice = 2,
	KillEffectNotice = 3,
	GlobalKillNotice = 4,
	TaskNotice = 5,
	ExpNotice = 6,
	ItemNotice = 7,
	CustomPosNotice = 8,
	All = 9,
	ECustomNoticeType_MAX = 10
};

// Object: Enum Solarland.ESCMPlayerOutType
enum class ESCMPlayerOutType : uint8_t
{
	None = 0,
	SelfLogout = 1,
	BattleEnd = 2,
	SelfEnd = 3,
	OfflineEnd = 4,
	Cheating = 5,
	TeammateCheating = 6,
	Abnormal = 7,
	Course = 8,
	ESCMPlayerOutType_MAX = 9
};

// Object: Enum Solarland.ESCMPlayerState
enum class ESCMPlayerState : uint8_t
{
	None = 0,
	NotJoin = 2,
	InBattle = 4,
	Suspend = 8,
	BattleEnd = 16,
	LeaveBattle = 32,
	ESCMPlayerState_MAX = 33
};

// Object: Enum Solarland.ESCMDataType
enum class ESCMDataType : uint8_t
{
	None = 0,
	Byte = 1,
	Int = 2,
	Float = 3,
	Bool = 4,
	FVector = 5,
	FString = 6,
	ESCMDataType_MAX = 7
};

// Object: Enum Solarland.ETaskPage
enum class ETaskPage : uint8_t
{
	TPNone = 0,
	TPDaily = 1,
	TPGrow = 2,
	TPHomeDaily = 3,
	TPSeason = 4,
	TPPassDaily = 5,
	TPPassWelfare = 6,
	TPPassWeek = 7,
	TPMonthlyDaily = 8,
	TPMonthlyWeek = 9,
	TPHalMonth = 10,
	TPWeekChallenge = 11,
	TPShareCodeDaily = 12,
	TPShareCodePersonal = 13,
	TPShareCodeFriend = 14,
	TPCollectRedeem = 15,
	TPEventPassWeek = 20,
	ETaskPage_MAX = 21
};

// Object: Enum Solarland.EPlayerResurrectType
enum class EPlayerResurrectType : uint8_t
{
	NONE = 0,
	SelfResurrectionCoin = 1,
	RequestTeamResurrect = 2,
	RespawnDevice = 3,
	ResurrectAsWinner = 4,
	GMRevive = 5,
	InfiniteRevival = 6,
	SkyIslandSelfResurrection = 7,
	EPlayerResurrectType_MAX = 8
};

// Object: Enum Solarland.ECharacterHealthState
enum class ECharacterHealthState : uint8_t
{
	Health = 0,
	Dying = 1,
	Death = 2,
	ECharacterHealthState_MAX = 3
};

// Object: Enum Solarland.ESCMPlayerGameRole
enum class ESCMPlayerGameRole : uint8_t
{
	StandBy = 0,
	OBPlayer = 1,
	Player = 2,
	Spectator = 3,
	ESCMPlayerGameRole_MAX = 4
};

// Object: Enum Solarland.ESCMPlayerType
enum class ESCMPlayerType : uint8_t
{
	None = 0,
	Player = 1,
	BotAI = 2,
	Monster = 3,
	ESCMPlayerType_MAX = 4
};

// Object: Enum Solarland.EPersonalScoreType
enum class EPersonalScoreType : uint8_t
{
	None = 0,
	Kill = 1,
	FactionAssist = 2,
	TeamAssist = 3,
	Damage = 4,
	OccupyingPerSec = 5,
	FactionCapture = 6,
	TeamCapture = 7,
	Release = 8,
	EPersonalScoreType_MAX = 9
};

// Object: Enum Solarland.EBattlegroundPlayerStatus
enum class EBattlegroundPlayerStatus : uint8_t
{
	WaitForBattle = 0,
	Battle = 1,
	WaitForRebirth = 2,
	Deploying = 3,
	EBattlegroundPlayerStatus_MAX = 4
};

// Object: Enum Solarland.EBattlegroundPlayerState
enum class EBattlegroundPlayerState : uint8_t
{
	Normal = 0,
	WaitingForDeployment = 1,
	ReadyForDeployment = 2,
	EBattlegroundPlayerState_MAX = 3
};

// Object: Enum Solarland.EDeploymentActorType
enum class EDeploymentActorType : uint8_t
{
	None = 0,
	Stronghold = 1,
	AliveTeammate = 2,
	EDeploymentActorType_MAX = 3
};

// Object: Enum Solarland.EJetFlyForbiddenType
enum class EJetFlyForbiddenType : uint8_t
{
	Water = 0,
	Climb = 1,
	EJetFlyForbiddenType_MAX = 2
};

// Object: Enum Solarland.ESolarITemHUDStyle
enum class ESolarITemHUDStyle : uint8_t
{
	Spread = 0,
	Wheel = 1,
	ESolarITemHUDStyle_MAX = 2
};

// Object: Enum Solarland.ECollectState
enum class ECollectState : uint8_t
{
	None = 0,
	Collect = 1,
	Shrink = 2,
	ECollectState_MAX = 3
};

// Object: Enum Solarland.EInputButton
enum class EInputButton : uint8_t
{
	EInputButton_None = 0,
	EInputButton_Jump = 1,
	EInputButton_RechargeShield = 2,
	EInputButton_BigRechargeShield = 3,
	EInputButton_Crouch = 4,
	EInputButton_JetVertical = 5,
	EInputButton_JetHorizontal = 6,
	EInputButton_Fire = 7,
	EInputButton_LeftFire = 8,
	EInputButton_AltFire = 9,
	EInputButton_QuickAds = 10,
	EInputButton_CancelAction = 11,
	EInputButton_FreeLook = 12,
	EInputButton_Interact = 13,
	EInputButton_InteractAlternative = 14,
	EInputButton_Reload = 15,
	EInputButton_TogglePrimaryWeapon = 16,
	EInputButton_ToggleSecondaryWeapon = 17,
	EInputButton_TogglePrimaryWeapon_Checkbox = 18,
	EInputButton_ToggleSecondaryWeapon_Checkbox = 19,
	EInputButton_ToggleGunsight = 20,
	EInputButton_Gunsight = 21,
	EInputButton_ViewWeapon = 22,
	EInputButton_SprintFreeOnPC = 23,
	EInputButton_SprintFreeOnMobile = 24,
	EInputButton_SprintLock = 25,
	EInputButton_Equip1 = 26,
	EInputButton_Equip2 = 27,
	EInputButton_Map = 28,
	EInputButton_Eject = 29,
	EInputButton_OutVehicle = 30,
	EInputButton_Backpack = 31,
	EInputButton_UseMedicine = 32,
	EInputButton_UseRecommendItem = 33,
	EInputButton_Pickup = 34,
	EInputButton_TogglePickup = 35,
	EInputButton_SwitchFireMode = 36,
	EInputButton_SwitchToSeat1 = 37,
	EInputButton_SwitchToSeat2 = 38,
	EInputButton_SwitchToSeat3 = 39,
	EInputButton_SwitchToSeat4 = 40,
	EInputButton_VehicleAbility1 = 41,
	EInputButton_VehicleAbility2 = 42,
	EInputButton_RoleSkillSuper = 43,
	EInputButton_RoleSkillTactical = 44,
	EInputButton_ShieldUpgrade = 45,
	EInputButton_ShieldUpgradeCancel = 46,
	EInputButton_TogglePutAwayWeapon = 47,
	EInputButton_UseBandage = 48,
	EInputButton_Max = 49
};

// Object: Enum Solarland.EPickupItemType
enum class EPickupItemType : uint8_t
{
	None = 0,
	Normal = 1,
	TreasureBox = 2,
	EPickupItemType_MAX = 3
};

// Object: Enum Solarland.EKillParamsCompressInfo
enum class EKillParamsCompressInfo : uint16_t
{
	Default = 0,
	bKillLeaderChange = 1,
	bKillLeaderShutDown = 2,
	bRevenge = 4,
	bShutDown = 8,
	bDown = 16,
	bClearTeam = 32,
	bKillDefender = 64,
	bKillerDead = 128,
	bHitHead = 256,
	bKillLeaderKill = 512,
	EKillParamsCompressInfo_MAX = 513
};

// Object: Enum Solarland.EPlayerScoreboardInfoUpdateType
enum class EPlayerScoreboardInfoUpdateType : uint8_t
{
	All = 0,
	Rank = 1,
	KillCount = 2,
	CausedDamageCount = 3,
	Score = 4,
	DeathCount = 5,
	MaxKillStreak = 6,
	ChangeConnectState = 7,
	ChangeCharacter = 8,
	ChangeKillLeader = 9,
	ChangeDefeater = 10,
	PlayerStatus = 11,
	OccupiedNum = 12,
	EPlayerScoreboardInfoUpdateType_MAX = 13
};

// Object: Enum Solarland.EVehicleInterationUIState
enum class EVehicleInterationUIState : uint8_t
{
	None = 0,
	Repair = 1,
	Drive = 2,
	Passenger = 4,
	Backpacker = 8,
	EVehicleInterationUIState_MAX = 9
};

// Object: Enum Solarland.ETransformerType
enum class ETransformerType : uint8_t
{
	Wheeled = 0,
	Legged = 1,
	Max = 2
};

// Object: Enum Solarland.EAlertDirection
enum class EAlertDirection : uint8_t
{
	Forward = 0,
	Backward = 1,
	Left = 2,
	Right = 3,
	EAlertDirection_MAX = 4
};

// Object: Enum Solarland.EWSCurWeaponUpdateType
enum class EWSCurWeaponUpdateType : uint8_t
{
	Switch = 0,
	PartUpdate = 1,
	EWSCurWeaponUpdateType_MAX = 2
};

// Object: Enum Solarland.EFabricationDevicePoolType
enum class EFabricationDevicePoolType : uint8_t
{
	Item = 0,
	RandomPackage = 1,
	EFabricationDevicePoolType_MAX = 2
};

// Object: Enum Solarland.EVehicleClass
enum class EVehicleClass : uint8_t
{
	All = 0,
	Wheeled = 1,
	Legged = 2,
	Hover = 3,
	EVehicleClass_MAX = 4
};

// Object: Enum Solarland.EWeaponUIType
enum class EWeaponUIType : uint8_t
{
	All = 0,
	AssualtRifle = 1,
	Submachinegun = 2,
	Shotgun = 3,
	Sniper = 4,
	MarksmanRifle = 5,
	Pistol = 6,
	Others = 7,
	EWeaponUIType_MAX = 8
};

// Object: Enum Solarland.ECRSettingClassAvailabilityType
enum class ECRSettingClassAvailabilityType : uint8_t
{
	AllUnavailable = 0,
	PartialAvailable = 1,
	AllAvailable = 2,
	ECRSettingClassAvailabilityType_MAX = 3
};

// Object: Enum Solarland.ECustomParamValueType
enum class ECustomParamValueType : uint8_t
{
	None = 0,
	Bool = 1,
	Int = 2,
	Float = 3,
	Percent = 4,
	Enum_S = 5,
	Enum_M = 6,
	AvailableWeapons = 7,
	AvailableVehicles = 8,
	ECustomParamValueType_MAX = 9
};

// Object: Enum Solarland.ERemovedReasonType
enum class ERemovedReasonType : uint8_t
{
	None = 0,
	TimeOut = 1,
	Abandoned = 2,
	OwnerKick = 3,
	NotEnough = 4,
	ServerKick = 5,
	ERemovedReasonType_MAX = 6
};

// Object: Enum Solarland.EDeathType
enum class EDeathType : uint8_t
{
	Dying = 0,
	Death = 1,
	EDeathType_MAX = 2
};

// Object: Enum Solarland.EHeroPickStage
enum class EHeroPickStage : uint8_t
{
	Default = 0,
	WaitingToStartPick = 1,
	PlayerSelecting = 2,
	WaitingToEnd = 3,
	TeamShow = 4,
	End = 5,
	EHeroPickStage_MAX = 6
};

// Object: Enum Solarland.ESDMPlayerState
enum class ESDMPlayerState : uint8_t
{
	NotInitialized = 0,
	WarmUp = 1,
	BattlePreparation = 2,
	WaitForRevive = 3,
	ReviveInvincible = 4,
	InBattle = 5,
	ESDMPlayerState_MAX = 6
};

// Object: Enum Solarland.ECompensationTiming
enum class ECompensationTiming : uint8_t
{
	NONE = 0,
	PostInfiniteRevival = 1,
	KnockDown = 2,
	Kill = 3,
	EliminateOtherTeam = 4,
	ECompensationTiming_MAX = 5
};

// Object: Enum Solarland.ECameraAmplitudeType
enum class ECameraAmplitudeType : uint8_t
{
	Type1 = 0,
	Type2 = 1,
	ECameraAmplitudeType_MAX = 2
};

// Object: Enum Solarland.EHPBarType
enum class EHPBarType : uint8_t
{
	Off = 0,
	OnlyCharacter = 1,
	All = 2,
	EHPBarType_MAX = 3
};

// Object: Enum Solarland.ESolarSkillTriggerMode
enum class ESolarSkillTriggerMode : uint8_t
{
	OnRelease = 0,
	DoubleClick = 1,
	ESolarSkillTriggerMode_MAX = 2
};

// Object: Enum Solarland.ESolarVaultSensitivityMode
enum class ESolarVaultSensitivityMode : uint8_t
{
	Low = 0,
	Medium = 1,
	High = 2,
	Custom = 3,
	ESolarVaultSensitivityMode_MAX = 4
};

// Object: Enum Solarland.EHitTraceDisPlayMode
enum class EHitTraceDisPlayMode : uint8_t
{
	Vector2D = 0,
	Vector3D = 1,
	Both = 2,
	EHitTraceDisPlayMode_MAX = 3
};

// Object: Enum Solarland.EBasicSettingBool
enum class EBasicSettingBool : uint8_t
{
	NotInit = 0,
	Off = 1,
	On = 2,
	EBasicSettingBool_MAX = 3
};

// Object: Enum Solarland.EShowInputTipsType
enum class EShowInputTipsType : uint8_t
{
	HideAll = 0,
	ShowBtn = 1,
	ShowAll = 2,
	EShowInputTipsType_MAX = 3
};

// Object: Enum Solarland.ESolarEnhanceOutlineMode
enum class ESolarEnhanceOutlineMode : uint8_t
{
	ExtraOutline = 0,
	InnerGlow = 1,
	OuterGlow = 2,
	ESolarEnhanceOutlineMode_MAX = 3
};

// Object: Enum Solarland.ESolarDamageTextDisplayModeType
enum class ESolarDamageTextDisplayModeType : uint8_t
{
	DamageTextDisplayMode_Off = 0,
	DamageTextDisplayMode_Stacked = 1,
	DamageTextDisplayMode_Floating = 2,
	DamageTextDisplayMode_Combined = 3,
	DamageTextDisplayMode_MAX = 4
};

// Object: Enum Solarland.ESolarGyroscopeChooseType
enum class ESolarGyroscopeChooseType : uint8_t
{
	DefaultGyroscope = 0,
	ALWAYS = 1,
	FOCUS = 2,
	NEVER = 3,
	ESolarGyroscopeChooseType_MAX = 4
};

// Object: Enum Solarland.ESolarChatOperatorType
enum class ESolarChatOperatorType : uint8_t
{
	All = 0,
	Team = 1,
	Off = 2,
	BattleGround = 3,
	ESolarChatOperatorType_MAX = 4
};

// Object: Enum Solarland.EWheeledVehicleDriveUserType
enum class EWheeledVehicleDriveUserType : uint8_t
{
	DirectionalInput = 0,
	SteeringInput = 1,
	JoyStickInput = 2,
	EWheeledVehicleDriveUserType_MAX = 3
};

// Object: Enum Solarland.ECrosshairBulletVisibilityMode
enum class ECrosshairBulletVisibilityMode : uint8_t
{
	Off = 0,
	OnlyHipFire = 1,
	Always = 2,
	ECrosshairBulletVisibilityMode_MAX = 3
};

// Object: Enum Solarland.ESolarSoundVisualMode
enum class ESolarSoundVisualMode : uint8_t
{
	Close = 0,
	Tile = 1,
	Stretch = 2,
	Around = 3,
	ESolarSoundVisualMode_MAX = 4
};

// Object: Enum Solarland.EOpenScopeMode
enum class EOpenScopeMode : uint8_t
{
	Immediate = 0,
	Complete = 1,
	Gradual = 2,
	EOpenScopeMode_MAX = 3
};

// Object: Enum Solarland.ESolarSensitiveLevel
enum class ESolarSensitiveLevel : uint8_t
{
	Low = 0,
	Medium = 1,
	High = 2,
	Custom = 3,
	ESolarSensitiveLevel_MAX = 4
};

// Object: Enum Solarland.ESolarTouchAccMode
enum class ESolarTouchAccMode : uint8_t
{
	Velocity = 0,
	Constant = 1,
	ESolarTouchAccMode_MAX = 2
};

// Object: Enum Solarland.ESolarShakeMainType
enum class ESolarShakeMainType : uint8_t
{
	OFF = 0,
	LOW = 1,
	MEDIUM = 2,
	HIGH = 3,
	ESolarShakeMainType_MAX = 4
};

// Object: Enum Solarland.ESolarAudioMode
enum class ESolarAudioMode : uint8_t
{
	PushToTalk = 0,
	FreeToTalk = 1,
	ESolarAudioMode_MAX = 2
};

// Object: Enum Solarland.ESolarSoundQuality
enum class ESolarSoundQuality : uint8_t
{
	NotInit = 0,
	Low = 1,
	High = 2,
	Ultra = 3,
	ESolarSoundQuality_MAX = 4
};

// Object: Enum Solarland.ESolarWeaponBreakReloadMode
enum class ESolarWeaponBreakReloadMode : uint8_t
{
	Disable = 0,
	FirePress = 1,
	ReloadPress = 2,
	Mixed = 3,
	ESolarWeaponBreakReloadMode_MAX = 4
};

// Object: Enum Solarland.ESolarWeaponDoScopeMode
enum class ESolarWeaponDoScopeMode : uint8_t
{
	Click = 0,
	Press = 1,
	Mixed = 2,
	ESolarWeaponDoScopeMode_MAX = 3
};

// Object: Enum Solarland.ESolarVibrationType
enum class ESolarVibrationType : uint8_t
{
	Off = 0,
	On = 1,
	Extension = 2,
	ESolarVibrationType_MAX = 3
};

// Object: Enum Solarland.EGamepadAssistAimMode
enum class EGamepadAssistAimMode : uint8_t
{
	Default = 0,
	Precise = 1,
	Off = 2,
	EGamepadAssistAimMode_MAX = 3
};

// Object: Enum Solarland.ESolarWheelModeType
enum class ESolarWheelModeType : uint8_t
{
	Default = 0,
	Click = 1,
	Release = 2,
	ESolarWheelModeType_MAX = 3
};

// Object: Enum Solarland.ESolarSprintModeType
enum class ESolarSprintModeType : uint8_t
{
	Default = 0,
	Pressing = 1,
	Toggle = 2,
	Auto = 3,
	ESolarSprintModeType_MAX = 4
};

// Object: Enum Solarland.ESolarGraphicsQualityLevel
enum class ESolarGraphicsQualityLevel : uint8_t
{
	ESGQL_Invalid = 0,
	ESGQL_Level1 = 1,
	ESGQL_Level2 = 2,
	ESGQL_Level3 = 3,
	ESGQL_Level4 = 4,
	ESGQL_Level5 = 5,
	ESGQL_Level6 = 6,
	ESGQL_Level7 = 7,
	ESGQL_VALUE_MIN = 8,
	ESGQL_VALUE_MAX = 9,
	ESGQL_MAX = 10
};

// Object: Enum Solarland.ESolarGraphicsQualityGroup
enum class ESolarGraphicsQualityGroup : uint8_t
{
	ESGQG_SolarCustomGraphicsSettingsGroup = 0,
	ESGQG_SolarSceneDetailQualityGroup = 1,
	ESGQG_SolarSSRQualityGroup = 2,
	ESGQG_SolarShadowQualityGroup = 3,
	ESGQG_SolarAOQualityGroup = 4,
	ESGQG_SolarSSGIQualityGroup = 5,
	ESGQG_SolarStreamingQualityGroup = 6,
	ESGQG_SolarTextureQualityGroup = 7,
	ESGQG_SolarPostprocessQualityGroup = 8,
	ESGQG_SolarViewDistanceQualityGroup = 9,
	ESGQG_SolarShadingQualityGroup = 10,
	ESGQG_SolarAnimationQualityGroup = 11,
	ESGQG_SolarParticleQualityGroup = 12,
	ESGQG_SubGroupBegin = 13,
	ESGQG_SubGroupEnd = 14,
	ESGQG_GroupNum = 15,
	ESGQG_MAX = 16
};

// Object: Enum Solarland.EFileDownloadError
enum class EFileDownloadError : uint8_t
{
	None = 0,
	ConnectFailed = 1,
	RequestHeadFailed = 2,
	CreateFileFailed = 3,
	DownloadFailed = 4,
	WriteFailed = 5,
	DeleteOldFailed = 6,
	MoveFailed = 7,
	HashCheckFailed = 8,
	EFileDownloadError_MAX = 9
};

// Object: Enum Solarland.EDownloadFailedStep
enum class EDownloadFailedStep : uint8_t
{
	DownloadServerListFailed = 0,
	DownloadPakListFailed = 1,
	DownloadPakFileFailed = 2,
	MountPakFileFailed = 3,
	EDownloadFailedStep_MAX = 4
};

// Object: Enum Solarland.EBuffEffectTagType
enum class EBuffEffectTagType : uint8_t
{
	None = 0,
	TopHalfPart = 1,
	BottomHalfPart = 2,
	TwoSidePart = 3,
	BorderPart = 4,
	FullPart = 5,
	EBuffEffectTagType_MAX = 6
};

// Object: Enum Solarland.ESolarTablesEnum_InputTriggerType
enum class ESolarTablesEnum_InputTriggerType : uint8_t
{
	InputTriggerPressed = 0,
	InputTriggerTap = 1,
	InputTriggerDoubleTap = 2,
	InputTriggerHold = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Object: Enum Solarland.ESolarTablesEnum_InputActionType
enum class ESolarTablesEnum_InputActionType : uint8_t
{
	Action = 0,
	Axis = 1,
	_Count = 2,
	ESolarTablesEnum_MAX = 3
};

// Object: Enum Solarland.ESolarTablesEnum_GamepadInputPolicy
enum class ESolarTablesEnum_GamepadInputPolicy : uint8_t
{
	GamepadInputEasy = 0,
	GamepadInputPro = 1,
	_Count = 2,
	ESolarTablesEnum_MAX = 3
};

// Object: Enum Solarland.ESpecialItemID
enum class ESpecialItemID : uint8_t
{
	NONE = 0,
	CARIRIDGE_BAG = 1,
	BANDAGE = 2,
	REVIVE_ITEM = 3,
	RADAR_SCANNER = 4,
	SHIELD_RECHARGER = 5,
	SHIELD_BIG_RECHARGER = 6,
	AMMO_SMG = 7,
	AMMO_RIFLE = 8,
	AMMO_SNIPER = 9,
	AMMO_SHOTGUN = 10,
	SHIELD_UPGRADE_MATERIAL = 11,
	EXP_ITEM = 12,
	EXP_ITEM2 = 13,
	EXP_ITEM3 = 14,
	TACTICAL_BOX = 15,
	TACTICAL_BOX_HIGH = 16,
	TACTICAL_BOX3 = 17,
	TACTICAL_BOX4 = 18,
	TACTICAL_BOX5 = 19,
	BASIC_ENHANCER_BACKPACK = 20,
	BASIC_HELMET = 21,
	AIRDROPBOX = 22,
	SUMMON_AIRDROP_ID = 23,
	TE_FALCONEYEPIECE = 24,
	TE_CUTTLEFISHVEST = 25,
	TE_MEDICALMASK = 26,
	TE_FLASHFLYWHEEL = 27,
	TE_ENHANCEDPACEMAKER = 28,
	SUMMON_DEATHBOX_ID = 29,
	SHIP_KEYCARD = 30,
	FACTORY_KEYCARD = 31,
	ESpecialItemID_MAX = 32
};

// Object: Enum Solarland.EPlayerNamePanelScale
enum class EPlayerNamePanelScale : uint8_t
{
	ExtraSmallSize = 0,
	SmallSize = 1,
	DefaultSize = 2,
	LargeSize = 3,
	ExtraLargeSize = 4,
	EPlayerNamePanelScale_MAX = 5
};

// Object: Enum Solarland.EBattleOBHUDType
enum class EBattleOBHUDType : uint8_t
{
	None = 0,
	SpectatePlayer = 1,
	FreeView = 2,
	FreeLookAt = 3,
	Director = 4,
	EBattleOBHUDType_MAX = 5
};

// Object: Enum Solarland.EOBPlayerHeadInfoWidgetStyle
enum class EOBPlayerHeadInfoWidgetStyle : uint8_t
{
	NearMode = 0,
	MiddleMode = 1,
	FarMode = 2,
	MAX = 3
};

// Object: Enum Solarland.EMoveMode
enum class EMoveMode : uint8_t
{
	E_Stop = 0,
	E_Direction = 1,
	E_TargetPos = 2,
	E_MAX = 3
};

// Object: Enum Solarland.EActionWheelCommandType
enum class EActionWheelCommandType : uint8_t
{
	None = 0,
	UseItem = 1,
	WorldMark = 2,
	UseSticker = 3,
	PlayAnimation = 4,
	PlaySound = 5,
	Unassigned = 6,
	UseBuddyBall = 7,
	QuickCommunication = 8,
	FabricationDevice = 9,
	EActionWheelCommandType_MAX = 10
};

// Object: Enum Solarland.EActionWheelItemType
enum class EActionWheelItemType : uint8_t
{
	Normal = 0,
	Empty = 1,
	Disable = 2,
	EActionWheelItemType_MAX = 3
};

// Object: Enum Solarland.EActionWheelStyleType
enum class EActionWheelStyleType : uint8_t
{
	TextOnly = 0,
	IconOnly = 1,
	IconAndText = 2,
	EActionWheelStyleType_MAX = 3
};

// Object: Enum Solarland.EActionWheelStyleCount
enum class EActionWheelStyleCount : uint8_t
{
	Disabled = 0,
	TxtNumber = 1,
	TxtCount = 2,
	EActionWheelStyleCount_MAX = 3
};

// Object: Enum Solarland.EActionWheelPreSelectType
enum class EActionWheelPreSelectType : uint8_t
{
	None = 0,
	Fixed = 1,
	Dynamic = 2,
	EActionWheelPreSelectType_MAX = 3
};

// Object: Enum Solarland.EActionWheelOperateType
enum class EActionWheelOperateType : uint8_t
{
	NeedClick = 0,
	AutoCommand = 1,
	EActionWheelOperateType_MAX = 2
};

// Object: Enum Solarland.EActionWheelTriggerMode
enum class EActionWheelTriggerMode : uint8_t
{
	Tap = 0,
	Hold = 1,
	EActionWheelTriggerMode_MAX = 2
};

// Object: Enum Solarland.ESolarInteractToggleState
enum class ESolarInteractToggleState : uint8_t
{
	None = 0,
	OnState = 1,
	OffState = 2,
	ESolarInteractToggleState_MAX = 3
};

// Object: Enum Solarland.EBackpackOperationType
enum class EBackpackOperationType : uint8_t
{
	None = 0,
	Discard = 1,
	DiscardAll = 2,
	Use = 3,
	Equip = 4,
	Remove = 5,
	Transfer = 6,
	LongPressDiscard = 7,
	RefreshWeapon = 8,
	EBackpackOperationType_MAX = 9
};

// Object: Enum Solarland.EItemQualityType
enum class EItemQualityType : uint8_t
{
	None = 0,
	White = 1,
	Green = 2,
	Blue = 3,
	Purple = 4,
	Orange = 5,
	Red = 6,
	Gold = 7,
	EItemQualityType_MAX = 8
};

// Object: Enum Solarland.EWeaponPartSlotMode
enum class EWeaponPartSlotMode : uint8_t
{
	Empty = 0,
	Exist = 1,
	ShowOnly = 2,
	EWeaponPartSlotMode_MAX = 3
};

// Object: Enum Solarland.ETipsStyleType
enum class ETipsStyleType : uint8_t
{
	None = 0,
	NormalItem = 1,
	PokeBall = 2,
	BackpackSlot = 3,
	ETipsStyleType_MAX = 4
};

// Object: Enum Solarland.ETipsInputPreset
enum class ETipsInputPreset : uint8_t
{
	None = 0,
	PokeBallBackpack = 1,
	PokeBallPassive = 2,
	PokeBallActive = 3,
	Consumable = 4,
	Pickup = 5,
	PickupReplace = 6,
	PickupEquip = 7,
	Equipment = 8,
	Bullet = 9,
	Weapon = 10,
	BackpackWeaponPart = 11,
	EquippedWeaponPart = 12,
	KeyCard = 13,
	PickupWeapon = 14,
	HeroCore = 15,
	TacticalEquipment = 16,
	ETipsInputPreset_MAX = 17
};

// Object: Enum Solarland.EWorldMarkStateType
enum class EWorldMarkStateType : uint8_t
{
	MarkBySelf = 0,
	MarkByOther = 1,
	ResponseBySelf = 2,
	ResponseByOther = 3,
	None = 4,
	EWorldMarkStateType_MAX = 5
};

// Object: Enum Solarland.EWorldMarkOperationType
enum class EWorldMarkOperationType : uint8_t
{
	Mark = 0,
	CancelMark = 1,
	Response = 2,
	CancelResponse = 3,
	WasResponsedByOther = 4,
	NoOperation = 5,
	EWorldMarkOperationType_MAX = 6
};

// Object: Enum Solarland.EReplayProgressBarHeatType
enum class EReplayProgressBarHeatType : uint8_t
{
	Parachute = 0,
	ResurrectionParachute = 1,
	KillDown = 2,
	MultiKill = 3,
	BeKillDown = 4,
	Death = 5,
	Win = 6,
	Max = 7
};

// Object: Enum Solarland.EUITMMenuInteractType
enum class EUITMMenuInteractType : uint8_t
{
	Switch = 0,
	Click = 1,
	EUITMMenuInteractType_MAX = 2
};

// Object: Enum Solarland.EUITMMenuDesktopType
enum class EUITMMenuDesktopType : uint8_t
{
	Perspective = 0,
	ShootStat = 1,
	AutoPickup = 2,
	OneKeyFullyLevel = 3,
	InfiniteAmmo = 4,
	InfiniteSkill = 5,
	OneKeyReset = 6,
	BotPatrol = 7,
	EUITMMenuDesktopType_MAX = 8
};

// Object: Enum Solarland.EWeaponAutoLockSocketWidgetAnimationType
enum class EWeaponAutoLockSocketWidgetAnimationType : uint8_t
{
	None = 0,
	Enter = 1,
	Loop = 2,
	Exit = 3,
	EWeaponAutoLockSocketWidgetAnimationType_MAX = 4
};

// Object: Enum Solarland.ECustomGameModeTypeForUI
enum class ECustomGameModeTypeForUI : uint8_t
{
	Type_Default = 0,
	Type_Sabotage = 1,
	Type_MAX = 2
};

// Object: Enum Solarland.EAccelerateParticleType
enum class EAccelerateParticleType : uint8_t
{
	Spawn = 0,
	Destroy = 1,
	EAccelerateParticleType_MAX = 2
};

// Object: Enum Solarland.EActionAnimState
enum class EActionAnimState : uint8_t
{
	None = 0,
	Playing = 1,
	Failed = 2,
	NodeEnded = 3,
	TimeEnded = 4,
	NodeAborted = 5,
	InternalAborted = 6,
	ExternalAborted = 7,
	MontageBendOut = 8,
	MontageInterrupted = 9,
	EActionAnimState_MAX = 10
};

// Object: Enum Solarland.EMeshRelativeTransformType
enum class EMeshRelativeTransformType : uint8_t
{
	RelativeToActor = 0,
	RelativeToProjectileStopped = 1,
	EMeshRelativeTransformType_MAX = 2
};

// Object: Enum Solarland.ESpawnParticleType
enum class ESpawnParticleType : uint8_t
{
	ActorRelativeLocation = 0,
	AttachToMesh = 1,
	ESpawnParticleType_MAX = 2
};

// Object: Enum Solarland.EUpdateAreaBehavior
enum class EUpdateAreaBehavior : uint8_t
{
	Accumulate_Sep_NotReset = 0,
	Accumulate_All_NotReset = 1,
	Accumulate_Sep_Reset = 2,
	Accumulate_All_Reset = 3,
	Accumulate_MAX = 4
};

// Object: Enum Solarland.EActionAreaNodeDetectPolicy
enum class EActionAreaNodeDetectPolicy : uint8_t
{
	None = 0,
	DetectEnemy = 1,
	EActionAreaNodeDetectPolicy_MAX = 2
};

// Object: Enum Solarland.EActionNodeInstancingPolicy
enum class EActionNodeInstancingPolicy : uint8_t
{
	NonInstanced = 0,
	InstancedPerActor = 1,
	InstancedPerExecution = 2,
	EActionNodeInstancingPolicy_MAX = 3
};

// Object: Enum Solarland.ActionNodeStage
enum class EActionNodeStage : uint8_t
{
	SectionStage_1 = 0,
	SectionStage_2 = 1,
	SectionStage_3 = 2,
	SectionStage_4 = 3,
	SectionStage_5 = 4,
	SectionStage_6 = 5,
	SectionStage_7 = 6,
	SectionStage_8 = 7,
	SectionStage_MAX = 8
};

// Object: Enum Solarland.EActionBuffType
enum class EActionBuffType : uint8_t
{
	Team = 0,
	Enemy = 1,
	Self = 2,
	EActionBuffType_MAX = 3
};

// Object: Enum Solarland.EActionNodeType
enum class EActionNodeType : uint8_t
{
	Both = 0,
	Server = 1,
	Client = 2,
	EActionNodeType_MAX = 3
};

// Object: Enum Solarland.EWheelGroupType
enum class EWheelGroupType : uint8_t
{
	None = 0,
	ItemWheelPC = 1,
	SocialWheelPC = 2,
	ItemWheelMobile = 3,
	BuddyWheelPC = 4,
	WordMarkWheel = 5,
	BuddyWheelMobile = 6,
	QuickCommunication = 7,
	QuickCommunication_DeathVerge = 8,
	QuickCommunication_Dead = 9,
	EWheelGroupType_MAX = 10
};

// Object: Enum Solarland.EMatchReviewType
enum class EMatchReviewType : uint8_t
{
	None = 0,
	BattleStart = 1,
	BattleEnd = 2,
	BattleWin = 3,
	PlayerKill = 4,
	BeHitDown = 5,
	BeKilled = 6,
	SystemKill = 7,
	BeRevived = 9,
	EMatchReviewType_MAX = 10
};

// Object: Enum Solarland.EActivationDamageSourceType
enum class EActivationDamageSourceType : uint8_t
{
	None = 0,
	Weapon = 1,
	Vehicle = 2,
	SummonWeapon = 3,
	TacticalAbility = 4,
	UltimateAbility = 5,
	Melee = 6,
	EActivationDamageSourceType_MAX = 7
};

// Object: Enum Solarland.EActorMaterialChangeRebuildReason
enum class EActorMaterialChangeRebuildReason : uint8_t
{
	OriginalMeshChanged = 0,
	MeshAddedOrRemoved = 1,
	EActorMaterialChangeRebuildReason_MAX = 2
};

// Object: Enum Solarland.EMultiplePassMaterialChangeCompatibilityMode
enum class EMultiplePassMaterialChangeCompatibilityMode : uint8_t
{
	Compatible = 0,
	Incompatible = 1,
	CompatibleWithSpecifiedPriorityTags = 2,
	IncompatibleWithSpecifiedPriorityTags = 3,
	EMultiplePassMaterialChangeCompatibilityMode_MAX = 4
};

// Object: Enum Solarland.EMaterialChangeMaterialLimitationType
enum class EMaterialChangeMaterialLimitationType : uint8_t
{
	None = 0,
	Include = 1,
	Exclude = 2,
	EMaterialChangeMaterialLimitationType_MAX = 3
};

// Object: Enum Solarland.EMaterialChangeTextureOverrideMode
enum class EMaterialChangeTextureOverrideMode : uint8_t
{
	None = 0,
	OverrideAllTextures = 1,
	OverrideSpecifiedTextures = 2,
	EMaterialChangeTextureOverrideMode_MAX = 3
};

// Object: Enum Solarland.EMaterialChangeConflictResolveStrategy
enum class EMaterialChangeConflictResolveStrategy : uint8_t
{
	KeepAll = 0,
	KeepNew = 1,
	KeepOld = 2,
	EMaterialChangeConflictResolveStrategy_MAX = 3
};

// Object: Enum Solarland.EMaterialParameterTypeFlags
enum class EMaterialParameterTypeFlags : uint8_t
{
	None = 0,
	Scaler = 1,
	Vector = 2,
	Texture = 3,
	Font = 4,
	AllWithoutFont = 5,
	All = 6,
	EMaterialParameterTypeFlags_MAX = 7
};

// Object: Enum Solarland.EMaterialParameterType2
enum class EMaterialParameterType2 : uint8_t
{
	Scaler = 0,
	Vector = 1,
	Texture = 2,
	Font = 3,
	EMaterialParameterType2_MAX = 4
};

// Object: Enum Solarland.EMaterialChangeType
enum class EMaterialChangeType : uint8_t
{
	Normal = 0,
	MultiplePass = 1,
	EMaterialChangeType_MAX = 2
};

// Object: Enum Solarland.EActorParticleEffectAttachOption
enum class EActorParticleEffectAttachOption : uint8_t
{
	None = 0,
	AttachToActor = 1,
	AttachToMesh = 2,
	WorldLocation = 3,
	EActorParticleEffectAttachOption_MAX = 4
};

// Object: Enum Solarland.EOperator
enum class EOperator : uint8_t
{
	IDLE = 0,
	ADD = 1,
	MINUS = 2,
	CANCEL = 3,
	EOperator_MAX = 4
};

// Object: Enum Solarland.EBulletTraceTargetType
enum class EBulletTraceTargetType : uint8_t
{
	None = 0,
	Character = 1,
	Vehicle = 4,
	SummonItem = 8,
	EBulletTraceTargetType_MAX = 9
};

// Object: Enum Solarland.EBounceType
enum class EBounceType : uint8_t
{
	NONE = 0,
	ONCE = 1,
	STICK = 2,
	MAX = 3
};

// Object: Enum Solarland.ETriggerType
enum class ETriggerType : uint8_t
{
	KEY_DOWN = 0,
	KEY_UP = 1,
	KEY_HOLD = 2,
	MAX = 3
};

// Object: Enum Solarland.EHoldActionType
enum class EHoldActionType : uint8_t
{
	HT_Charge = 0,
	HT_Projectile = 1,
	HT_None = 2,
	HT_MAX = 3
};

// Object: Enum Solarland.ETrajectoryType
enum class ETrajectoryType : uint8_t
{
	LINE = 0,
	LINE_GRAVITY = 1,
	CURVE = 2,
	CANISTER = 3,
	BEAM = 4,
	Rocket = 5,
	VirtualBullet = 6,
	MAX = 7
};

// Object: Enum Solarland.EWeaponSkillChargedState
enum class EWeaponSkillChargedState : uint8_t
{
	PREPARE = 0,
	START = 1,
	COMPLETECHARGE = 2,
	EXECUTE = 3,
	EWeaponSkillChargedState_MAX = 4
};

// Object: Enum Solarland.EFireMethodType
enum class EFireMethodType : uint8_t
{
	BULLET = 0,
	SKILL = 1,
	SUMMONBULLET = 2,
	MAX = 3
};

// Object: Enum Solarland.ECostFireType
enum class ECostFireType : uint8_t
{
	DESCRETE = 0,
	CONTINUOUS = 1,
	MAX = 2
};

// Object: Enum Solarland.EShootingSoundOpt
enum class EShootingSoundOpt : uint8_t
{
	EShootingSound_SINGLE_1P = 0,
	EShootingSound_SINGLE_3P = 1,
	EShootingSound_SINGLE_3P_ENEMY = 2,
	EShootingSound_AUTO_1P = 3,
	EShootingSound_AUTO_3P = 4,
	EShootingSound_AUTO_3P_ENEMY = 5,
	EShootingSound_BURST_1P = 6,
	EShootingSound_BURST_3P = 7,
	EShootingSound_BURST_3P_ENEMY = 8,
	EShootingSound_FIRE_LAST_1P = 9,
	EShootingSound_FIRE_LAST_3P = 10,
	EShootingSound_SKILL_CAST_1P = 11,
	EShootingSound_SKILL_CAST_3P = 12,
	EShootingSound_LAND_COMMON_HIT_3P = 13,
	EShootingSound_SKILL_FX_START_1P = 14,
	EShootingSound_SKILL_FX_START_3P = 15,
	EShootingSound_SHIELD_HIT_1P = 16,
	EShootingSound_SHIELD_HIT_3P = 17,
	EShootingSound_SHIELD_BROKEN_1P = 18,
	EShootingSound_SHIELD_BROKEN_3P = 19,
	EShootingSound_BODY_HIT_1P = 20,
	EShootingSound_BODY_HIT_3P = 21,
	EShootingSound_FIRE_OVERLOAD_1P = 22,
	EShootingSound_FIRE_OVERLOAD_3P = 23,
	EShootingSound_Fly_Loop = 24,
	EShootingSound_Fly_Once = 25,
	EShootingSound_Vehicle_Gun_On = 26,
	EShootingSound_Vehicle_Gun_Off = 27,
	EShootingSound_Smoke_Loop = 28,
	EShootingSound_Reload_1P_1 = 29,
	EShootingSound_Reload_3P_1 = 30,
	EShootingSound_Reload_1P_2 = 31,
	EShootingSound_Reload_3P_2 = 32,
	EShootingSound_Reload_1P_3 = 33,
	EShootingSound_Reload_3P_3 = 34,
	EShootingSound_Bolt_1P = 35,
	EShootingSound_Bolt_3P = 36,
	EShootingSound_MAX = 37
};

// Object: Enum Solarland.EShootingOpt
enum class EShootingOpt : uint8_t
{
	EShootingOpt_SINGLE = 0,
	EShootingOpt_AUTO = 1,
	EShootingOpt_BURST = 2,
	EShootingOpt_MAX = 3
};

// Object: Enum Solarland.EFootEffectType
enum class EFootEffectType : uint8_t
{
	Effect_None = 0,
	Effect_Water = 1,
	Effect_MAX = 2
};

// Object: Enum Solarland.EPlaySoundGroupWithCooldownRoleType
enum class EPlaySoundGroupWithCooldownRoleType : uint8_t
{
	All = 0,
	LocalPlayerOnly = 1,
	LocalOrSpectatingPlayer = 2,
	EPlaySoundGroupWithCooldownRoleType_MAX = 3
};

// Object: Enum Solarland.EAnimNotifyParticleParam
enum class EAnimNotifyParticleParam : uint8_t
{
	Color = 0,
	CampColor = 1,
	Scalar = 2,
	EAnimNotifyParticleParam_MAX = 3
};

// Object: Enum Solarland.ESkillMontageLoopEffectType
enum class ESkillMontageLoopEffectType : uint8_t
{
	Particle = 0,
	SkeletalMesh = 1,
	StaticMesh = 2,
	MaterialChange = 3,
	ESkillMontageLoopEffectType_MAX = 4
};

// Object: Enum Solarland.ECommitAbilityTime
enum class ECommitAbilityTime : uint8_t
{
	None = 0,
	Now = 1,
	EndAbility = 2,
	ECommitAbilityTime_MAX = 3
};

// Object: Enum Solarland.EAnimQuickEffectType
enum class EAnimQuickEffectType : uint8_t
{
	E_None = 0,
	E_ApplyBuff = 1,
	E_SpawnRadar = 2,
	E_ApplyEffect = 4,
	E_MAX = 5
};

// Object: Enum Solarland.EMaterialOwnerMeshType
enum class EMaterialOwnerMeshType : uint8_t
{
	CharacterMesh = 0,
	OrnamentMesh = 1,
	EMaterialOwnerMeshType_MAX = 2
};

// Object: Enum Solarland.EChangeWeaponMaterialWeaponMeshFilter
enum class EChangeWeaponMaterialWeaponMeshFilter : uint16_t
{
	None = 0,
	Body = 1,
	Muzzle = 2,
	Scope = 4,
	Clip = 8,
	Grip = 16,
	GunStock = 32,
	Exclusive = 64,
	Exclusive2 = 128,
	All = 255,
	EChangeWeaponMaterialWeaponMeshFilter_MAX = 256
};

// Object: Enum Solarland.EMaterialAnimNotifyStateEndingBehavior
enum class EMaterialAnimNotifyStateEndingBehavior : uint8_t
{
	ResetToDefault = 0,
	KeepCurrent = 1,
	EMaterialAnimNotifyStateEndingBehavior_MAX = 2
};

// Object: Enum Solarland.EFacialMontageType
enum class EFacialMontageType : uint8_t
{
	None = 0,
	Idle_02 = 1,
	EFacialMontageType_MAX = 2
};

// Object: Enum Solarland.ESpeedLoaderReloadAnimType
enum class ESpeedLoaderReloadAnimType : uint8_t
{
	Reload2Hand = 0,
	TacticalReload2Hand = 1,
	Reload1Hand = 2,
	TacticalReload1Hand = 3,
	ESpeedLoaderReloadAnimType_MAX = 4
};

// Object: Enum Solarland.ESwitchNotifyTriggerMode
enum class ESwitchNotifyTriggerMode : uint8_t
{
	None = 0,
	BlendIn = 1,
	BlendOut = 2,
	All = 3,
	ESwitchNotifyTriggerMode_MAX = 4
};

// Object: Enum Solarland.EMyAnyType
enum class EMyAnyType : uint8_t
{
	Int32 = 0,
	Float = 1,
	Vector = 2,
	None = 3,
	EMyAnyType_MAX = 4
};

// Object: Enum Solarland.EExpressState
enum class EExpressState : uint8_t
{
	None = 0,
	Idle = 1,
	Transfer = 2,
	End = 3,
	EExpressState_MAX = 4
};

// Object: Enum Solarland.EAutoPickupConfigEnum
enum class EAutoPickupConfigEnum : uint8_t
{
	ItemID = 0,
	ItemType = 1,
	EAutoPickupConfigEnum_MAX = 2
};

// Object: Enum Solarland.EBabyBusMontageType
enum class EBabyBusMontageType : uint8_t
{
	Spawn = 0,
	TakeTeammate = 1,
	DropTeammate = 2,
	Recycle = 3,
	EBabyBusMontageType_MAX = 4
};

// Object: Enum Solarland.EBackPackTransitionAnimState
enum class EBackPackTransitionAnimState : uint8_t
{
	TransitionAnimStateDefault = 0,
	SkyCharge2NoCharge_NoFly = 1,
	SkyCharge2NoEnergy_NoFly = 2,
	SkyCharge2NoCharge_Fly = 3,
	SkyCharge2NoEnergy_Fly = 4,
	SkyCharge2NoCharge_IntoFly = 5,
	SkyCharge2NoEnergy_IntoFly = 6,
	NoCharge2SkyCharge_NoFly = 7,
	NoEnergy2SkyCharge_NoFly = 8,
	NoCharge2SkyCharge_Fly = 9,
	NoEnergy2SkyCharge_Fly = 10,
	NoCharge2SkyCharge_OutFly = 11,
	NoEnergy2SkyCharge_OutFly = 12,
	PileCharge2NoCharge_NoFly = 13,
	PileCharge2NoEnergy_NoFly = 14,
	PileCharge2NoCharge_Fly = 15,
	PileCharge2NoEnergy_Fly = 16,
	PileCharge2NoCharge_IntoFly = 17,
	PileCharge2NoEnergy_IntoFly = 18,
	NoCharge2PileCharge_NoFly = 19,
	NoEnergy2PileCharge_NoFly = 20,
	NoCharge2PileCharge_Fly = 21,
	NoEnergy2PileCharge_Fly = 22,
	NoCharge2PileCharge_OutFly = 23,
	NoEnergy2PileCharge_OutFly = 24,
	BoxCharge2NoCharge_NoFly = 25,
	BoxCharge2NoEnergy_NoFly = 26,
	BoxCharge2NoCharge_Fly = 27,
	BoxCharge2NoEnergy_Fly = 28,
	BoxCharge2NoCharge_IntoFly = 29,
	BoxCharge2NoEnergy_IntoFly = 30,
	NoCharge2BoxCharge_NoFly = 31,
	NoEnergy2BoxCharge_NoFly = 32,
	NoCharge2BoxCharge_Fly = 33,
	NoEnergy2BoxCharge_Fly = 34,
	NoCharge2BoxCharge_OutFly = 35,
	NoEnergy2BoxCharge_OutFly = 36,
	NoCharge2NoEnergy_NoFly = 37,
	NoCharge2NoEnergy_IntoFly = 38,
	NoEnergy2NoCharge_NoFly = 39,
	NoEnergy2NoCharge_OutFly = 40,
	EBackPackTransitionAnimState_MAX = 41
};

// Object: Enum Solarland.EBackPackFixedAnimState
enum class EBackPackFixedAnimState : uint8_t
{
	FixedAnimStateDefault = 0,
	FixedSkyChargeNoFly = 1,
	FixedPileChargeNoFly = 2,
	FixedBoxChargeNoFly = 3,
	FixedNoChargeNoFly = 4,
	FixedNoEnergyNoFly = 5,
	FixedSkyChargeIsFly = 6,
	FixedPileChargeIsFly = 7,
	FixedBoxChargeIsFly = 8,
	FixedNoChargeIsFly = 9,
	FixedNoEnergyIsFly = 10,
	EBackPackFixedAnimState_MAX = 11
};

// Object: Enum Solarland.EBackPackAnimSubType
enum class EBackPackAnimSubType : uint8_t
{
	SkyChargeNoFly = 0,
	PileChargeNoFly = 1,
	BoxChargeNoFly = 2,
	NoChargeNoFly = 3,
	NoEnergyNoFly = 4,
	SkyChargeIsFly = 5,
	PileChargeIsFly = 6,
	BoxChargeIsFly = 7,
	NoChargeIsFly = 8,
	NoEnergyIsFly = 9,
	Charge2NoCharge_NoFly = 10,
	Charge2NoEnergy_NoFly = 11,
	Charge2NoCharge_Fly = 12,
	Charge2NoEnergy_Fly = 13,
	Charge2NoCharge_IntoFly = 14,
	Charge2NoEnergy_IntoFly = 15,
	NoCharge2Charge_NoFly = 16,
	NoEnergy2Charge_NoFly = 17,
	NoCharge2Charge_Fly = 18,
	NoEnergy2Charge_Fly = 19,
	NoCharge2Charge_OutFly = 20,
	NoEnergy2Charge_OutFly = 21,
	NoCharge2NoEnergy_NoFly = 22,
	NoCharge2NoEnergy_IntoFly = 23,
	NoEnergy2NoCharge_NoFly = 24,
	NoEnergy2NoCharge_OutFly = 25,
	ETypeDefault = 26,
	EBackPackAnimSubType_MAX = 27
};

// Object: Enum Solarland.EBackPackAnimType
enum class EBackPackAnimType : uint8_t
{
	SkyCharge = 0,
	PileCharge = 1,
	BoxCharge = 2,
	NoCharge = 3,
	NoEnergy = 4,
	NoFly = 5,
	IsFly = 6,
	EBackPackAnimType_MAX = 7
};

// Object: Enum Solarland.EBattleChatButtonState
enum class EBattleChatButtonState : uint8_t
{
	Normal = 0,
	Pressed = 1,
	Clicked = 2,
	EBattleChatButtonState_MAX = 3
};

// Object: Enum Solarland.EProgressStatus
enum class EProgressStatus : uint8_t
{
	Min = 0,
	Max = 1,
	NoChange = 2,
	Increase = 3,
	Decrease = 4
};

// Object: Enum Solarland.EControlPointStatus
enum class EControlPointStatus : uint8_t
{
	None = 0,
	Neutral = 1,
	Owned = 2,
	Enemy = 3,
	EControlPointStatus_MAX = 4
};

// Object: Enum Solarland.EBattlegroundPlayerStartRegion
enum class EBattlegroundPlayerStartRegion : uint8_t
{
	Default = 0,
	Inner = 1,
	Outer = 2,
	EBattlegroundPlayerStartRegion_MAX = 3
};

// Object: Enum Solarland.EBattlegroundMapElementType
enum class EBattlegroundMapElementType : uint8_t
{
	None = 0,
	Home = 1,
	ControlPoint = 2,
	AirWall = 3,
	PlayerStart = 4,
	VehicleSpawner = 5,
	Custom = 6,
	EBattlegroundMapElementType_MAX = 7
};

// Object: Enum Solarland.EScenarioType
enum class EScenarioType : uint8_t
{
	None = 0,
	HUD = 1,
	Deployment = 2,
	WorldMark = 3,
	EScenarioType_MAX = 4
};

// Object: Enum Solarland.EBattleGroundEventType
enum class EBattleGroundEventType : uint8_t
{
	None = 0,
	Stronghold = 1,
	AirDrop = 2,
	EBattleGroundEventType_MAX = 3
};

// Object: Enum Solarland.EEventParamType
enum class EEventParamType : uint8_t
{
	None = 0,
	Lockdown = 1,
	Score = 2,
	EEventParamType_MAX = 3
};

// Object: Enum Solarland.EDeploymentType
enum class EDeploymentType : uint8_t
{
	None = 0,
	AliveTeammate = 1,
	BlueHome = 2,
	RedHome = 3,
	A = 4,
	B = 5,
	C = 6,
	Respawn1 = 7,
	Respawn2 = 8,
	Respawn3 = 9,
	RespawnEnd = 10,
	EDeploymentType_MAX = 11
};

// Object: Enum Solarland.EBGStrongholdType
enum class EBGStrongholdType : uint8_t
{
	Stronghold = 0,
	Birthplace = 1,
	EBGStrongholdType_MAX = 2
};

// Object: Enum Solarland.EStrongholdWidgetType
enum class EStrongholdWidgetType : uint8_t
{
	HUD = 0,
	WorldMark = 1,
	DeploymentHUD = 2,
	DeploymentMapMark = 3,
	MiniMapMark = 4,
	Other = 5,
	EStrongholdWidgetType_MAX = 6
};

// Object: Enum Solarland.EHPProgressBarBoardType
enum class EHPProgressBarBoardType : uint8_t
{
	Normal = 0,
	Self = 1,
	Teammate = 2,
	EHPProgressBarBoardType_MAX = 3
};

// Object: Enum Solarland.EBattlePromptWidgetType
enum class EBattlePromptWidgetType : uint8_t
{
	None = 0,
	DirArrow = 1,
	TypeDetail = 2,
	EBattlePromptWidgetType_MAX = 3
};

// Object: Enum Solarland.EBattleRoyalTimeLineEnum
enum class EBattleRoyalTimeLineEnum : uint8_t
{
	None = 0,
	CreateBombingZone = 1,
	CreateAirdrop = 2,
	ModifyEnvironmentState = 3,
	EBattleRoyalTimeLineEnum_MAX = 4
};

// Object: Enum Solarland.EBattleShipStage
enum class EBattleShipStage : uint8_t
{
	E_None = 0,
	E_Warning = 1,
	E_Fire = 2,
	E_End = 3,
	E_MAX = 4
};

// Object: Enum Solarland.EBattleUpgradeEffectCategory
enum class EBattleUpgradeEffectCategory : uint8_t
{
	None = 0,
	Attack = 1,
	Defence = 2,
	Speed = 3,
	Bag = 4,
	Cooldown = 5,
	PlaceHolder1 = 6,
	PlaceHolder2 = 7,
	PlaceHolder3 = 8,
	PlaceHolder4 = 9,
	EBattleUpgradeEffectCategory_MAX = 10
};

// Object: Enum Solarland.EBotAttrOperator
enum class EBotAttrOperator : uint8_t
{
	Equal = 0,
	Greater = 1,
	Less = 2,
	EBotAttrOperator_MAX = 3
};

// Object: Enum Solarland.EBotAttrValueType
enum class EBotAttrValueType : uint8_t
{
	Current = 0,
	Max = 1,
	Percent = 2
};

// Object: Enum Solarland.EBotAttrType
enum class EBotAttrType : uint8_t
{
	Health = 0,
	Shield = 1,
	Energy = 2,
	HealthAndShield = 3,
	HealthAndShieldLimit = 4,
	ClipAmmo = 5,
	EBotAttrType_MAX = 6
};

// Object: Enum Solarland.EBotCheckCondition
enum class EBotCheckCondition : uint8_t
{
	AlwaysPass = 0,
	ReadyFight = 1,
	CanJetVertical = 2,
	CanJetHorizontal = 3,
	ReadyWeaponSkill = 4,
	IsIndependent = 5,
	NeedReloading = 6,
	EBotCheckCondition_MAX = 7
};

// Object: Enum Solarland.EBotCheckAIServer
enum class EBotCheckAIServer : uint8_t
{
	AlwaysPass = 0,
	AIServerIsOnline = 1,
	EBotCheckAIServer_MAX = 2
};

// Object: Enum Solarland.EBotCheckDirector
enum class EBotCheckDirector : uint8_t
{
	EndGameStage = 0,
	EBotCheckDirector_MAX = 1
};

// Object: Enum Solarland.EBotCheckState
enum class EBotCheckState : uint8_t
{
	None = 0,
	Falling = 1,
	Driving = 2,
	Passager = 3,
	Swiming = 4,
	Dying = 5,
	Dead = 6,
	WeaponReloading = 7,
	ShootAiming = 8,
	SiegeVehicleLocated = 9,
	BeingRescued = 10,
	Cruising = 11,
	Skydiving = 12,
	SkydivingInitially = 13,
	SkydivingAfterRebirth = 14,
	SkydivingByLauncher = 15,
	NewCome = 16,
	EBotCheckState_MAX = 17
};

// Object: Enum Solarland.EDistanceComparison
enum class EDistanceComparison : uint8_t
{
	Equal = 0,
	Greater = 1,
	Less = 2,
	EDistanceComparison_MAX = 3
};

// Object: Enum Solarland.ENgaiCheckAction
enum class ENgaiCheckAction : uint8_t
{
	AlwaysPass = 0,
	DoUseRoleSkill = 1,
	DoUseRoleSkillOne = 2,
	DoUseRoleSkillTwo = 3,
	DoUseRoleSkillThree = 4,
	DoContinueFire = 5,
	DoMoveTo = 6,
	DoUseBuddy = 7,
	ENgaiCheckAction_MAX = 8
};

// Object: Enum Solarland.ENgaiBehavior
enum class ENgaiBehavior : uint8_t
{
	NoBehaviour = 0,
	Looting = 1,
	DeviceRescue = 2,
	DeadBoxRescueOrDyingRescue = 3,
	TeaBag = 4,
	AlwaysPass = 5,
	ENgaiBehavior_MAX = 6
};

// Object: Enum Solarland.EBuddyAnimState
enum class EBuddyAnimState : uint8_t
{
	IdleLoop = 0,
	IdleShow1 = 1,
	IdleShow2 = 2,
	IdleShow3 = 3,
	Max = 4
};

// Object: Enum Solarland.EBuddyBackpackState
enum class EBuddyBackpackState : uint8_t
{
	Normal = 0,
	CoolDown = 1,
	MultiUseCoolDown = 2,
	Forbidden = 3,
	EBuddyBackpackState_MAX = 4
};

// Object: Enum Solarland.EBuddyBallSkillType
enum class EBuddyBallSkillType : uint8_t
{
	Summon = 0,
	Projectile = 1,
	Collect = 2,
	EBuddyBallSkillType_MAX = 3
};

// Object: Enum Solarland.EBuddyBallAnimType
enum class EBuddyBallAnimType : uint8_t
{
	Active = 0,
	Fire = 1,
	Cancel = 2,
	EBuddyBallAnimType_MAX = 3
};

// Object: Enum Solarland.EBuddyState
enum class EBuddyState : uint8_t
{
	CanCollect = 0,
	CollectCooldown = 1,
	Max = 2
};

// Object: Enum Solarland.EBuddyDetailType
enum class EBuddyDetailType : uint8_t
{
	None = 0,
	TimeLord = 1,
	StormQueen = 2,
	BouncingSmoke = 3,
	Exposed = 4,
	Move = 5,
	Pretend = 6,
	Blabbermouth = 7,
	WindField = 8,
	Stealing = 9,
	Scan = 10,
	Max = 11
};

// Object: Enum Solarland.EBuddyBallType
enum class EBuddyBallType : uint8_t
{
	None = 0,
	Vehicle = 1,
	TacticalBuilding = 2,
	Buddy = 3,
	RareBuddy = 4,
	EBuddyBallType_MAX = 5
};

// Object: Enum Solarland.EPreviewBuddyAnimState
enum class EPreviewBuddyAnimState : uint8_t
{
	None = 0,
	PreviewStart = 1,
	PreviewLoop = 2,
	PreviewPreRelease = 3,
	PreviewRelease = 4,
	PreviewCancel = 5,
	EPreviewBuddyAnimState_MAX = 6
};

// Object: Enum Solarland.EBuddyConfigType
enum class EBuddyConfigType : uint8_t
{
	Buddy = 0,
	GeneralSummon = 1,
	EBuddyConfigType_MAX = 2
};

// Object: Enum Solarland.EBuddyEventState
enum class EBuddyEventState : uint8_t
{
	Preview = 0,
	Prepare = 1,
	Show = 2,
	EBuddyEventState_MAX = 3
};

// Object: Enum Solarland.EBuddySpawnSource
enum class EBuddySpawnSource : uint8_t
{
	Normal = 0,
	SpecialBuddy = 1,
	BuddyMachine = 2,
	Invalid = 3,
	EBuddySpawnSource_MAX = 4
};

// Object: Enum Solarland.ESameScreenEffectHandleType
enum class ESameScreenEffectHandleType : uint8_t
{
	Ignore = 0,
	StopPrev = 1,
	ESameScreenEffectHandleType_MAX = 2
};

// Object: Enum Solarland.EBuffEffectDurationType
enum class EBuffEffectDurationType : uint8_t
{
	Instant = 0,
	HasDuration = 1,
	EBuffEffectDurationType_MAX = 2
};

// Object: Enum Solarland.EC4AttachTargetType
enum class EC4AttachTargetType : uint8_t
{
	InHand = 0,
	InAir = 1,
	Normal = 2,
	SmallWoman = 3,
	Woman = 4,
	Man = 5,
	DuckMan = 6,
	EC4AttachTargetType_MAX = 7
};

// Object: Enum Solarland.EC4ProjectileLifeState
enum class EC4ProjectileLifeState : uint8_t
{
	NewlySpawned = 0,
	Throwing = 1,
	Attaching = 2,
	Falling = 3,
	Explode = 4,
	Destroy = 5,
	Invalid = 6,
	EC4ProjectileLifeState_MAX = 7
};

// Object: Enum Solarland.ECameraEffectState
enum class ECameraEffectState : uint8_t
{
	Invalid = 0,
	Suspended = 1,
	Active = 2,
	BlendIn = 3,
	BlendOut = 4,
	ECameraEffectState_MAX = 5
};

// Object: Enum Solarland.EWaterBulletFireState
enum class EWaterBulletFireState : uint8_t
{
	None = 0,
	Begin = 1,
	Stop = 2,
	EWaterBulletFireState_MAX = 3
};

// Object: Enum Solarland.EWaterBulletFireOrder
enum class EWaterBulletFireOrder : uint8_t
{
	Clockwise = 0,
	AntiClockwise = 1,
	EWaterBulletFireOrder_MAX = 2
};

// Object: Enum Solarland.EWaterAreaSource
enum class EWaterAreaSource : uint8_t
{
	CatFish = 0,
	InnerBullet = 1,
	OuterBullet = 2,
	EWaterAreaSource_MAX = 3
};

// Object: Enum Solarland.EWaterBulletGroup
enum class EWaterBulletGroup : uint8_t
{
	InnerCircle = 0,
	OuterCircle = 1,
	EWaterBulletGroup_MAX = 2
};

// Object: Enum Solarland.EUpdatePerformanceType
enum class EUpdatePerformanceType : uint8_t
{
	Kill = 0,
	Assist = 1,
	Death = 2,
	EUpdatePerformanceType_MAX = 3
};

// Object: Enum Solarland.EBattleChatShowSceneType
enum class EBattleChatShowSceneType : uint8_t
{
	None = 0,
	ShowInHeroSelect = 1,
	ShowInGame = 2,
	ShowInSettlement = 3,
	ShowInHeroSelectAndGame = 4,
	ShowInGameAndSettlement = 5,
	ShowInHeroSelectAndSettlement = 6,
	ShowInAll = 7,
	EBattleChatShowSceneType_MAX = 8
};

// Object: Enum Solarland.ELevelLoadType
enum class ELevelLoadType : uint8_t
{
	ClientAntServer = 0,
	ClientOnly = 1,
	ServerOnly = 2,
	ELevelLoadType_MAX = 3
};

// Object: Enum Solarland.EAIDogCancelReason
enum class EAIDogCancelReason : uint8_t
{
	E_SpawnFailed = 0,
	E_None = 1,
	E_MAX = 2
};

// Object: Enum Solarland.EAIDogGAAction
enum class EAIDogGAAction : uint8_t
{
	E_Spawn = 0,
	E_Move = 1,
	E_EnterLongPress = 2,
	E_Reconnect = 3,
	E_MAX = 4
};

// Object: Enum Solarland.EAIDogSkillPhase
enum class EAIDogSkillPhase : uint8_t
{
	E_PhaseSpawn = 0,
	E_PhaseControl = 1,
	E_MAX = 2
};

// Object: Enum Solarland.EDoppelgangerActivePhase
enum class EDoppelgangerActivePhase : uint8_t
{
	Summon = 0,
	Exchange = 1,
	EDoppelgangerActivePhase_MAX = 2
};

// Object: Enum Solarland.EDoppelgangerTargetDataType
enum class EDoppelgangerTargetDataType : uint8_t
{
	ActivePhase = 0,
	SummonInfo = 1,
	EDoppelgangerTargetDataType_MAX = 2
};

// Object: Enum Solarland.EHellStrikeStage
enum class EHellStrikeStage : uint8_t
{
	None = 0,
	FirstStage = 1,
	SecondStage = 2,
	EHellStrikeStage_MAX = 3
};

// Object: Enum Solarland.EHotWheelsPhase
enum class EHotWheelsPhase : uint8_t
{
	E_PreActive = 0,
	E_Activated = 1,
	E_MAX = 2
};

// Object: Enum Solarland.EHotWheelsAction
enum class EHotWheelsAction : uint8_t
{
	E_EndSkill = 0,
	E_EnterSuper = 1,
	E_EndSuper = 2,
	E_ConfirmStartSkill = 3,
	E_CanDashNow = 4,
	E_Reconnect = 5,
	E_StartSkill = 6,
	E_Dash = 7,
	E_SuperDash = 8,
	E_ClientHasError = 9,
	E_MAX = 10
};

// Object: Enum Solarland.EHotWheelsUIState
enum class EHotWheelsUIState : uint8_t
{
	E_Normal = 0,
	E_Dash_Ready = 1,
	E_SuperDash = 2,
	E_MAX = 3
};

// Object: Enum Solarland.ETransientShieldState
enum class ETransientShieldState : uint8_t
{
	None = 0,
	ShieldIncrease = 1,
	ShieldSustain = 2,
	ShieldReduce = 3,
	ETransientShieldState_MAX = 4
};

// Object: Enum Solarland.EActionType
enum class EActionType : uint8_t
{
	E_Call = 0,
	E_Recycle = 1,
	E_MAX = 2
};

// Object: Enum Solarland.EMorphInteractiveItemType
enum class EMorphInteractiveItemType : uint8_t
{
	RespawnDevice = 0,
	UpgradeItemShop = 1,
	AirDrop = 2,
	DeathBox = 3,
	TacticalBox = 4,
	LaunchPad = 5,
	EMorphInteractiveItemType_MAX = 6
};

// Object: Enum Solarland.EMorphObjectType
enum class EMorphObjectType : uint8_t
{
	StaticObject = 0,
	TinyMovingObject = 1,
	InteractiveObject = 2,
	EMorphObjectType_MAX = 3
};

// Object: Enum Solarland.ETransformationMeshType
enum class ETransformationMeshType : uint8_t
{
	Small = 0,
	Middle = 1,
	Large = 2,
	ETransformationMeshType_MAX = 3
};

// Object: Enum Solarland.EVaultTriggerType
enum class EVaultTriggerType : uint8_t
{
	Ground = 0,
	Step = 1,
	Air = 2,
	EVaultTriggerType_MAX = 3
};

// Object: Enum Solarland.EObstacleDetectorType
enum class EObstacleDetectorType : uint8_t
{
	Knee = 0,
	Waist = 1,
	Chest = 2,
	Overhead = 3,
	Nullifier = 7,
	EObstacleDetectorType_MAX = 8
};

// Object: Enum Solarland.EMatActionOnRemoved
enum class EMatActionOnRemoved : uint8_t
{
	None = 0,
	ResetToBeginValue = 1,
	ResetToEndValue = 2,
	EMatActionOnRemoved_MAX = 3
};

// Object: Enum Solarland.EMassInvisibilityRangeType
enum class EMassInvisibilityRangeType : uint8_t
{
	Normal = 0,
	Closed = 1,
	Warning = 2,
	EMassInvisibilityRangeType_MAX = 3
};

// Object: Enum Solarland.ESuperRadarSoundType
enum class ESuperRadarSoundType : uint8_t
{
	E_StartScan = 0,
	E_ConfirmScan = 1,
	E_CancelScan = 2,
	E_JetpackSound = 3,
	E_MAX = 4
};

// Object: Enum Solarland.EFPPEffectType
enum class EFPPEffectType : uint8_t
{
	None = 0,
	ScreenDisplay = 1,
	CameraParticle = 2,
	EFPPEffectType_MAX = 3
};

// Object: Enum Solarland.ETPPEffectType
enum class ETPPEffectType : uint8_t
{
	None = 0,
	ScreenDisplay = 1,
	ActorEffect = 2,
	CameraParticle = 3,
	ETPPEffectType_MAX = 4
};

// Object: Enum Solarland.EBuffEffectType
enum class EBuffEffectType : uint8_t
{
	Both = 0,
	ScreenEffect = 1,
	ActorEffect = 2,
	EBuffEffectType_MAX = 3
};

// Object: Enum Solarland.EActorEffectAffectedActorType
enum class EActorEffectAffectedActorType : uint8_t
{
	CharacterOnly = 0,
	All = 1,
	EActorEffectAffectedActorType_MAX = 2
};

// Object: Enum Solarland.ECueContentVisibleTargetFlag
enum class ECueContentVisibleTargetFlag : uint8_t
{
	None = 0,
	Self = 1,
	Teammate = 2,
	Other = 3,
	Observer = 4,
	CueInstigator = 5,
	CueEffectCauser = 6,
	Anyone = 7,
	ECueContentVisibleTargetFlag_MAX = 8
};

// Object: Enum Solarland.ECueContentPlayTiming
enum class ECueContentPlayTiming : uint8_t
{
	OnExecute = 0,
	OnActive = 1,
	WhileActive = 2,
	OnRemove = 3,
	OnCustomEvent = 4,
	ECueContentPlayTiming_MAX = 5
};

// Object: Enum Solarland.EExecutionCameraTraceTarget
enum class EExecutionCameraTraceTarget : uint8_t
{
	Root = 0,
	Instigator = 1,
	Victim = 2,
	EExecutionCameraTraceTarget_MAX = 3
};

// Object: Enum Solarland.EExecutionAdjustPositionDir
enum class EExecutionAdjustPositionDir : uint8_t
{
	None = 0,
	Forward = 1,
	Back = 2,
	Right = 3,
	Left = 4,
	EExecutionAdjustPositionDir_MAX = 5
};

// Object: Enum Solarland.EFidgetType
enum class EFidgetType : uint8_t
{
	None = 0,
	Fire = 1,
	Movement = 2,
	EFidgetType_MAX = 3
};

// Object: Enum Solarland.EFidgetTrigger
enum class EFidgetTrigger : uint8_t
{
	None = 0,
	Idle = 1,
	JogToIdle = 2,
	SprintToIdle = 3,
	SprintToJog = 4,
	SprintToWalk = 5,
	JogToWalk = 6,
	ViewRotation = 7,
	JumpOnFloor = 8,
	SwitchStandAndCrouch = 9,
	SwitchJogAndWalk = 10,
	Fire = 11,
	ADSFire = 12,
	EFidgetTrigger_MAX = 13
};

// Object: Enum Solarland.EMeleeWeaponMontageType
enum class EMeleeWeaponMontageType : uint8_t
{
	Equip = 0,
	UnEquip = 1,
	QuickEquip = 2,
	QuickUnEquip = 3,
	ViewWeapon = 4,
	StandMelee = 5,
	SprintMelee = 6,
	AirMelee = 7,
	CrouchMelee = 8,
	SlideTackleMelee = 9,
	SpecialMeleeMale = 10,
	SpecialMeleeFemale = 11,
	EMeleeWeaponMontageType_MAX = 12
};

// Object: Enum Solarland.EWeaponMontageType
enum class EWeaponMontageType : uint8_t
{
	Reload = 0,
	Reload_1Hand = 1,
	Reload_Tactical = 2,
	Reload_Tactical_1Hand = 3,
	Bolt = 4,
	Bolt_1Hand = 5,
	FirstEquip = 6,
	FirstEquip_1Hand = 7,
	FirstEquip_NoBolt = 8,
	FirstEquip_NoBolt_1Hand = 9,
	Equip = 10,
	QuickEquip = 11,
	SwitchToSubShootPattern = 12,
	SwitchToDefaultShootPattern = 13,
	ViewWeapon = 14,
	ViewWeaponWithNoAmmo = 15,
	PreFireChargeLevel = 16,
	ReplacePart = 17,
	UnequipPart = 18,
	ReplacePart_1Hand = 19,
	UnequipPart_1Hand = 20,
	FireChargingStart = 21,
	FireChargingStop = 22,
	SwitchToTacticalStance = 23,
	SwitchToDefaultStance = 24,
	EWeaponMontageType_MAX = 25
};

// Object: Enum Solarland.ECharacterIKOffsetType
enum class ECharacterIKOffsetType : uint8_t
{
	NONE = 0,
	ZIPLINE = 1,
	ZIPLINE_VERTICAL = 2,
	RELOAD = 3,
	CATCHOWL = 4,
	SLIDINGRAIL = 5,
	ECharacterIKOffsetType_MAX = 6
};

// Object: Enum Solarland.ECharacterMeshMaterialParameterType
enum class ECharacterMeshMaterialParameterType : uint8_t
{
	Scalar = 0,
	Vector = 1,
	ECharacterMeshMaterialParameterType_MAX = 2
};

// Object: Enum Solarland.ECharacterMeshMaterialChangeType
enum class ECharacterMeshMaterialChangeType : uint8_t
{
	Set = 0,
	Curve = 1,
	ECharacterMeshMaterialChangeType_MAX = 2
};

// Object: Enum Solarland.EHitMontageBySpecialState
enum class EHitMontageBySpecialState : uint8_t
{
	Normal = 0,
	HoldGun = 1,
	EHitMontageBySpecialState_MAX = 2
};

// Object: Enum Solarland.EMoveStopGait
enum class EMoveStopGait : uint8_t
{
	None = 0,
	Sprint = 1,
	EMoveStopGait_MAX = 2
};

// Object: Enum Solarland.EStopAnimType
enum class EStopAnimType : uint8_t
{
	None = 0,
	NoWeaponStop = 1,
	PistolGunStop = 2,
	RifleGunStop = 3,
	BurstRevolverStop = 4,
	EStopAnimType_MAX = 5
};

// Object: Enum Solarland.SpecCyclingAnimType
enum class ESpecCyclingAnimType : uint8_t
{
	Override = 0,
	Additive = 1,
	SpecCyclingAnimType_MAX = 2
};

// Object: Enum Solarland.EUseType
enum class EUseType : uint8_t
{
	NORMAL = 0,
	HANDSETTING = 101,
	EUseType_MAX = 102
};

// Object: Enum Solarland.ECheckCollisionMethod
enum class ECheckCollisionMethod : uint8_t
{
	QueryObject = 0,
	ByProfile = 1,
	ECheckCollisionMethod_MAX = 2
};

// Object: Enum Solarland.EWeaponEquipSlot
enum class EWeaponEquipSlot : uint8_t
{
	None = 0,
	First = 1,
	Second = 2,
	EWeaponEquipSlot_MAX = 3
};

// Object: Enum Solarland.EWeaponSelectionDragDisplayState
enum class EWeaponSelectionDragDisplayState : uint8_t
{
	None = 0,
	Drag = 1,
	Put = 2,
	Swap = 3,
	EWeaponSelectionDragDisplayState_MAX = 4
};

// Object: Enum Solarland.ECollectBuddyAnimState
enum class ECollectBuddyAnimState : uint8_t
{
	Collecting = 0,
	CollectSuccess = 1,
	ECollectBuddyAnimState_MAX = 2
};

// Object: Enum Solarland.ECrossHairState
enum class ECrossHairState : uint8_t
{
	None = 0,
	Normal = 1,
	Reload = 2,
	Overload = 3,
	Forbid = 4,
	ECrossHairState_MAX = 5
};

// Object: Enum Solarland.ESpreadType
enum class ESpreadType : uint8_t
{
	Absolute = 0,
	Relative = 1,
	ESpreadType_MAX = 2
};

// Object: Enum Solarland.ECrossHairSpecialFireState
enum class ECrossHairSpecialFireState : uint8_t
{
	PrepareFire = 0,
	ActivateFire = 1,
	KeepFiring = 2,
	EndFire = 3,
	ECrossHairSpecialFireState_MAX = 4
};

// Object: Enum Solarland.ECurvedEffectControllerStopMode
enum class ECurvedEffectControllerStopMode : uint8_t
{
	KeepCurrentProgress = 0,
	SetProgressToBegin = 1,
	SetProgressToEnd = 2,
	ECurvedEffectControllerStopMode_MAX = 3
};

// Object: Enum Solarland.ECustomNoticeLayer
enum class ECustomNoticeLayer : uint8_t
{
	Normal = 0,
	High = 1,
	Count = 2,
	ECustomNoticeLayer_MAX = 3
};

// Object: Enum Solarland.ECustomRoomSettingTabs
enum class ECustomRoomSettingTabs : uint8_t
{
	None = 0,
	Weapon = 2,
	Vehicle = 3,
	Buddy = 4,
	Advanced = 5,
	ECustomRoomSettingTabs_MAX = 6
};

// Object: Enum Solarland.ECutMaterialProgressType
enum class ECutMaterialProgressType : uint8_t
{
	Spawning = 0,
	Destroying = 1,
	ECutMaterialProgressType_MAX = 2
};

// Object: Enum Solarland.EReviveTeammateWidgetState
enum class EReviveTeammateWidgetState : uint8_t
{
	CanRevive = 0,
	Reviving = 1,
	CanNotRevive = 2,
	EReviveTeammateWidgetState_MAX = 3
};

// Object: Enum Solarland.ERevivePreviewAnimType
enum class ERevivePreviewAnimType : uint8_t
{
	E_None = 0,
	E_GhostUp = 1,
	E_PrintDown = 2,
	E_MAX = 3
};

// Object: Enum Solarland.EExpandWidgetState
enum class EExpandWidgetState : uint8_t
{
	None = 0,
	Normal = 1,
	CanCancel = 2,
	ReCall = 3,
	EExpandWidgetState_MAX = 4
};

// Object: Enum Solarland.ERoleSkillUIState
enum class ERoleSkillUIState : uint8_t
{
	Forbid = 0,
	CDorCost_CanTrigger = 1,
	CDorCost_Disable = 2,
	Select = 3,
	Disable = 4,
	Default = 5,
	None = 6,
	ERoleSkillUIState_MAX = 7
};

// Object: Enum Solarland.ESignalState
enum class ESignalState : uint8_t
{
	Signal_Normal = 0,
	Signal_Weak = 1,
	Signal_Lost = 2,
	None = 3,
	ESignalState_MAX = 4
};

// Object: Enum Solarland.EtttSignalState
enum class EtttSignalState : uint8_t
{
	Signal_Normal = 0,
	Signal_Weak = 1,
	Signal_Lost = 2,
	None = 3,
	EtttSignalState_MAX = 4
};

// Object: Enum Solarland.EEliminateReportType
enum class EEliminateReportType : uint8_t
{
	Empty = 0,
	Dying = 1,
	Dead = 2,
	DeadNoDying = 3,
	EEliminateReportType_MAX = 4
};

// Object: Enum Solarland.EEmbroideredBallState
enum class EEmbroideredBallState : uint8_t
{
	InHand = 0,
	Flying = 1,
	Jump = 2,
	Standby = 3,
	TraceTarget = 4,
	WaitingForExplode = 5,
	BrokenDueToDamage = 6,
	Exploded = 7,
	EEmbroideredBallState_MAX = 8
};

// Object: Enum Solarland.EUseOwnerType
enum class EUseOwnerType : uint8_t
{
	Character = 0,
	Actor = 1,
	EUseOwnerType_MAX = 2
};

// Object: Enum Solarland.EUsePlayerType
enum class EUsePlayerType : uint8_t
{
	Self = 0,
	Teammate = 1,
	Enemy = 2,
	EUsePlayerType_MAX = 3
};

// Object: Enum Solarland.EUseEmojiScene
enum class EUseEmojiScene : uint8_t
{
	None = 0,
	Lobby = 1,
	Battle = 2,
	EUseEmojiScene_MAX = 3
};

// Object: Enum Solarland.ESolarEMPConnectionState
enum class ESolarEMPConnectionState : uint8_t
{
	None = 0,
	Connecting = 1,
	Connected = 2,
	DisConnecting = 3,
	ESolarEMPConnectionState_MAX = 4
};

// Object: Enum Solarland.ESolarEMPFieldState
enum class ESolarEMPFieldState : uint8_t
{
	None = 0,
	Explode = 1,
	Generate = 2,
	Active = 3,
	End = 4,
	Destroy = 5,
	ESolarEMPFieldState_MAX = 6
};

// Object: Enum Solarland.EEMPParticleType
enum class EEMPParticleType : uint8_t
{
	Explode = 0,
	ExplodeDelayStage1 = 1,
	ExplodeDelayStage2 = 2,
	Generate = 3,
	FadeIn = 4,
	Loop = 5,
	FadeOut = 6,
	EEMPParticleType_MAX = 7
};

// Object: Enum Solarland.ESolarEMPSummonConnectionState
enum class ESolarEMPSummonConnectionState : uint8_t
{
	None = 0,
	Connecting = 1,
	Connected = 2,
	DisConnecting = 3,
	ESolarEMPSummonConnectionState_MAX = 4
};

// Object: Enum Solarland.ESolarEMPSummonFieldState
enum class ESolarEMPSummonFieldState : uint8_t
{
	None = 0,
	Explode = 1,
	Generate = 2,
	Active = 3,
	End = 4,
	Destroy = 5,
	ESolarEMPSummonFieldState_MAX = 6
};

// Object: Enum Solarland.EEMPSummonParticleType
enum class EEMPSummonParticleType : uint8_t
{
	Explode = 0,
	Generate = 1,
	FadeIn = 2,
	Loop = 3,
	FadeOut = 4,
	EEMPSummonParticleType_MAX = 5
};

// Object: Enum Solarland.EAnimationStage
enum class EAnimationStage : uint8_t
{
	None = 0,
	FlyToTeammate = 1,
	AppearByTeammate = 2,
	Transferring = 3,
	TransferSuccess = 4,
	TransferredReappearing = 5,
	Hit = 6,
	Death = 7,
	EAnimationStage_MAX = 8
};

// Object: Enum Solarland.EFabricationDevicePoolLoopType
enum class EFabricationDevicePoolLoopType : uint8_t
{
	Forever = 0,
	Day = 1,
	Week = 2,
	Month = 3,
	EFabricationDevicePoolLoopType_MAX = 4
};

// Object: Enum Solarland.EFactionType
enum class EFactionType : uint8_t
{
	Neutral = 0,
	Blue = 1,
	Red = 2,
	EFactionType_MAX = 3
};

// Object: Enum Solarland.EAnimationType
enum class EAnimationType : uint8_t
{
	Overload = 0,
	Overlay = 1,
	EAnimationType_MAX = 2
};

// Object: Enum Solarland.EFollowBuddyAnimState
enum class EFollowBuddyAnimState : uint8_t
{
	None = 0,
	FollowStart = 1,
	FollowLoop = 2,
	FollowToPreview = 3,
	EFollowBuddyAnimState_MAX = 4
};

// Object: Enum Solarland.EFPPParticleType
enum class EFPPParticleType : uint8_t
{
	None = 0,
	FullScreen = 1,
	HalfScreen = 2,
	OnceStart = 3,
	OnceEnd = 4,
	EFPPParticleType_MAX = 5
};

// Object: Enum Solarland.EFPPEmojiHUDType
enum class EFPPEmojiHUDType : uint8_t
{
	None = 0,
	Mobile = 1,
	PC_Self = 2,
	PC_Teammate = 3,
	EFPPEmojiHUDType_MAX = 4
};

// Object: Enum Solarland.EJetAltitudeLimitationMode
enum class EJetAltitudeLimitationMode : uint8_t
{
	Default = 0,
	Home = 1,
	EJetAltitudeLimitationMode_MAX = 2
};

// Object: Enum Solarland.EWeaponVibrateFactor
enum class EWeaponVibrateFactor : uint8_t
{
	Off = 0,
	Low = 10,
	Middle = 20,
	High = 30,
	EWeaponVibrateFactor_MAX = 31
};

// Object: Enum Solarland.EWeaponVibrateType
enum class EWeaponVibrateType : uint8_t
{
	None = 0,
	Fire = 1,
	Reload_GetOld = 2,
	Reload_Restore = 3,
	Bolt = 4,
	Charge = 5,
	EWeaponVibrateType_MAX = 6
};

// Object: Enum Solarland.EGameplayVibrateIntensity
enum class EGameplayVibrateIntensity : uint8_t
{
	Off = 0,
	Low = 10,
	Middle = 20,
	High = 30,
	EGameplayVibrateIntensity_MAX = 31
};

// Object: Enum Solarland.EGameplayVibrateCategory
enum class EGameplayVibrateCategory : uint8_t
{
	None = 0,
	SelfBeingHit = 1,
	SelfJetpackFlying = 2,
	SelfContinuousDamaged = 3,
	TriggerCharacterDown = 4,
	TriggerCharacterDie = 5,
	ActionWheel = 6,
	Jump = 7,
	Land = 8,
	Crouch = 9,
	EGameplayVibrateCategory_MAX = 10
};

// Object: Enum Solarland.EVibrateAssetType
enum class EVibrateAssetType : uint8_t
{
	None = 0,
	Richtap = 1,
	ForceFeedback = 2,
	EVibrateAssetType_MAX = 3
};

// Object: Enum Solarland.EVibrateDeviceType
enum class EVibrateDeviceType : uint8_t
{
	Nonsupport = 0,
	Mobile = 1,
	Gamepad = 2,
	EVibrateDeviceType_MAX = 3
};

// Object: Enum Solarland.EResurrectionLocationSelection
enum class EResurrectionLocationSelection : uint8_t
{
	None = 0,
	FarFromSkyIslandButInSafeArea = 1,
	EResurrectionLocationSelection_MAX = 2
};

// Object: Enum Solarland.ESCMDataGatherType_Settle
enum class ESCMDataGatherType_Settle : uint8_t
{
	None = 0,
	Self = 1,
	Side = 2,
	All = 3,
	ESCMDataGatherType_MAX = 4
};

// Object: Enum Solarland.ESCMDataReplicateType
enum class ESCMDataReplicateType : uint8_t
{
	None = 0,
	RepOwner = 1,
	RepSide = 2,
	RepGlobal = 3,
	ESCMDataReplicateType_MAX = 4
};

// Object: Enum Solarland.ESCMRankCheckType
enum class ESCMRankCheckType : uint8_t
{
	New = 0,
	Change = 1,
	Delete = 2,
	ESCMRankCheckType_MAX = 3
};

// Object: Enum Solarland.ESCMDataSetType
enum class ESCMDataSetType : uint8_t
{
	None = 0,
	Array = 1,
	Map = 2,
	ESCMDataSetType_MAX = 3
};

// Object: Enum Solarland.EGaugeType
enum class EGaugeType : uint8_t
{
	None = 0,
	Degree_360 = 1,
	Degree_180 = 2,
	Degree_90 = 3,
	DownUp = 4,
	LeftRight = 5,
	EGaugeType_MAX = 6
};

// Object: Enum Solarland.EAimOffsetAdjustType
enum class EAimOffsetAdjustType : uint8_t
{
	None = 0,
	AdjustPitch = 1,
	AdjustYaw = 2,
	AdjustBoth = 3,
	EAimOffsetAdjustType_MAX = 4
};

// Object: Enum Solarland.EPlayerWeaponLODEquipState
enum class EPlayerWeaponLODEquipState : uint8_t
{
	Backpack = 0,
	Hold = 1,
	OpenScope = 2,
	Discard = 3,
	EPlayerWeaponLODEquipState_MAX = 4
};

// Object: Enum Solarland.EMobileAALevel
enum class EMobileAALevel : uint16_t
{
	Off = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	Invalid = 255,
	EMobileAALevel_MAX = 256
};

// Object: Enum Solarland.ESolarXeSSQualityMode
enum class ESolarXeSSQualityMode : uint16_t
{
	Off = 0,
	UltraPerformance = 1,
	Performance = 2,
	Balanced = 3,
	Quality = 4,
	Invalid = 255,
	ESolarXeSSQualityMode_MAX = 256
};

// Object: Enum Solarland.ESolarFSR3Quality
enum class ESolarFSR3Quality : uint16_t
{
	Off = 0,
	UltraPerformance = 1,
	Performance = 2,
	Balanced = 3,
	Quality = 4,
	Invalid = 255,
	ESolarFSR3Quality_MAX = 256
};

// Object: Enum Solarland.ESolarFSR2Quality
enum class ESolarFSR2Quality : uint16_t
{
	Off = 0,
	Quality = 1,
	Balanced = 2,
	Performance = 3,
	UltraPerformance = 4,
	Invalid = 255,
	ESolarFSR2Quality_MAX = 256
};

// Object: Enum Solarland.ESolarFrameGenLevel
enum class ESolarFrameGenLevel : uint16_t
{
	Off = 0,
	Gen2X = 1,
	Gen3X = 2,
	Gen4X = 3,
	Invalid = 255,
	ESolarFrameGenLevel_MAX = 256
};

// Object: Enum Solarland.ESolarDLSSQuality
enum class ESolarDLSSQuality : uint16_t
{
	Off = 0,
	Auto = 1,
	UltraQuality = 2,
	Quality = 3,
	Balanced = 4,
	Performance = 5,
	Invalid = 255,
	ESolarDLSSQuality_MAX = 256
};

// Object: Enum Solarland.ESolarScreenPercentageLevel
enum class ESolarScreenPercentageLevel : uint8_t
{
	Default = 0,
	Percent25 = 1,
	Percent50 = 2,
	Percent75 = 3,
	Percent100 = 4,
	VALUE_MIN = 5,
	VALUE_MAX = 6,
	Invalid = 7,
	ESolarScreenPercentageLevel_MAX = 8
};

// Object: Enum Solarland.ESolarAnisotropicFilterLevel
enum class ESolarAnisotropicFilterLevel : uint16_t
{
	Default = 0,
	Level1X = 1,
	Level2X = 2,
	Level4X = 3,
	Level8X = 4,
	Level16X = 5,
	Invalid = 255,
	ESolarAnisotropicFilterLevel_MAX = 256
};

// Object: Enum Solarland.ESolarAntiAliasingLevel
enum class ESolarAntiAliasingLevel : uint16_t
{
	Off = 0,
	FXAA = 1,
	TAA = 2,
	MSAA = 3,
	Invalid = 255,
	ESolarAntiAliasingLevel_MAX = 256
};

// Object: Enum Solarland.ESolarDOFLevel
enum class ESolarDOFLevel : uint16_t
{
	Off = 0,
	On = 1,
	Invalid = 255,
	ESolarDOFLevel_MAX = 256
};

// Object: Enum Solarland.ECustomGraphicsLevel
enum class ECustomGraphicsLevel : uint16_t
{
	Default = 0,
	VeryLow = 1,
	Low = 2,
	Medium = 3,
	High = 4,
	ExtraHigh = 5,
	Cinematic = 6,
	Invalid = 255,
	ECustomGraphicsLevel_MAX = 256
};

// Object: Enum Solarland.ESolarWindowMode
enum class ESolarWindowMode : uint8_t
{
	Fullscreen = 0,
	WindowedFullscreen = 1,
	Windowed = 2,
	ESolarWindowMode_MAX = 3
};

// Object: Enum Solarland.ESolarResolution
enum class ESolarResolution : uint8_t
{
	Default = 0,
	Resolution1 = 1,
	Resolution2 = 2,
	Resolution3 = 3,
	Resolution4 = 4,
	Resolution5 = 5,
	ESolarResolution_MAX = 6
};

// Object: Enum Solarland.ESolarSuperResolutionType
enum class ESolarSuperResolutionType : uint16_t
{
	None = 0,
	SGSR = 1,
	FSR2 = 2,
	FSR3 = 3,
	DLSS = 4,
	XeSS = 5,
	MetalFX = 6,
	Invalid = 255,
	ESolarSuperResolutionType_MAX = 256
};

// Object: Enum Solarland.ECommercialInterfaceType
enum class ECommercialInterfaceType : uint8_t
{
	None = 0,
	SelectHeroPick = 1,
	MyTeam = 2,
	Settlement = 3,
	ECommercialInterfaceType_MAX = 4
};

// Object: Enum Solarland.ESolarFrameRateLevel
enum class ESolarFrameRateLevel : uint8_t
{
	None = 0,
	Level1 = 1,
	Level2 = 2,
	Level3 = 3,
	Level4 = 4,
	Level5 = 5,
	Level6 = 6,
	Level7 = 7,
	Min = 8,
	Max = 9,
	Invalid = 10
};

// Object: Enum Solarland.ESolarColorTheme
enum class ESolarColorTheme : uint8_t
{
	ESCT_Default = 0,
	ESCT_Bright = 1,
	ESCT_Soft = 2,
	ESCT_Cold = 3,
	ESCT_MAX = 4
};

// Object: Enum Solarland.EGraphicQualitySelect
enum class EGraphicQualitySelect : uint8_t
{
	Default = 0,
	Lobby = 1,
	InGame = 2,
	EGraphicQualitySelect_MAX = 3
};

// Object: Enum Solarland.ESolarDeviceType
enum class ESolarDeviceType : uint8_t
{
	ESDT_Invalid = 0,
	ESDT_Windows = 1,
	ESDT_Android = 2,
	ESDT_IOS = 3,
	ESDT_Switch = 4,
	ESDT_Other = 5,
	ESDT_MAX = 6
};

// Object: Enum Solarland.ESolarFeatureLevel
enum class ESolarFeatureLevel : uint8_t
{
	ESFL_Invalid = 0,
	ESFL_Deferred = 1,
	ESFL_MobileHDR = 2,
	ESFL_MobileLDR = 3,
	ESFL_MAX = 4
};

// Object: Enum Solarland.EHealthBuffType
enum class EHealthBuffType : uint8_t
{
	HealingHealth = 0,
	DamageHealth = 1,
	HealingShield = 2,
	HealingTempShield = 3,
	EHealthBuffType_MAX = 4
};

// Object: Enum Solarland.EHellStrikeOverlapAreaDamageCalculateType
enum class EHellStrikeOverlapAreaDamageCalculateType : uint8_t
{
	Add = 0,
	BasedOnFirstEntry = 1,
	EHellStrikeOverlapAreaDamageCalculateType_MAX = 2
};

// Object: Enum Solarland.EClassLevelUpRewardType
enum class EClassLevelUpRewardType : uint8_t
{
	BattleUpgradeEffect = 0,
	UpgradeSkill1 = 1,
	UpgradeSkill2 = 2,
	UpgradeSkill3 = 3,
	UpgradeSkill4 = 4,
	ClassCommonPassiveSkill = 5,
	ClassSpecificPassiveSkill = 6,
	Max = 7
};

// Object: Enum Solarland.EUIHeroPickListCellState
enum class EUIHeroPickListCellState : uint8_t
{
	Show = 0,
	Lock = 1,
	Forbidden = 2,
	EUIHeroPickListCellState_MAX = 3
};

// Object: Enum Solarland.EHeroCellSelectedType
enum class EHeroCellSelectedType : uint8_t
{
	Default = 0,
	Selecting = 1,
	DisableSelectd = 2,
	NotOwned = 3,
	NotOwnedSelected = 4,
	EHeroCellSelectedType_MAX = 5
};

// Object: Enum Solarland.EHeroPickMode
enum class EHeroPickMode : uint8_t
{
	BattleRoyale = 0,
	BattleGround = 1,
	Solo = 2,
	Training = 3,
	EHeroPickMode_MAX = 4
};

// Object: Enum Solarland.EUIHeroPickPlayerState
enum class EUIHeroPickPlayerState : uint8_t
{
	Waiting = 0,
	Selecting = 1,
	Confirm = 2,
	Done = 3,
	EUIHeroPickPlayerState_MAX = 4
};

// Object: Enum Solarland.TraceSourceComputation
enum class ETraceSourceComputation : uint8_t
{
	Actor = 0,
	ActorOwner = 1,
	TraceSourceComputation_MAX = 2
};

// Object: Enum Solarland.ESkillStateType
enum class ESkillStateType : uint8_t
{
	Normal = 0,
	CD = 1,
	NoneSkill = 2,
	ESkillStateType_MAX = 3
};

// Object: Enum Solarland.ETeamMateUIMode
enum class ETeamMateUIMode : uint8_t
{
	BattleRoyale = 0,
	DeathMatch = 1,
	ETeamMateUIMode_MAX = 2
};

// Object: Enum Solarland.EHUDPickupWidgetState
enum class EHUDPickupWidgetState : uint8_t
{
	Pickup_Weapon = 0,
	Pickup_Normal = 1,
	Replace_Weapon = 2,
	Replace_Scope = 3,
	Replace_Shield = 4,
	CanNotPickup = 5,
	CanNotPickup_Scope = 6,
	Replace_TacticalEquipment = 7,
	EHUDPickupWidgetState_MAX = 8
};

// Object: Enum Solarland.EHUDPickupReplaceSlotState
enum class EHUDPickupReplaceSlotState : uint8_t
{
	NormalWeapon = 0,
	FullPartWeapon = 1,
	NotWeapon = 2,
	EHUDPickupReplaceSlotState_MAX = 3
};

// Object: Enum Solarland.EHUDTipsPositionType
enum class EHUDTipsPositionType : uint8_t
{
	Empty = 0,
	FixedPos = 1,
	AutoAdjustPos = 2,
	EHUDTipsPositionType_MAX = 3
};

// Object: Enum Solarland.EHUDTipsContainerKey
enum class EHUDTipsContainerKey : uint8_t
{
	Empty = 0,
	SkillTips = 1,
	SpeakerTips = 2,
	MicTips = 3,
	EHUDTipsContainerKey_MAX = 4
};

// Object: Enum Solarland.EHumanoidTargetState
enum class EHumanoidTargetState : uint8_t
{
	None = 0,
	Stand = 1,
	Downing = 2,
	Downed = 3,
	Standing = 4,
	EHumanoidTargetState_MAX = 5
};

// Object: Enum Solarland.VaultDoorWidgetType
enum class EVaultDoorWidgetType : uint8_t
{
	OpenDoor = 0,
	FindKey = 1,
	ForceCrackDoor = 2,
	VaultDoorWidgetType_MAX = 3
};

// Object: Enum Solarland.EKillNoticeType
enum class EKillNoticeType : uint8_t
{
	BeKillLeader = 0,
	ShutDownKillLeader = 1,
	Revenge = 2,
	ShutDown = 3,
	CumulativeKill = 4,
	Down = 5,
	ClearTeam = 6,
	KillDefender = 7,
	KillBoss = 8,
	SelfKillNotify = 9,
	KillLeaderChange = 10,
	KillLeaderShutDown = 11,
	GlobalKillNotify = 12,
	EKillNoticeType_MAX = 13
};

// Object: Enum Solarland.ELoadingDataType
enum class ELoadingDataType : uint8_t
{
	None = 0,
	LoadingBR = 1,
	LoadingViceMode = 2,
	LoadingTuitionKeystroke = 3,
	LoadingTuitionHero = 4,
	LoadingTuitionGameplay = 5,
	Max = 6
};

// Object: Enum Solarland.ELoadingImageDataType
enum class ELoadingImageDataType : uint8_t
{
	None = 0,
	OneImage = 1,
	TwoImages = 2,
	ThreeImages = 3,
	Max = 4
};

// Object: Enum Solarland.ELotteryBuddyGrenadeAnimState
enum class ELotteryBuddyGrenadeAnimState : uint8_t
{
	None = 0,
	Holding = 1,
	FlyingPrepare = 2,
	Flying = 3,
	Landed = 4,
	ELotteryBuddyGrenadeAnimState_MAX = 5
};

// Object: Enum Solarland.EMapObjectSpawnStyle
enum class EMapObjectSpawnStyle : uint8_t
{
	Normal = 0,
	EMapObjectSpawnStyle_MAX = 1
};

// Object: Enum Solarland.EMapObjectBuddySpawnerArea
enum class EMapObjectBuddySpawnerArea : uint8_t
{
	NextSafeArea = 0,
	CurSafeArea = 1,
	All = 2,
	EMapObjectBuddySpawnerArea_MAX = 3
};

// Object: Enum Solarland.EMapCellSelectionAccess
enum class EMapCellSelectionAccess : uint8_t
{
	Can = 0,
	Cannot = 1,
	EMapCellSelectionAccess_MAX = 2
};

// Object: Enum Solarland.EWindZoneResolveType
enum class EWindZoneResolveType : uint8_t
{
	Override = 0,
	Additive = 1,
	EWindZoneResolveType_MAX = 2
};

// Object: Enum Solarland.EMassInvState
enum class EMassInvState : uint8_t
{
	Begin = 0,
	Prepare = 1,
	Normal = 2,
	Sprint = 3,
	End = 4,
	EMassInvState_MAX = 5
};

// Object: Enum Solarland.EMassInvisibilityState
enum class EMassInvisibilityState : uint8_t
{
	Begin = 0,
	Prepare = 1,
	Normal = 2,
	BeFound = 3,
	PrepareEnd = 4,
	End = 5,
	EMassInvisibilityState_MAX = 6
};

// Object: Enum Solarland.EMechaBossProcessState
enum class EMechaBossProcessState : uint8_t
{
	None = 0,
	WaitingToSpawn = 1,
	Spawned = 2,
	Destroyed = 3,
	EMechaBossProcessState_MAX = 4
};

// Object: Enum Solarland.EMeleeWeaponType
enum class EMeleeWeaponType : uint8_t
{
	Fist = 0,
	Knife = 1,
	Claw = 2,
	EMeleeWeaponType_MAX = 3
};

// Object: Enum Solarland.EMapState
enum class EMapState : uint8_t
{
	Idle = 0,
	FOVScale = 1,
	EMapState_MAX = 2
};

// Object: Enum Solarland.EMinimapDetailKeyExpressType
enum class EMinimapDetailKeyExpressType : uint8_t
{
	Normal = 0,
	MarkingMySelf = 1,
	ResponseOther = 2,
	CancelResponse = 3,
	EMinimapDetailKeyExpressType_MAX = 4
};

// Object: Enum Solarland.EMapFOVParamType
enum class EMapFOVParamType : uint8_t
{
	VehicleSpeed = 0,
	PoisonCircle = 1,
	EMapFOVParamType_MAX = 2
};

// Object: Enum Solarland.EMapFOVState
enum class EMapFOVState : uint8_t
{
	Default = 0,
	Fov1 = 1,
	Fov2 = 2,
	EMapFOVState_MAX = 3
};

// Object: Enum Solarland.EMissileSwarmDebugFlag
enum class EMissileSwarmDebugFlag : uint8_t
{
	Aim = 0,
	Trail = 1,
	Trace = 2,
	Explode = 3,
	Mesh = 4,
	EMissileSwarmDebugFlag_MAX = 5
};

// Object: Enum Solarland.ENezhaBuddhaState
enum class ENezhaBuddhaState : uint8_t
{
	Idle = 0,
	Prepare = 1,
	Active = 2,
	Loop = 3,
	NormalEnd = 4,
	ShieldBreakEnd = 5,
	DeathEnd = 6,
	ENezhaBuddhaState_MAX = 7
};

// Object: Enum Solarland.ESearchWeightRow
enum class ESearchWeightRow : uint8_t
{
	Default = 0,
	Aggressive = 1,
	Defensive = 2,
	Balanced = 3,
	ESearchWeightRow_MAX = 4
};

// Object: Enum Solarland.EMeshProgressType
enum class EMeshProgressType : uint8_t
{
	Normal = 0,
	Damage = 1,
	Background = 2,
	EMeshProgressType_MAX = 3
};

// Object: Enum Solarland.EHighlightVideoState
enum class EHighlightVideoState : uint8_t
{
	Hide = 0,
	NotGenerate = 1,
	Generating = 2,
	Ready = 3,
	EHighlightVideoState_MAX = 4
};

// Object: Enum Solarland.E_Type_OB_Scoreboard
enum class E_Type_OB_Scoreboard : uint8_t
{
	OB_Settlement = 0,
	OB_InGame = 1,
	Lobby_League_Settlement = 2,
	Lobby_CreateRoom_Settlement = 3,
	E_Type_OB_MAX = 4
};

// Object: Enum Solarland.EOBPithyPlayerState
enum class EOBPithyPlayerState : uint8_t
{
	Alive = 0,
	Dying = 1,
	Dead = 2,
	EOBPithyPlayerState_MAX = 3
};

// Object: Enum Solarland.EOBTeamListTab
enum class EOBTeamListTab : uint8_t
{
	Pithy = 0,
	All = 1,
	Nearby = 2,
	Players = 3,
	Faction = 4,
	EOBTeamListTab_MAX = 5
};

// Object: Enum Solarland.EPickupListEntryType
enum class EPickupListEntryType : uint8_t
{
	PickupList = 0,
	PickupTileView = 1,
	BackpackItem = 2,
	BackpackWeapon = 3,
	BackpackPart = 4,
	None = 5,
	EPickupListEntryType_MAX = 6
};

// Object: Enum Solarland.EBuddyCollectUIState
enum class EBuddyCollectUIState : uint8_t
{
	Normal = 0,
	Select = 1,
	Disable = 2,
	Cancel = 3,
	Forbidden = 4,
	EBuddyCollectUIState_MAX = 5
};

// Object: Enum Solarland.EPoisonControlBuddyAnimState
enum class EPoisonControlBuddyAnimState : uint8_t
{
	None = 0,
	Appear = 1,
	ReadyLoop = 2,
	ReadyComplete = 3,
	SpellLoop = 4,
	FinishDisappear = 5,
	DeathDisappear = 6,
	EPoisonControlBuddyAnimState_MAX = 7
};

// Object: Enum Solarland.ETeammateEffectTriggerType
enum class ETeammateEffectTriggerType : uint8_t
{
	AfterSkillActivate = 0,
	AfterSelfEffectTrigger = 1,
	ETeammateEffectTriggerType_MAX = 2
};

// Object: Enum Solarland.EExplosiveGrenadeState
enum class EExplosiveGrenadeState : uint8_t
{
	Flying = 0,
	Waiting = 1,
	Exploded = 2,
	BrokenDueToDamage = 3,
	EExplosiveGrenadeState_MAX = 4
};

// Object: Enum Solarland.ETargetDataChangeType
enum class ETargetDataChangeType : uint8_t
{
	E_None = 0,
	E_CharacterLost = 1,
	E_Locked = 2,
	E_MAX = 3
};

// Object: Enum Solarland.EThunderDogState
enum class EThunderDogState : uint8_t
{
	Holding = 0,
	Throwing = 1,
	Spawning = 2,
	Casting = 3,
	Flying = 4,
	Warning = 5,
	Thundering = 6,
	Waiting = 7,
	Killed = 8,
	Finished = 9,
	EThunderDogState_MAX = 10
};

// Object: Enum Solarland.ERestrictSnarePhase
enum class ERestrictSnarePhase : uint8_t
{
	Idle = 0,
	Move = 1,
	Extend = 2,
	Loop = 3,
	End = 4,
	ERestrictSnarePhase_MAX = 5
};

// Object: Enum Solarland.ERexDizzinessType
enum class ERexDizzinessType : uint8_t
{
	Damage = 0,
	Stun = 1,
	ERexDizzinessType_MAX = 2
};

// Object: Enum Solarland.ERexMontageState
enum class ERexMontageState : uint8_t
{
	None = 0,
	Combo1 = 1,
	Combo2 = 2,
	Combo3 = 3,
	FireBall = 4,
	Rage = 5,
	ERexMontageState_MAX = 6
};

// Object: Enum Solarland.ERexState
enum class ERexState : uint8_t
{
	Idle = 0,
	InBattle = 1,
	PreTeleport = 2,
	Spawn = 3,
	Dizziness = 4,
	ERexState_MAX = 5
};

// Object: Enum Solarland.ERexBallState
enum class ERexBallState : uint8_t
{
	None = 0,
	Spawn = 1,
	Loop = 2,
	PreEnd = 3,
	End = 4,
	ERexBallState_MAX = 5
};

// Object: Enum Solarland.ERexMoveType
enum class ERexMoveType : uint8_t
{
	None = 0,
	MoveToOwner = 1,
	MoveToComboTarget = 2,
	MoveToFireBallLocation = 3,
	ERexMoveType_MAX = 4
};

// Object: Enum Solarland.EFireBallState
enum class EFireBallState : uint8_t
{
	ReadyToLaunch = 0,
	Flying = 1,
	DamageZone = 2,
	EFireBallState_MAX = 3
};

// Object: Enum Solarland.EBtnQuitState
enum class EBtnQuitState : uint8_t
{
	None = 0,
	CanBeStopped = 1,
	CanReCall = 2,
	CustomDelegate = 3,
	EBtnQuitState_MAX = 4
};

// Object: Enum Solarland.EFireVoiceStyle
enum class EFireVoiceStyle : uint8_t
{
	Mid = 0,
	Left = 1,
	Right = 2,
	EFireVoiceStyle_MAX = 3
};

// Object: Enum Solarland.EScanBuddyEmotionType
enum class EScanBuddyEmotionType : uint8_t
{
	None = 0,
	Scan = 1,
	ScanComplete = 2,
	Hit = 3,
	EScanBuddyEmotionType_MAX = 4
};

// Object: Enum Solarland.EScanBuddyGrenadeAnimState
enum class EScanBuddyGrenadeAnimState : uint8_t
{
	None = 0,
	Holding = 1,
	FlyingPrepare = 2,
	Flying = 3,
	Landed = 4,
	EScanBuddyGrenadeAnimState_MAX = 5
};

// Object: Enum Solarland.ESCMMapElementVisibilityType
enum class ESCMMapElementVisibilityType : uint8_t
{
	Visible = 0,
	Hidden = 1,
	ESCMMapElementVisibilityType_MAX = 2
};

// Object: Enum Solarland.ESCMMapElementStateType
enum class ESCMMapElementStateType : uint8_t
{
	Normal = 0,
	Suspend = 1,
	ESCMMapElementStateType_MAX = 2
};

// Object: Enum Solarland.ESCMMapElementType
enum class ESCMMapElementType : uint8_t
{
	PlayerStart = 0,
	ItemSpawner = 1,
	AirDrop = 2,
	ChargingPile = 3,
	JumpPad = 4,
	CarPad = 5,
	Vehicle = 6,
	Poison = 7,
	Custom = 8,
	ESCMMapElementType_MAX = 9
};

// Object: Enum Solarland.EPlayerPawnType
enum class EPlayerPawnType : uint8_t
{
	NONE = 0,
	Character = 1,
	Vehicle = 2,
	Other = 3,
	EPlayerPawnType_MAX = 4
};

// Object: Enum Solarland.ESCMGameSceneType
enum class ESCMGameSceneType : uint8_t
{
	None = 0,
	InBattle = 1,
	Settlement = 2,
	ESCMGameSceneType_MAX = 3
};

// Object: Enum Solarland.EDownloadState
enum class EDownloadState : uint8_t
{
	None = 0,
	Downloading = 1,
	Successful = 2,
	Failed = 3,
	EDownloadState_MAX = 4
};

// Object: Enum Solarland.EShieldUpgradeItemShopOpenState
enum class EShieldUpgradeItemShopOpenState : uint8_t
{
	Closed = 0,
	Opening = 1,
	Open = 2,
	Closing = 3,
	EShieldUpgradeItemShopOpenState_MAX = 4
};

// Object: Enum Solarland.EAreaShape
enum class EAreaShape : uint8_t
{
	Sphere = 0,
	Box = 1,
	Capsule = 2,
	StaticMesh = 3,
	EAreaShape_MAX = 4
};

// Object: Enum Solarland.EVulnerableBuffEffectType
enum class EVulnerableBuffEffectType : uint8_t
{
	Individual = 0,
	Team = 1,
	EVulnerableBuffEffectType_MAX = 2
};

// Object: Enum Solarland.EDamageBuffType
enum class EDamageBuffType : uint8_t
{
	Mitigation = 0,
	Vulnerable = 1,
	EDamageBuffType_MAX = 2
};

// Object: Enum Solarland.ESkillBuffValueType
enum class ESkillBuffValueType : uint8_t
{
	Static = 0,
	Curve = 1,
	SetByCaller = 2,
	None = 3,
	ESkillBuffValueType_MAX = 4
};

// Object: Enum Solarland.ESkillBuffModifierOp
enum class ESkillBuffModifierOp : uint8_t
{
	Add = 0,
	Multiply = 1,
	Override = 2,
	ESkillBuffModifierOp_MAX = 3
};

// Object: Enum Solarland.ERoleAbilityAnimType
enum class ERoleAbilityAnimType : uint8_t
{
	LeftHand = 0,
	RightHand = 1,
	FullBody = 2,
	None = 3,
	ERoleAbilityAnimType_MAX = 4
};

// Object: Enum Solarland.ERoleSkillEnhanceType
enum class ERoleSkillEnhanceType : uint8_t
{
	None = 0,
	Tactical_1 = 1,
	Tactical_2 = 2,
	ERoleSkillEnhanceType_MAX = 3
};

// Object: Enum Solarland.ECharacterSkillGMIndex
enum class ECharacterSkillGMIndex : uint8_t
{
	Super = 0,
	Tactical_1 = 1,
	Tactical_2 = 2,
	Tactical_3 = 3,
	Passive = 4,
	ResidentPassive = 5,
	ECharacterSkillGMIndex_MAX = 6
};

// Object: Enum Solarland.ERoleSkillActiveStatus
enum class ERoleSkillActiveStatus : uint8_t
{
	NotActive = 0,
	Active_Default = 1,
	Active_Continuous = 2,
	ERoleSkillActiveStatus_MAX = 3
};

// Object: Enum Solarland.ECharacterRoleAbilityType
enum class ECharacterRoleAbilityType : uint8_t
{
	Type_Super = 0,
	Type_Tactical = 1,
	Count = 2,
	ECharacterRoleAbilityType_MAX = 3
};

// Object: Enum Solarland.ERoleAbilityVoiceTriggerTiming
enum class ERoleAbilityVoiceTriggerTiming : uint8_t
{
	None = 0,
	Activate = 1,
	Commit = 2,
	CustomStage_1 = 4,
	CustomStage_2 = 8,
	CustomStage_3 = 16,
	ERoleAbilityVoiceTriggerTiming_MAX = 17
};

// Object: Enum Solarland.EnemyStateInHellStrikeFirstStage
enum class EnemyStateInHellStrikeFirstStage : uint8_t
{
	Normal = 0,
	WaitingLock = 1,
	Lock = 2,
	WaitingPerspectiveElimination = 3,
	EnemyStateInHellStrikeFirstStage_MAX = 4
};

// Object: Enum Solarland.ESkillMontageState
enum class ESkillMontageState : uint8_t
{
	None = 0,
	Active = 1,
	Loop = 2,
	ReholdingTrigger = 3,
	Trigger = 4,
	Cancel = 5,
	ESkillMontageState_MAX = 6
};

// Object: Enum Solarland.ESurfaceParticleSize
enum class ESurfaceParticleSize : uint8_t
{
	Small = 0,
	Middle = 1,
	Large = 2,
	MAX = 3
};

// Object: Enum Solarland.EPreviewMeshAlignType
enum class EPreviewMeshAlignType : uint8_t
{
	None = 0,
	UsingGroundUpAsForward = 1,
	UsingCameraLookAt = 2,
	EPreviewMeshAlignType_MAX = 3
};

// Object: Enum Solarland.ESkillProgressWidgetState
enum class ESkillProgressWidgetState : uint8_t
{
	None = 0,
	Connecting = 1,
	Connected = 2,
	Disconnecting = 3,
	ESkillProgressWidgetState_MAX = 4
};

// Object: Enum Solarland.EProjectileBrokenReason
enum class EProjectileBrokenReason : uint8_t
{
	None = 0,
	BrokenDueToDamage = 1,
	BrokenDueToLifeTime = 2,
	EProjectileBrokenReason_MAX = 3
};

// Object: Enum Solarland.ETreasuryDoorState
enum class ETreasuryDoorState : uint8_t
{
	CantOpen = 0,
	CanOpen = 1,
	Opening = 2,
	Opened = 3,
	ETreasuryDoorState_MAX = 4
};

// Object: Enum Solarland.ETreasuryDoorType
enum class ETreasuryDoorType : uint8_t
{
	FrontDoor = 0,
	BackDoor = 1,
	ETreasuryDoorType_MAX = 2
};

// Object: Enum Solarland.ESkywardDiveAnimationSharingState
enum class ESkywardDiveAnimationSharingState : uint8_t
{
	Loop = 0,
	ESkywardDiveAnimationSharingState_MAX = 1
};

// Object: Enum Solarland.ESlitheringDragonAnimationState
enum class ESlitheringDragonAnimationState : uint8_t
{
	None = 0,
	Appear = 1,
	Exit = 2,
	ESlitheringDragonAnimationState_MAX = 3
};

// Object: Enum Solarland.EDevilSpeedUpState
enum class EDevilSpeedUpState : uint8_t
{
	None = 0,
	DevilIn = 1,
	SmokeIn = 2,
	SmokeOut = 3,
	EDevilSpeedUpState_MAX = 4
};

// Object: Enum Solarland.EAchievementCondition
enum class EAchievementCondition : uint8_t
{
	None = 0,
	AchTSubAchievement = 1,
	AchTMinuteKill = 2,
	AchTUseVehicle = 3,
	AchTHPKill = 4,
	AchTLimitWin = 5,
	AchTDyingWin = 6,
	AchTAssistWin = 7,
	AchTRescue = 8,
	AchTLevel = 9,
	AchTSkyKill = 10,
	AchTOnlyLiveWin = 11,
	AchTFirstKill = 12,
	AchTBlindSniper = 13,
	AchTFriendNum = 14,
	AchTOpenBoxNum = 15,
	AchTenemyVehicle = 16,
	AchTDie = 17,
	AchTMarsWin = 18,
	AchTFistKill = 19,
	AchTAirUmbrella = 20,
	AchTAirTrapeze = 21,
	AchTAirSpeed = 22,
	AchTBubbleKill = 23,
	AchTCharacterNum = 24,
	AchAdvancedWeapon = 25,
	AchTBombingDie = 26,
	AchTRevengeKill = 27,
	EAchievementCondition_MAX = 28
};

// Object: Enum Solarland.EAchievementReportType
enum class EAchievementReportType : uint8_t
{
	None = 0,
	SingleBattlle = 1,
	MultiBattle = 2,
	NoBattle = 3,
	EAchievementReportType_MAX = 4
};

// Object: Enum Solarland.ESolarActionPriority
enum class ESolarActionPriority : uint8_t
{
	Lowest = 0,
	VeryLow = 1,
	Low = 2,
	Normal = 3,
	High = 4,
	VeryHigh = 5,
	Highest = 6,
	ESolarActionPriority_MAX = 7
};

// Object: Enum Solarland.ESigninItemState
enum class ESigninItemState : uint8_t
{
	Got = 0,
	UnGot = 1,
	No = 2,
	ESigninItemState_MAX = 3
};

// Object: Enum Solarland.EProgressEffectType
enum class EProgressEffectType : uint8_t
{
	Instantly = 0,
	WholeGrid = 1,
	EProgressEffectType_MAX = 2
};

// Object: Enum Solarland.EProgressBoardChannelState
enum class EProgressBoardChannelState : uint8_t
{
	None = 0,
	Add = 1,
	Minus = 2,
	HoldOn = 3,
	EProgressBoardChannelState_MAX = 4
};

// Object: Enum Solarland.EAIActorType
enum class EAIActorType : uint8_t
{
	None = 0,
	AbilityDestructible = 1,
	AbilityArea = 2,
	Max = 4
};

// Object: Enum Solarland.ESolarAILOD
enum class ESolarAILOD : uint8_t
{
	Off = 0,
	Low = 1,
	Mid = 2,
	High = 3,
	ESolarAILOD_MAX = 4
};

// Object: Enum Solarland.ESolarCrowdAgentPriority
enum class ESolarCrowdAgentPriority : uint8_t
{
	Low = 0,
	Medium = 1,
	High = 2,
	Top = 3,
	ESolarCrowdAgentPriority_MAX = 4
};

// Object: Enum Solarland.ESolarAIValueCompareOp
enum class ESolarAIValueCompareOp : uint8_t
{
	Equal = 0,
	Greater = 1,
	Less = 2,
	ESolarAIValueCompareOp_MAX = 3
};

// Object: Enum Solarland.ELowMemBankLoadStrategy
enum class ELowMemBankLoadStrategy : uint8_t
{
	SADM_Unchanged = 0,
	SADM_OnDemand = 1,
	SADM_NeverLoad = 2,
	SADM_MAX = 3
};

// Object: Enum Solarland.ESolarAudioDetailCatalog
enum class ESolarAudioDetailCatalog : uint8_t
{
	SADC_Common = 0,
	SADC_Music = 1,
	SADC_UI = 2,
	SADC_Gun = 3,
	SADC_Vehicle = 4,
	SADC_Object = 5,
	SADC_Character = 6,
	SADC_Voice = 7,
	SADC_VoiceEx = 8,
	SADC_PokeBall = 9,
	SADC_SkyIsland = 10,
	SADC_MAX = 11
};

// Object: Enum Solarland.ESolarAudioDetailLoadMode
enum class ESolarAudioDetailLoadMode : uint8_t
{
	SADL_BeginPlay = 0,
	SADL_OnDemand = 1,
	SADL_Manual = 2,
	SADL_EnterBindScene = 3,
	SADL_EnterLobby = 4,
	SADL_EnterTutorial = 5,
	SADL_EnterWaiting = 6,
	SADL_EnterGame = 7,
	SADL_EnterGameState = 8,
	SADL_MAX = 9
};

// Object: Enum Solarland.EVoiceLanguageCode
enum class EVoiceLanguageCode : uint8_t
{
	SimplifiedChinese = 2,
	English = 5,
	Spanish = 6,
	Indonesian = 9,
	Japanese = 11,
	Portuguese = 15,
	Thai = 17,
	EVoiceLanguageCode_MAX = 18
};

// Object: Enum Solarland.ESolarCharacterRightHandState
enum class ESolarCharacterRightHandState : uint8_t
{
	Empty = 0,
	RightHandSkill = 1,
	Weapon = 2,
	ESolarCharacterRightHandState_MAX = 3
};

// Object: Enum Solarland.ESolarCharacterLayeredBodyType
enum class ESolarCharacterLayeredBodyType : uint8_t
{
	RightHandSkill = 0,
	LeftHandSkill = 1,
	Weapon = 2,
	ESolarCharacterLayeredBodyType_MAX = 3
};

// Object: Enum Solarland.ESolarCharacterLayeredMontageType
enum class ESolarCharacterLayeredMontageType : uint8_t
{
	Weapon = 0,
	Skill = 1,
	ESolarCharacterLayeredMontageType_MAX = 2
};

// Object: Enum Solarland.EMontageUserWeaponActionType
enum class EMontageUserWeaponActionType : uint8_t
{
	None = 0,
	Empty = 1,
	GunPlay = 2,
	Common = 3,
	EMontageUserWeaponActionType_MAX = 4
};

// Object: Enum Solarland.ESkillType
enum class ESkillType : uint8_t
{
	Default = 0,
	LeftHand = 1,
	ESkillType_MAX = 2
};

// Object: Enum Solarland.ETransitToMovingType
enum class ETransitToMovingType : uint8_t
{
	None = 0,
	GroundMoveStart = 1,
	ETransitToMovingType_MAX = 2
};

// Object: Enum Solarland.ETransitToIdleType
enum class ETransitToIdleType : uint8_t
{
	None = 0,
	SprintStop = 1,
	ETransitToIdleType_MAX = 2
};

// Object: Enum Solarland.ESkillMontageSlotType
enum class ESkillMontageSlotType : uint8_t
{
	None = 0,
	FullBody = 1,
	UpperBody = 2,
	SingleHand = 3,
	ESkillMontageSlotType_MAX = 4
};

// Object: Enum Solarland.EMontageCustomFlags
enum class EMontageCustomFlags : uint32_t
{
	None = 0,
	HasEndNotify = 1,
	Initialized = 2147483648,
	EMontageCustomFlags_MAX = 2147483649
};

// Object: Enum Solarland.EFPPRightHandReloadState
enum class EFPPRightHandReloadState : uint8_t
{
	None = 0,
	SingleHand = 1,
	DoubleLocoSingleMontage = 2,
	SingleToDoubleLocoDoubleMontage = 3,
	SingleLocoDoubleMontage = 4,
	DoubleHand = 5,
	EFPPRightHandReloadState_MAX = 6
};

// Object: Enum Solarland.EFPPReloadState
enum class EFPPReloadState : uint8_t
{
	None = 0,
	BeforeOldClipUnload = 1,
	BeforeWeaponPutDown = 2,
	BeforeWeaponRaiseUp = 3,
	WeaponRaiseUp = 4,
	Finish = 5,
	BackSwing = 6,
	EFPPReloadState_MAX = 7
};

// Object: Enum Solarland.EBaseGroundState
enum class EBaseGroundState : uint8_t
{
	Idle = 0,
	Walk = 1,
	Jog = 2,
	Sprint = 3,
	EBaseGroundState_MAX = 4
};

// Object: Enum Solarland.EAnimBlendDirection
enum class EAnimBlendDirection : uint8_t
{
	Idle = 0,
	Forward = 1,
	Back = 2,
	Right = 3,
	Left = 4,
	Max = 5
};

// Object: Enum Solarland.EInVehicleState
enum class EInVehicleState : uint8_t
{
	None = 0,
	Driving = 1,
	Riding = 2,
	StickingOut = 3,
	EInVehicleState_MAX = 4
};

// Object: Enum Solarland.ECruiseAnimState
enum class ECruiseAnimState : uint8_t
{
	None = 0,
	Looping = 1,
	Leaving = 2,
	End = 3,
	ECruiseAnimState_MAX = 4
};

// Object: Enum Solarland.ECharacterMontage
enum class ECharacterMontage : uint8_t
{
	Invalid = 0,
	Bolt = 1,
	Equip = 2,
	PreFire = 3,
	Rechamber = 4,
	Fire1 = 5,
	Reload = 6,
	ReloadWithBolt = 7,
	SummonPreview = 8,
	SummonExecute = 9,
	Max = 10
};

// Object: Enum Solarland.EVehicleAnimationType
enum class EVehicleAnimationType : uint8_t
{
	None = 0,
	Suv = 1,
	Sports = 2,
	MotorBike = 3,
	Hover = 4,
	Legged = 5,
	IronMan = 6,
	Backpacker = 7,
	BabyBus = 8,
	BigCannon = 9,
	EVehicleAnimationType_MAX = 10
};

// Object: Enum Solarland.EDriveTurnType
enum class EDriveTurnType : uint8_t
{
	EDriveTurnType_Idle = 0,
	EDriveTurnType_Left = 1,
	EDriveTurnType_Right = 2,
	EDriveTurnType_MAX = 3
};

// Object: Enum Solarland.EWeaponStatus
enum class EWeaponStatus : uint8_t
{
	NoWeapon = 0,
	Peace = 1,
	Aiming = 2,
	EWeaponStatus_MAX = 3
};

// Object: Enum Solarland.EAnoAntiDataType
enum class EAnoAntiDataType : uint8_t
{
	Unknown = 0,
	SecAntiDataFlow = 1,
	SecAttackFlow = 2,
	EAnoAntiDataType_MAX = 3
};

// Object: Enum Solarland.EMeerkatSubComponentType
enum class EMeerkatSubComponentType : uint8_t
{
	MB = 0,
	Hp = 1,
	AE = 2,
	AR = 3,
	EMeerkatSubComponentType_MAX = 4
};

// Object: Enum Solarland.EMeerkatGameDispatchEvents
enum class EMeerkatGameDispatchEvents : uint16_t
{
	ServerFire = 0,
	ServerHit = 1,
	ServerKill = 2,
	ServerKilled = 3,
	ClientFire = 4,
	ClientHit = 5,
	ClientKill = 6,
	ClientKilled = 7,
	ClientHitDown = 8,
	ClientBeHitDown = 9,
	ClientTick = 10,
	ServerTick = 11,
	ClientBeginPlay = 12,
	ServerBeginPlay = 13,
	ClientEndPlay = 14,
	ServerEndPlay = 15,
	SafeAreaUpdate = 16,
	EventMax = 255,
	EMeerkatGameDispatchEvents_MAX = 256
};

// Object: Enum Solarland.EItemLoadPriority
enum class EItemLoadPriority : uint64_t
{
	DEFAULT = 0,
	ITEM_MIN = 1,
	ITEM_MAX = 99,
	WEAPON_MIN = 100,
	WEAPON_MAX = 199,
	VEHICLE_MIN = 200,
	VEHICLE_MAX = 299,
	CHARACTER_MIN = 300,
	CHARACTER_MAX = 399,
	CLASS_PRIORITY = 4294967295,
	EItemLoadPriority_MAX = 4294967296
};

// Object: Enum Solarland.EAudioDebugFootstepMode
enum class EAudioDebugFootstepMode : uint8_t
{
	Sprint = 0,
	Run = 1,
	CrouchRun = 3,
	LowLand = 4,
	HighLand = 5,
	EAudioDebugFootstepMode_MAX = 6
};

// Object: Enum Solarland.EAudioDebugMoveMode
enum class EAudioDebugMoveMode : uint8_t
{
	Static = 0,
	PatrolX = 1,
	PatrolY = 2,
	Circular = 3,
	EAudioDebugMoveMode_MAX = 4
};

// Object: Enum Solarland.EAutoSaveType
enum class EAutoSaveType : uint8_t
{
	Weapon = 0,
	ItemActor = 1,
	EAutoSaveType_MAX = 2
};

// Object: Enum Solarland.AutoTestActionType
enum class EAutoTestActionType : uint8_t
{
	Command = 0,
	Function = 1,
	Inject = 2,
	AutoTestActionType_MAX = 3
};

// Object: Enum Solarland.AutoTestActionStatus
enum class EAutoTestActionStatus : uint8_t
{
	None = 0,
	Waiting = 1,
	Running = 2,
	Success = 3,
	Failed = 4,
	AutoTestActionStatus_MAX = 5
};

// Object: Enum Solarland.EBackpackPropellingMode
enum class EBackpackPropellingMode : uint8_t
{
	Default = 0,
	Skydive = 1,
	EBackpackPropellingMode_MAX = 2
};

// Object: Enum Solarland.EMarkWidgetPriority
enum class EMarkWidgetPriority : uint8_t
{
	Hide = 0,
	Lowest = 1,
	ItemBriefDetail = 2,
	Zipline = 3,
	WorldMarkOperation = 5,
	ItemDetail = 10,
	ItemReplace = 11,
	ActionWheel = 12,
	Max = 20
};

// Object: Enum Solarland.ActionType
enum class EActionType : uint8_t
{
	GetOn = 0,
	GetOff = 1,
	Launch = 2,
	SwitchSeat = 3,
	ActionType_MAX = 4
};

// Object: Enum Solarland.ESolarBotMemberState
enum class ESolarBotMemberState : uint8_t
{
	None = 0,
	Leader = 1,
	OnCall = 2,
	Separate = 3,
	Leaving = 4,
	Invalid = 5,
	ESolarBotMemberState_MAX = 6
};

// Object: Enum Solarland.EBotStressReason
enum class EBotStressReason : uint8_t
{
	None = 0,
	Damage = 1,
	EBotStressReason_MAX = 2
};

// Object: Enum Solarland.EBotDebugType
enum class EBotDebugType : uint8_t
{
	None = 0,
	BehaviorTree = 1,
	UtilityData = 2,
	Blackboard = 3,
	FocusInfo = 4,
	Config = 5,
	BackPack = 6,
	Perception = 7,
	PathFollow = 8,
	AgentService = 9,
	LODInfo = 10,
	EBotDebugType_MAX = 11
};

// Object: Enum Solarland.EBotTeleportReason
enum class EBotTeleportReason : uint8_t
{
	Unknown = 0,
	SolveBlock = 1,
	SolveOffMesh = 2,
	BTTask = 3,
	PreservePop = 4,
	EBotTeleportReason_MAX = 5
};

// Object: Enum Solarland.ESolarAITagStateTimeType
enum class ESolarAITagStateTimeType : uint8_t
{
	DurationInCurrentState = 0,
	TimeSinceLastExitToState = 1,
	ESolarAITagStateTimeType_MAX = 2
};

// Object: Enum Solarland.EBotInteractCondition
enum class EBotInteractCondition : uint8_t
{
	Invalid = 0,
	NeedToResponsePoison = 1,
	FoundEnemyActor = 2,
	TeammateKillEnemy = 3,
	WeAreTheChampion = 4,
	TeammateMarkTargetLocation = 5,
	TeammateMarkTargetDangerPoint = 6,
	TeammateMarkTargetItem = 7,
	TeammateMarkTargetFootstep = 8,
	TeammateMarkFollowHe = 9,
	TeammateMarkGetOnVehicle = 10,
	TeammateMarkNeedVehicle = 11,
	TeammateMarkNeedWeapon = 12,
	TeammateMarkNeedHelp = 13,
	TeammateMarkAttack = 14,
	TeammateMarkDefend = 15,
	MockEnemy = 16,
	MockDyingEnemy = 17,
	EnterDying = 18,
	BoringEnough = 19,
	EBotInteractCondition_MAX = 20
};

// Object: Enum Solarland.EPopLocationType
enum class EPopLocationType : uint8_t
{
	Default = 0,
	ShowFight = 1,
	Guarantee = 2,
	EPopLocationType_MAX = 3
};

// Object: Enum Solarland.ESolarBotTimelineTriggerAction
enum class ESolarBotTimelineTriggerAction : uint8_t
{
	None = 0,
	Add = 1,
	Remove = 2,
	Clear = 3,
	ESolarBotTimelineTriggerAction_MAX = 4
};

// Object: Enum Solarland.ESolarBotTimelineFilterParameterType
enum class ESolarBotTimelineFilterParameterType : uint8_t
{
	None = 0,
	MoreThan = 1,
	LessThan = 2,
	Equal = 3,
	NotEqual = 4,
	Contain = 5,
	NotContain = 6,
	Radius = 7,
	Target = 8,
	ESolarBotTimelineFilterParameterType_MAX = 9
};

// Object: Enum Solarland.ESolarBotTimelineFilterType
enum class ESolarBotTimelineFilterType : uint8_t
{
	None = 0,
	RankPoint = 1,
	Equipment = 2,
	Disengagement = 3,
	KillNum = 4,
	DamageNum = 5,
	ItemNum = 6,
	SkillCoolingDown = 7,
	SurroundingTeammate = 8,
	SurroundingEnemy = 9,
	ESolarBotTimelineFilterType_MAX = 10
};

// Object: Enum Solarland.ESolarBotTimelineAIDataSettingType
enum class ESolarBotTimelineAIDataSettingType : uint8_t
{
	None = 0,
	Health = 1,
	Shield = 2,
	ESolarBotTimelineAIDataSettingType_MAX = 3
};

// Object: Enum Solarland.ESolarBotTimelineWeaponPartType
enum class ESolarBotTimelineWeaponPartType : uint8_t
{
	None = 0,
	Muzzle = 1,
	Grip = 2,
	Clip = 3,
	Scope = 4,
	GunStock = 5,
	ESolarBotTimelineWeaponPartType_MAX = 6
};

// Object: Enum Solarland.ESolarBotTimelineEquipmentSettingType
enum class ESolarBotTimelineEquipmentSettingType : uint8_t
{
	None = 0,
	PrimaryWeapon = 1,
	SecondaryWeapon = 2,
	Shield = 3,
	VerticalJet = 4,
	HorizontalJet = 5,
	SummonGun = 6,
	ESolarBotTimelineEquipmentSettingType_MAX = 7
};

// Object: Enum Solarland.ESolarBotTimelineTriggerType
enum class ESolarBotTimelineTriggerType : uint8_t
{
	None = 0,
	Timeline = 1,
	Guarantee = 2,
	ESolarBotTimelineTriggerType_MAX = 3
};

// Object: Enum Solarland.ESolarBotWarmSystemType
enum class ESolarBotWarmSystemType : uint8_t
{
	Regular = 0,
	Script = 1,
	Newcome = 2,
	Unknown = 3,
	ESolarBotWarmSystemType_MAX = 4
};

// Object: Enum Solarland.EBotShotTargetCtlType
enum class EBotShotTargetCtlType : uint8_t
{
	Player = 0,
	Bot = 1,
	Any = 2,
	EBotShotTargetCtlType_MAX = 3
};

// Object: Enum Solarland.EBotShotTargetType
enum class EBotShotTargetType : uint8_t
{
	Character = 0,
	Vehicle = 1,
	SummonItem = 2,
	Any = 3,
	EBotShotTargetType_MAX = 4
};

// Object: Enum Solarland.ESearchTargetType
enum class ESearchTargetType : uint8_t
{
	Other = 0,
	TreasureBox = 1,
	DeathBox = 2,
	ItemSpawner = 3,
	ShieldUpgradeItemShop = 4,
	GoldenTreasureBox = 5,
	AirDrop = 6,
	ExpSpring = 7,
	Max = 8
};

// Object: Enum Solarland.EPoisonEscapeStrategy
enum class EPoisonEscapeStrategy : uint8_t
{
	Random = 0,
	MoveWhenPoisonClose = 1,
	MoveWhenCircleStartsShrinking = 2,
	MoveWhenNewCircleAppears = 3,
	EPoisonEscapeStrategy_MAX = 4
};

// Object: Enum Solarland.ERequestDirectorInfo
enum class ERequestDirectorInfo : uint8_t
{
	None = 0,
	ParachutePoint = 1,
	LootPoint = 2,
	RetreatPoint = 3,
	SeekEnemy = 4,
	CombatPoint = 5,
	ERequestDirectorInfo_MAX = 6
};

// Object: Enum Solarland.ERequestResult
enum class ERequestResult : uint8_t
{
	None = 0,
	Rejection = 1,
	Responded = 2,
	RequestFailed = 3,
	ERequestResult_MAX = 4
};

// Object: Enum Solarland.ELootStrategy
enum class ELootStrategy : uint8_t
{
	None = 0,
	LootZoneStrategy = 1,
	SafeLocationStrategy = 2,
	ELootStrategy_MAX = 3
};

// Object: Enum Solarland.EBotReviveMethod
enum class EBotReviveMethod : uint8_t
{
	ByReviveItem = 0,
	DirectlyRebirth = 1,
	Preserve = 2,
	EBotReviveMethod_MAX = 3
};

// Object: Enum Solarland.EBotCountAdjustStrategy
enum class EBotCountAdjustStrategy : uint8_t
{
	None = 0,
	BySafeAreaIndex = 1,
	EBotCountAdjustStrategy_MAX = 2
};

// Object: Enum Solarland.EParachuteAssignType
enum class EParachuteAssignType : uint8_t
{
	None = 0,
	V1 = 1,
	V2 = 2,
	EParachuteAssignType_MAX = 3
};

// Object: Enum Solarland.EBotOnVehicleFireType
enum class EBotOnVehicleFireType : uint8_t
{
	EBotOnVehicleFireType_None = 0,
	EBotOnVehicleFireType_FireOn = 1,
	EBotOnVehicleFireType_FireOnDelayOff = 2,
	EBotOnVehicleFireType_MAX = 3
};

// Object: Enum Solarland.EBotOnVehicleStopType
enum class EBotOnVehicleStopType : uint8_t
{
	EBotOnVehicleStopType_None = 0,
	EBotOnVehicleStopType_Delay = 1,
	EBotOnVehicleStopType_Stop = 2,
	EBotOnVehicleStopType_MAX = 3
};

// Object: Enum Solarland.EBotFirePolicy
enum class EBotFirePolicy : uint8_t
{
	AlwaysFire = 0,
	FirstRoughMoveDone = 1,
	FirstPreciseMoveDone = 2,
	PreciseMoveOrGreater = 3,
	FollowMoveOrGreater = 4,
	OnlyWhenHitSimulatedTarget = 5,
	OnlyWhenHitLockedTarget = 6,
	EBotFirePolicy_MAX = 7
};

// Object: Enum Solarland.ETrainingBotState
enum class ETrainingBotState : uint8_t
{
	Standby = 0,
	Hurt = 1,
	Death = 2,
	Reviving = 3,
	None = 4,
	ETrainingBotState_MAX = 5
};

// Object: Enum Solarland.EBotStateDebugType
enum class EBotStateDebugType : uint8_t
{
	Idle = 0,
	SearchSupplies = 1,
	InBattle = 2,
	MoveToWarmService = 3,
	EscapingPoison = 4,
	Dying = 5,
	Dead = 6,
	EBotStateDebugType_MAX = 7
};

// Object: Enum Solarland.EBotActionState
enum class EBotActionState : uint8_t
{
	EBotActionState_Sprint = 0,
	EBotActionState_Crouch = 1,
	EBotActionState_Gunsight = 2,
	EBotActionState_MAX = 3
};

// Object: Enum Solarland.EBotRecoverType
enum class EBotRecoverType : uint8_t
{
	Bandage = 0,
	Medicine = 1,
	ShieldRecharger = 2,
	ShieldBigRecharger = 3,
	EBotRecoverType_MAX = 4
};

// Object: Enum Solarland.EBotBunkerType
enum class EBotBunkerType : uint8_t
{
	Invalid = 0,
	FullSize = 1,
	HalfSize = 2,
	EBotBunkerType_MAX = 3
};

// Object: Enum Solarland.EBotTeamVehicleDrivePolicy
enum class EBotTeamVehicleDrivePolicy : uint8_t
{
	DirectlyMove = 0,
	HoldAndWaitPassenger = 1,
	MoveAndTakePassenger = 2,
	EBotTeamVehicleDrivePolicy_MAX = 3
};

// Object: Enum Solarland.EPoisonResponseType
enum class EPoisonResponseType : uint8_t
{
	NoResponse = 0,
	LowPriority = 1,
	HighPriority = 2,
	Immediately = 3,
	EPoisonResponseType_MAX = 4
};

// Object: Enum Solarland.ESolarTaskScoringItemType
enum class ESolarTaskScoringItemType : uint8_t
{
	None = 0,
	CurrentHP = 1,
	IfSelfInBattle = 2,
	IfSelfInSafeArea = 3,
	IfSelfInPoisonCircle = 4,
	TimeToEnterSafeArea = 5,
	TimeToEnterPoisonCircleXPoisonDamage = 6,
	IfRelativeActorInSafeArea = 7,
	IfRelativeActorInPoisonCircle = 8,
	IfRescueTargetIsPlayer = 9,
	TimeToMovetoRescueTarget = 10,
	DistanceFromRescueTargetToSafeArea = 11,
	DistanceFromRescueTargetToPoisonCircleXPoisonDamage = 12,
	IfRescuingThisTarget = 13,
	IfRescuingOtherTarget = 14,
	TimePoisonToRescueTarget = 15,
	CurrentPoisonDamage = 16,
	ESolarTaskScoringItemType_MAX = 17
};

// Object: Enum Solarland.ESolarTeamTaskType
enum class ESolarTeamTaskType : uint8_t
{
	RescueTeammate = 0,
	ESolarTeamTaskType_MAX = 1
};

// Object: Enum Solarland.EJetTaskFinishMode
enum class EJetTaskFinishMode : uint8_t
{
	AfterResponded = 0,
	AfterDone = 1,
	EJetTaskFinishMode_MAX = 2
};

// Object: Enum Solarland.EJetPackMode
enum class EJetPackMode : uint8_t
{
	Horizontal = 0,
	Vertical = 1,
	EJetPackMode_MAX = 2
};

// Object: Enum Solarland.EJumpTaskFinishMode
enum class EJumpTaskFinishMode : uint8_t
{
	AfterResponded = 0,
	AfterApex = 1,
	AfterDone = 2,
	EJumpTaskFinishMode_MAX = 3
};

// Object: Enum Solarland.EBotShootTargetType
enum class EBotShootTargetType : uint8_t
{
	Player = 0,
	Bot = 1,
	Vehicle = 2,
	Monster = 3,
	EBotShootTargetType_MAX = 4
};

// Object: Enum Solarland.EPickState
enum class EPickState : uint8_t
{
	Continue = 0,
	NothingToPick = 1,
	Failed = 2,
	Successed = 3,
	EPickState_MAX = 4
};

// Object: Enum Solarland.ESpawnerState
enum class ESpawnerState : uint8_t
{
	Openning = 0,
	ReadyToPick = 1,
	FailToPick = 2,
	ESpawnerState_MAX = 3
};

// Object: Enum Solarland.ERoleAbilityTargetType
enum class ERoleAbilityTargetType : uint8_t
{
	SingleTargetLocation = 0,
	SingleTargetActor = 1,
	MultipleTargets = 2,
	ERoleAbilityTargetType_MAX = 3
};

// Object: Enum Solarland.EBuddyBallReadoutWidgetState
enum class EBuddyBallReadoutWidgetState : uint8_t
{
	Normal = 0,
	Select = 1,
	Disable = 2,
	Forbidden = 3,
	EBuddyBallReadoutWidgetState_MAX = 4
};

// Object: Enum Solarland.ECameraShakeDurationType
enum class ECameraShakeDurationType : uint8_t
{
	Fixed = 0,
	Infinite = 1,
	Custom = 2,
	ECameraShakeDurationType_MAX = 3
};

// Object: Enum Solarland.ECameraShakeUpdateResultFlags
enum class ECameraShakeUpdateResultFlags : uint8_t
{
	ApplyAsAbsolute = 0,
	SkipAutoScale = 1,
	SkipAutoPlaySpace = 2,
	Default = 3,
	ECameraShakeUpdateResultFlags_MAX = 4
};

// Object: Enum Solarland.ECameraShakePlaySpace
enum class ECameraShakePlaySpace : uint8_t
{
	CameraLocal = 0,
	World = 1,
	UserDefined = 2,
	ECameraShakePlaySpace_MAX = 3
};

// Object: Enum Solarland.ECruiseStatePrivate
enum class ECruiseStatePrivate : uint8_t
{
	None = 0,
	Start = 1,
	CanParachute = 2,
	ForceParachute = 3,
	End = 4,
	FadeOut = 5,
	ECruiseStatePrivate_MAX = 6
};

// Object: Enum Solarland.ECargoBotQuality
enum class ECargoBotQuality : uint8_t
{
	Blue = 0,
	Purple = 1,
	Gold = 2,
	Red = 3,
	ECargoBotQuality_MAX = 4
};

// Object: Enum Solarland.ECargoBotState
enum class ECargoBotState : uint8_t
{
	Flying = 0,
	Falling = 1,
	Crashed = 2,
	ECargoBotState_MAX = 3
};

// Object: Enum Solarland.ECatBodyStatus
enum class ECatBodyStatus : uint8_t
{
	None = 0,
	FlyToHost = 1,
	Hover = 2,
	FlyToLand = 3,
	ECatBodyStatus_MAX = 4
};

// Object: Enum Solarland.EBuffValuesCalculateType
enum class EBuffValuesCalculateType : uint8_t
{
	None = 0,
	Max = 1,
	Sum = 2,
	Min = 3
};

// Object: Enum Solarland.EInteractionState
enum class EInteractionState : uint8_t
{
	None = 0,
	Mark = 1,
	Interact = 2,
	EInteractionState_MAX = 3
};

// Object: Enum Solarland.EAntiCheatType
enum class EAntiCheatType : uint8_t
{
	ShootingAtInvalidTime = 0,
	CheckLastShotWeapon = 1,
	ShootWhileNoAmmo = 2,
	ShootIntervalInvalid = 3,
	InvalidLaser = 4,
	ShootWhileOverload = 5,
	CheckRealShot = 6,
	VerifyHitInValid = 7,
	ReloadTooFast = 8,
	CanisterShotAbnormal = 9,
	EAntiCheatType_MAX = 10
};

// Object: Enum Solarland.EMovementComponentEnableType
enum class EMovementComponentEnableType : uint8_t
{
	Default = 0,
	Dying = 1,
	OnLevelStreaming = 2,
	OnLoadingScreen = 3,
	EMovementComponentEnableType_MAX = 4
};

// Object: Enum Solarland.EAntiCheatGameEvents
enum class EAntiCheatGameEvents : uint8_t
{
	ServerFire = 0,
	ServerHit = 1,
	ServerKill = 2,
	ServerKilled = 3,
	ClientFire = 4,
	ClientHit = 5,
	ClientKill = 6,
	ClientKilled = 7,
	ClientHitDown = 8,
	ClientBeHitDown = 9,
	ClientTick = 10,
	ServerTick = 11,
	ClientBeginPlay = 12,
	ServerBeginPlay = 13,
	ClientEndPlay = 14,
	ServerEndPlay = 15,
	EventMax = 16,
	EAntiCheatGameEvents_MAX = 17
};

// Object: Enum Solarland.EDynamicTaskFlag
enum class EDynamicTaskFlag : uint8_t
{
	screenshot = 1,
	replay = 2,
	dynamicconfig = 3,
	eigenvalue = 4,
	EDynamicTaskFlag_MAX = 5
};

// Object: Enum Solarland.EBackpackJetPlayTiming
enum class EBackpackJetPlayTiming : uint8_t
{
	None = 0,
	WhileActive = 1,
	OnRemove = 2,
	OnActive = 3,
	EBackpackJetPlayTiming_MAX = 4
};

// Object: Enum Solarland.EClipAttachType
enum class EClipAttachType : uint8_t
{
	Weapon = 0,
	CharacterLeftHand = 1,
	CharacterRightHand = 2,
	EClipAttachType_MAX = 3
};

// Object: Enum Solarland.EWeaponAttachType
enum class EWeaponAttachType : uint8_t
{
	None = 0,
	Hand = 1,
	Backpack = 2,
	Leg = 3,
	EWeaponAttachType_MAX = 4
};

// Object: Enum Solarland.EPersonPerspectiveMode
enum class EPersonPerspectiveMode : uint8_t
{
	FirstPerson = 0,
	ThirdPerson = 1,
	EPersonPerspectiveMode_MAX = 2
};

// Object: Enum Solarland.EPersonPerspectiveAction
enum class EPersonPerspectiveAction : uint8_t
{
	HipFire = 0,
	ADS = 1,
	ViewWeapon = 2,
	EPersonPerspectiveAction_MAX = 3
};

// Object: Enum Solarland.EVoiceOnePlayerLeftType
enum class EVoiceOnePlayerLeftType : uint8_t
{
	NoLimit = 0,
	MoreThanOne = 1,
	OnlyOne = 2,
	EVoiceOnePlayerLeftType_MAX = 3
};

// Object: Enum Solarland.EBattleTriggeredVoiceType
enum class EBattleTriggeredVoiceType : uint8_t
{
	KillEnemy = 0,
	KillDown = 1,
	InCombatReloading = 2,
	EBattleTriggeredVoiceType_MAX = 3
};

// Object: Enum Solarland.EPassiveTriggeredVoice
enum class EPassiveTriggeredVoice : uint8_t
{
	NOVOICE = 0,
	Personality = 1,
	TakeIt = 2,
	Alright = 3,
	GotIt = 4,
	MarkLocation = 5,
	RemindTeammateRevive = 6,
	NeedWeapons = 7,
	NeedVehicle = 8,
	Level1 = 9,
	Level2 = 10,
	Level3 = 11,
	Level4 = 12,
	Level5 = 13,
	NeedMuzzle = 14,
	NeedGrip = 15,
	NeedMagazine = 16,
	NeedStock = 17,
	NeedScope = 18,
	NeedShield = 19,
	NeedBatteryPack = 20,
	NeedHorizontalCooldown = 21,
	NeedVerticalCooldown = 22,
	NeedSMGAmmo = 23,
	NeedShutGunAmmo = 24,
	NeedRifleAmmo = 25,
	NeedSniperAmmo = 26,
	NeedBandage = 27,
	NeedShieldRestorer = 28,
	NeedSpecialWeapon = 29,
	NeedRespawnPod = 30,
	NeedBigShield = 31,
	NeedEnhancerMedical = 32,
	NeedEnhancerShield = 33,
	NeedEnhancerAmmo = 34,
	NeedMedKit = 35,
	NeedHelmet = 36,
	NeedBetterGear = 37,
	NeedEnhancerBackpack = 38,
	NeedTacticalEquipment = 39,
	AirdropsDelivering = 40,
	AirdropsDelivered = 41,
	Remaining3EnemySuqads = 42,
	Remaining2EnemySuqads = 43,
	Remaining1EnemySuqads = 44,
	SafeZoneRetract30s = 45,
	ResurrectionPeriodEnded = 46,
	WelcomeToFarlight84 = 47,
	AirdropsArriveIn60 = 48,
	AirdropsArriveIn45 = 49,
	AirdropsArriveIn30 = 50,
	CharAppear = 51,
	UsingMedicine = 52,
	AddingShield = 53,
	Reloading = 54,
	HelpingTeammate = 55,
	HitEnemy = 56,
	KillEnemy = 57,
	DestroyOtherTeam = 58,
	ReviveTeammate = 59,
	TakeDamage = 60,
	Defeated = 61,
	GetKilled = 62,
	TeammataDefeated = 63,
	TooFarApart = 64,
	Charging50 = 65,
	ChargingFinish = 66,
	BecomeKillLeader = 67,
	BackInTheFight = 68,
	ParachuteFollowMe = 69,
	ParachuteStartJump = 70,
	UsingBandage = 71,
	ScopeRecoveryRemind = 72,
	PickShipKeyCard = 73,
	PickFactoryKeyCard = 74,
	BuddyMachineSpawning = 75,
	RemindShipKeyCard = 76,
	RemindFactoryKeyCard = 77,
	PickGeneralKeyCard = 78,
	PickSkyIslandKeyCard = 79,
	UseSuperSkill = 80,
	UseSuperSkillEnemy = 81,
	UseTacticalSkill_1 = 82,
	UseTacticalSkill_2 = 83,
	NearbyEnemyLanding = 84,
	OneMoreEnemyKilled = 85,
	EnemyDown = 86,
	OneMoreEnemyDown = 87,
	EnemiesDown = 88,
	BreakEnemyShield = 89,
	AnotherSquadAttack = 90,
	TeammateKilled = 91,
	GlobalNewKillLeader = 92,
	Teammate_Become_KillLeader = 93,
	OtherTeam_Become_KillLeader = 94,
	GlobalFirstBlood = 95,
	TeamFirstBlood = 96,
	OtherTeamFirstBlood = 97,
	DefeatKillLeader = 98,
	RemainHalfTeam = 99,
	RemainThreeTeam = 100,
	RemainTwoTeam = 101,
	RemainOneTeam = 102,
	AllInAreaOnWaitShrink = 103,
	AllOutOfAreaOnWaitShrinkDis = 104,
	AllOutOfAreaOnWaitShrink = 105,
	OutOfAreaOnWaitShrink = 106,
	AllOutOfAreaOnCountdown30Dis = 107,
	AllOutOfAreaOnCountdown10Dis = 108,
	AllOutOfAreaOnCountdown30 = 109,
	AllOutOfAreaOnCountdown10 = 110,
	AllInAreaOnShrinking = 111,
	AllOutOfAreaOnShrinking = 112,
	OutOfAreaOnShrinking = 113,
	FinalAreaOnCountdown = 114,
	FinalAreaOnShrinking = 115,
	TeammateSpreadOut = 116,
	BroadcastOnWaitShrink = 117,
	BroadcastOnShrinking = 118,
	BroadcastOnFinalShrinking = 119,
	ExpSpringComingSoon = 120,
	ExpSpringChestIsOpened = 121,
	BroadcastExpSpringPreOpen = 122,
	AirdropComingSoon = 123,
	BroadcastAirdropComingSoon = 124,
	AirdropRainComingSoon = 125,
	BroadcastAirdropRainComingSoon = 126,
	SuperAirdropComingSoon = 127,
	BroadcastSuperAirdropComingSoon = 128,
	PromiseToRescue = 129,
	PromiseToRevive = 130,
	PlayerUpgrade = 131,
	SkillUpgradeNotice = 132,
	SkillUpgradeApplied = 133,
	BigCannonLaunched = 134,
	CloudyBuddyRemindTeammate = 135,
	Skill1CustomVoice_1 = 136,
	Skill1CustomVoice_2 = 137,
	Skill1CustomVoice_3 = 138,
	Skill2CustomVoice_1 = 139,
	Skill2CustomVoice_2 = 140,
	Skill2CustomVoice_3 = 141,
	SuperSkillCustomVoice_1 = 142,
	SuperSkillCustomVoice_2 = 143,
	SuperSkillCustomVoice_3 = 144,
	EPassiveTriggeredVoice_MAX = 145
};

// Object: Enum Solarland.ECameraTargetOffsetAnimBoneUpdateMethod
enum class ECameraTargetOffsetAnimBoneUpdateMethod : uint8_t
{
	Override = 0,
	MinusDeltaToCenter = 1,
	ECameraTargetOffsetAnimBoneUpdateMethod_MAX = 2
};

// Object: Enum Solarland.EStopCamShakeFlags
enum class EStopCamShakeFlags : uint8_t
{
	None = 0,
	All = 1,
	CacheOnly = 2,
	OnOpenScope = 4,
	EStopCamShakeFlags_MAX = 5
};

// Object: Enum Solarland.ECamShakeType
enum class ECamShakeType : uint8_t
{
	Default = 0,
	JumpBegin = 1,
	JumpEndLight = 2,
	JumpEndHeavy = 3,
	FullBodyMeleeWithTarget = 4,
	FullBodyMeleeWithoutTarget = 5,
	TacticalDodgeForward = 6,
	TacticalDodgeBackward = 7,
	TacticalDodgeLeft = 8,
	TacticalDodgeRight = 9,
	GrapplingHook = 10,
	ECamShakeType_MAX = 11
};

// Object: Enum Solarland.ESolarCameraSmoothType
enum class ESolarCameraSmoothType : uint8_t
{
	Default = 0,
	Instant = 1,
	Constant = 2,
	EaseOut = 3,
	EaseInEaseOut = 4,
	FloatCurve = 5,
	ESolarCameraSmoothType_MAX = 6
};

// Object: Enum Solarland.ESolarPredictionKeyUsageWhenEndAbility
enum class ESolarPredictionKeyUsageWhenEndAbility : uint8_t
{
	None = 0,
	EndOnly = 1,
	CancelOnly = 2,
	EndAndCancel = 3,
	ESolarPredictionKeyUsageWhenEndAbility_MAX = 4
};

// Object: Enum Solarland.ESolarAbilityStage
enum class ESolarAbilityStage : uint8_t
{
	None = 0,
	Startup = 1,
	Action = 2,
	Recovery = 3,
	ESolarAbilityStage_MAX = 4
};

// Object: Enum Solarland.EReconnectionStatus
enum class EReconnectionStatus : uint8_t
{
	None = 0,
	Reconnecting = 1,
	Reconnected = 2,
	EReconnectionStatus_MAX = 3
};

// Object: Enum Solarland.EAnimDirection
enum class EAnimDirection : uint8_t
{
	AnimNone = 0,
	AnimForward = 1,
	AnimBackward = 2,
	AnimLeft = 3,
	AnimRight = 4,
	EAnimDirection_MAX = 5
};

// Object: Enum Solarland.ESkydiveEffectActivationType
enum class ESkydiveEffectActivationType : uint8_t
{
	None = 0,
	Owner = 1,
	Teammates = 2,
	SpectatorsAndOwner = 3,
	All = 4,
	ESkydiveEffectActivationType_MAX = 5
};

// Object: Enum Solarland.ESkydiveEffectLifetime
enum class ESkydiveEffectLifetime : uint8_t
{
	DuringFlying = 0,
	DuringLanding = 1,
	DuringWholeSkydiving = 2,
	ESkydiveEffectLifetime_MAX = 3
};

// Object: Enum Solarland.EWallSnapState
enum class EWallSnapState : uint8_t
{
	Catch = 0,
	Elevate = 1,
	Accumulating = 2,
	EWallSnapState_MAX = 3
};

// Object: Enum Solarland.ECustomMoveMode
enum class ECustomMoveMode : uint8_t
{
	CustomMove_None = 0,
	CustomMove_Skydiving = 1,
	CustomMove_HangingTarget = 2,
	CustomMove_SkywardFly = 3,
	CustomMove_SyncForce = 4,
	CustomMove_Stepping = 5,
	CustomMove_Zipping = 6,
	CustomMove_HumanCannon = 7,
	CustomMove_SlidingRail = 8,
	CustomMove_Vault = 9,
	CustomMove_ResolveFallingStuck = 10,
	CustomMove_JetFlying = 11,
	CustomMove_AirFloat = 12,
	CustomMove_WallSnap = 13,
	CustomMove_MAX = 14
};

// Object: Enum Solarland.EUISummonFailedDisplayReason
enum class EUISummonFailedDisplayReason : uint8_t
{
	E_None = 0,
	E_UnKnowError = 1,
	E_NoValidLocation = 2,
	E_NormalCheckFailed = 3,
	E_RoomCheckFailed = 4,
	E_SurfacesFailed = 5,
	E_WaterCheckFailed = 6,
	E_OverlapActorFailed = 7,
	E_VisibilityCheckFailed = 8,
	E_VerticalCheckFailed = 9,
	E_MAX = 10
};

// Object: Enum Solarland.ERandomIdleAnimState
enum class ERandomIdleAnimState : uint8_t
{
	None = 0,
	IdleWithoutWeapon = 1,
	IdleWithWeapon = 2,
	CrouchWithoutWeapon = 3,
	CrouchWithWeapon = 4,
	ERandomIdleAnimState_MAX = 5
};

// Object: Enum Solarland.EZiplineType
enum class EZiplineType : uint8_t
{
	None = 0,
	Horizontal = 1,
	Vertical = 2,
	EZiplineType_MAX = 3
};

// Object: Enum Solarland.EInTornadoAnimState
enum class EInTornadoAnimState : uint8_t
{
	None = 0,
	LiftOff = 1,
	Drifting = 2,
	ToSkydive = 3,
	ToFalling = 4,
	AddOnNearlyEnd = 5,
	EInTornadoAnimState_MAX = 6
};

// Object: Enum Solarland.EUpdateWarmServiceEventType
enum class EUpdateWarmServiceEventType : uint8_t
{
	None = 0,
	CharacterUpgrade = 1,
	WeaponUpgrade = 2,
	ShieldUpgrade = 3,
	SuperAbilityReady = 4,
	TacticalAbilityReady = 5,
	BattleStation = 6,
	EUpdateWarmServiceEventType_MAX = 7
};

// Object: Enum Solarland.EMassInVisibilityWarningType
enum class EMassInVisibilityWarningType : uint8_t
{
	None = 0,
	Character = 1,
	Vehicle = 2,
	EMassInVisibilityWarningType_MAX = 3
};

// Object: Enum Solarland.EMeleeType
enum class EMeleeType : uint8_t
{
	None = 0,
	Stand = 1,
	Sprint = 2,
	Air = 4,
	Crouch = 8,
	SlideTackle = 16,
	Special = 32,
	EMeleeType_MAX = 33
};

// Object: Enum Solarland.EBResurrectionState
enum class EBResurrectionState : uint8_t
{
	NoneState = 0,
	WaitForApply = 1,
	NotApply = 2,
	Resurrected = 3,
	WaitForResurrect = 4,
	GiveUp = 5,
	Timeout = 6,
	AllTeammatesDied = 7,
	EBResurrectionState_MAX = 8
};

// Object: Enum Solarland.EItemSource
enum class EItemSource : uint8_t
{
	None = 0,
	Consumables = 1,
	GeneralSlot = 2,
	Weapon = 3,
	EItemSource_MAX = 4
};

// Object: Enum Solarland.EDroppedItemType
enum class EDroppedItemType : uint8_t
{
	Weapons = 0,
	WeaponParts = 1,
	Consumables = 2,
	Equipments = 3,
	EDroppedItemType_MAX = 4
};

// Object: Enum Solarland.EEnergyState
enum class EEnergyState : uint8_t
{
	NORMAL = 0,
	SKY = 1,
	PILE = 2,
	BOX = 4,
	E2M = 8,
	M2E = 16,
	EEnergyState_MAX = 17
};

// Object: Enum Solarland.EEnergyUsage
enum class EEnergyUsage : uint8_t
{
	Box = 0,
	Weapon = 1,
	Ability = 2,
	Jet = 3,
	Pile = 4,
	Armor = 5,
	Shield = 6,
	Sky = 7,
	RadarStation = 8,
	ElectricShop = 9,
	DeathBox = 10,
	EEnergyUsage_MAX = 11
};

// Object: Enum Solarland.EQuickVoiceThankType
enum class EQuickVoiceThankType : uint8_t
{
	None = 0,
	ThankTeammate_Rescue = 1,
	ThankTeammate_Resurrect = 2,
	ThankTeammate_ResurrectByDevice = 3,
	ThankTeammate_PickUpItem = 4,
	EQuickVoiceThankType_MAX = 5
};

// Object: Enum Solarland.EShieldCancelRechargeReason
enum class EShieldCancelRechargeReason : uint8_t
{
	None = 0,
	StopAutoRecharge = 1,
	EShieldCancelRechargeReason_MAX = 2
};

// Object: Enum Solarland.EShieldAutoRechargeStopReason
enum class EShieldAutoRechargeStopReason : uint8_t
{
	SwitchShield = 0,
	OnWeaponFire = 1,
	OnHit = 2,
	Die = 3,
	ShieldFull = 4,
	ManualRecharge = 5,
	EShieldAutoRechargeStopReason_MAX = 6
};

// Object: Enum Solarland.ETransitionMontageInterruptType
enum class ETransitionMontageInterruptType : uint8_t
{
	SpeedChange_ToIdle = 0,
	SpeedChange_ToRun = 1,
	SpeedChange_ToSprint = 2,
	DirectionChange = 3,
	ETransitionMontageInterruptType_MAX = 4
};

// Object: Enum Solarland.EDynamicAnimAssetsOverrideReason
enum class EDynamicAnimAssetsOverrideReason : uint8_t
{
	None = 0,
	Base = 1,
	Weapon = 2,
	Skill = 3,
	SpecCycling = 4,
	SkillLeftHand = 5,
	EDynamicAnimAssetsOverrideReason_MAX = 6
};

// Object: Enum Solarland.ESolarWeaponLocoAnimType
enum class ESolarWeaponLocoAnimType : uint8_t
{
	Pistol = 0,
	Rifle = 1,
	Shotgun = 2,
	Sniper = 3,
	BurstRevolver = 4,
	MeleeWeapon = 5,
	ESolarWeaponLocoAnimType_MAX = 6
};

// Object: Enum Solarland.EHandsUsingState
enum class EHandsUsingState : uint8_t
{
	Free = 0,
	OnlyLeft = 1,
	OnlyRight = 2,
	Both = 3,
	EHandsUsingState_MAX = 4
};

// Object: Enum Solarland.EAnimBaseMoveTransitionState
enum class EAnimBaseMoveTransitionState : uint8_t
{
	None = 0,
	Stand = 1,
	Crouch = 2,
	SlideTackle = 3,
	Crawl = 4,
	Jump = 5,
	Fall = 6,
	Zipline = 7,
	JetFly = 8,
	WallRun = 9,
	SkywardFly = 10,
	Launch = 11,
	Cruise = 12,
	Skydive = 13,
	Swim = 14,
	InVehicle = 15,
	SlidingRail = 16,
	EAnimBaseMoveTransitionState_MAX = 17
};

// Object: Enum Solarland.EAnimBaseMoveState
enum class EAnimBaseMoveState : uint8_t
{
	None = 0,
	BaseGround = 1,
	SlideTackle = 2,
	Crawl = 3,
	InAir = 4,
	InWater = 5,
	InVehicle = 6,
	EAnimBaseMoveState_MAX = 7
};

// Object: Enum Solarland.ECharacterInteractType
enum class ECharacterInteractType : uint8_t
{
	None = 0,
	Item = 1,
	Interactable = 2,
	Zipline = 3,
	RevivableDeathBox = 4,
	RescueTeammate = 5,
	SlidingRail = 6,
	ExecuteEnemy = 7,
	SkywardDiveLauncher = 8,
	ECharacterInteractType_MAX = 9
};

// Object: Enum Solarland.ERescueTeammateWidgetState
enum class ERescueTeammateWidgetState : uint8_t
{
	CanRescue = 0,
	Rescuing = 1,
	CanNotRescue = 2,
	ERescueTeammateWidgetState_MAX = 3
};

// Object: Enum Solarland.EPoseMode
enum class EPoseMode : uint8_t
{
	Stand = 0,
	Crouch = 1,
	Crawl = 2,
	FallingCrawl = 3,
	Skydive = 4,
	SlideTackle = 5,
	EPoseMode_MAX = 6
};

// Object: Enum Solarland.ESkillSpeedChangeType
enum class ESkillSpeedChangeType : uint8_t
{
	SlowDown = 0,
	SpeedUp = 1,
	ESkillSpeedChangeType_MAX = 2
};

// Object: Enum Solarland.EWallRunJumpType
enum class EWallRunJumpType : uint8_t
{
	None = 0,
	FullJump = 1,
	HalfJump = 2,
	FatigueJump = 3,
	EWallRunJumpType_MAX = 4
};

// Object: Enum Solarland.EVaultType
enum class EVaultType : uint8_t
{
	None = 0,
	Step = 1,
	StepSprint = 2,
	Vault = 3,
	VaultSprint = 4,
	Climb = 5,
	ClimbSprint = 6,
	ClimbWallRun = 7,
	ClimbWater = 8,
	HighClimb = 9,
	HighClimbSprint = 10,
	WallRun = 11,
	WallRunFailed = 12,
	ClimbMantling = 13,
	VaultMantling = 14,
	HighClimbMantling = 15,
	Hurdle = 16,
	VaultWallRun = 17,
	EVaultType_MAX = 18
};

// Object: Enum Solarland.EHellStrikeGAAction
enum class EHellStrikeGAAction : uint8_t
{
	E_EndAbility = 0,
	E_EnterSecondStage = 1,
	E_MAX = 2
};

// Object: Enum Solarland.EPickUpTargetType
enum class EPickUpTargetType : uint8_t
{
	Invalid = 0,
	Item = 1,
	Weapon = 2,
	TreasureItem = 3,
	HomeItem = 4,
	BoxHomeItem = 5,
	EPickUpTargetType_MAX = 6
};

// Object: Enum Solarland.ESolarExpBehaviorType
enum class ESolarExpBehaviorType : uint8_t
{
	SurvivalTime = 1,
	Kills = 2,
	Assists = 3,
	Selfhealing = 4,
	TeammateHealing = 5,
	Unpacking = 6,
	CollectElectricity = 7,
	PickExpPack = 8,
	EveryDamageDealt = 9,
	ESolarExpBehaviorType_MAX = 10
};

// Object: Enum Solarland.ESolarCheckButtonSelectType
enum class ESolarCheckButtonSelectType : uint8_t
{
	None = 0,
	Next = 1,
	Prev = 2,
	ESolarCheckButtonSelectType_MAX = 3
};

// Object: Enum Solarland.EClassType
enum class EClassType : uint8_t
{
	None = 0,
	Assault = 1,
	Defence = 2,
	Support = 3,
	Scout = 4,
	Control = 5,
	EClassType_MAX = 6
};

// Object: Enum Solarland.EInteractiveQuickChatResponseType
enum class EInteractiveQuickChatResponseType : uint8_t
{
	None = 0,
	Confirmation = 1,
	Clap = 2,
	NotAtAll = 3,
	YouAreWelcome = 4,
	NeedIt = 5,
	ConfirmHelp = 6,
	ConfirmReviving = 7,
	AppreciationForRescue = 8,
	AppreciationForResurrect = 9,
	AppreciationForPickUpItem = 10,
	Max = 11
};

// Object: Enum Solarland.EConsoleEffectType
enum class EConsoleEffectType : uint8_t
{
	Start = 0,
	Cancel = 1,
	Finished = 2,
	CooldownFinished = 3,
	EConsoleEffectType_MAX = 4
};

// Object: Enum Solarland.EConsoleUIStyleType
enum class EConsoleUIStyleType : uint8_t
{
	Hide = 0,
	ShowAvailable = 1,
	ShowCooldown = 2,
	ShowUsedOnlyOnce = 3,
	ShowBuddySpawned = 4,
	EConsoleUIStyleType_MAX = 5
};

// Object: Enum Solarland.EConsoleDeviceState
enum class EConsoleDeviceState : uint8_t
{
	Available = 0,
	InUse = 1,
	Cooldown = 2,
	Illegal = 3,
	EConsoleDeviceState_MAX = 4
};

// Object: Enum Solarland.ECurrentBuddyReadoutWidgetState
enum class ECurrentBuddyReadoutWidgetState : uint8_t
{
	Normal = 0,
	Select = 1,
	Empty = 2,
	LongCD = 3,
	Forbidden = 4,
	ECurrentBuddyReadoutWidgetState_MAX = 5
};

// Object: Enum Solarland.ESolarDamageTextType
enum class ESolarDamageTextType : uint8_t
{
	DamageTextType_None = 0,
	DamageTextType_Common = 1,
	DamageTextType_Headshot = 2,
	DamageTextType_HitShield = 3,
	DamageTextType_HeadshotWithShield = 4,
	DamageTextType_HitVehicle = 5,
	DamageTextType_HitVehicleWeak = 6,
	DamageTextType_BrokenShiled = 7,
	DamageTextType_BrokenShieldWithHeadShot = 8,
	DamageTextType_HitSummonItem = 9,
	DamageTextType_HitUnilateralEnergyShield = 10,
	DamageTextType_HitInteractionDoor = 11,
	DamageTextType_MAX = 12
};

// Object: Enum Solarland.EDoorOperationPanelState
enum class EDoorOperationPanelState : uint8_t
{
	None = 0,
	CD = 1,
	CanOpen = 2,
	FindKey = 3,
	Completed = 4,
	Hidden = 5,
	EDoorOperationPanelState_MAX = 6
};

// Object: Enum Solarland.EUIDragSourceType
enum class EUIDragSourceType : uint8_t
{
	Default = 0,
	Weapon1 = 1,
	Weapon2 = 2,
	Weapon3 = 3,
	PickupList = 4,
	BackpackConsumable = 5,
	BackpackEquip = 6,
	BackpackWeaponPart = 7,
	DefaultPickupList = 8,
	BackpackPickupListItem = 9,
	BackpackPickupListWeapon = 10,
	BackpackPickupListWeaponPart = 11,
	EUIDragSourceType_MAX = 12
};

// Object: Enum Solarland.EGamepadRotationType
enum class EGamepadRotationType : uint8_t
{
	EnableWhenFocus = 0,
	AlwaysEnable = 1,
	AlwaysDisable = 2,
	EGamepadRotationType_MAX = 3
};

// Object: Enum Solarland.ESpringRewardLimitType
enum class ESpringRewardLimitType : uint8_t
{
	NoLimit = 0,
	ShieldLevel = 1,
	CharacterLevel = 2,
	GoldWeaponNum = 3,
	EmptyPartSlotNum = 4,
	ESpringRewardLimitType_MAX = 5
};

// Object: Enum Solarland.EExpSpringPointState
enum class EExpSpringPointState : uint8_t
{
	PreOpen = 0,
	Opening = 1,
	Actived = 2,
	Closed = 3,
	EExpSpringPointState_MAX = 4
};

// Object: Enum Solarland.EExpSpringPointCloseResult
enum class EExpSpringPointCloseResult : uint8_t
{
	NobodyActive = 0,
	NoActive = 1,
	Actived = 2,
	Force = 3,
	EExpSpringPointCloseResult_MAX = 4
};

// Object: Enum Solarland.ESolarExpSpringChestLevel
enum class ESolarExpSpringChestLevel : uint8_t
{
	None = 0,
	Level1 = 1,
	Level2 = 2,
	Level3 = 3,
	ESolarExpSpringChestLevel_MAX = 4
};

// Object: Enum Solarland.EFocusLockType
enum class EFocusLockType : uint8_t
{
	Enemy = 0,
	Teammate = 1,
	Custom = 2,
	EFocusLockType_MAX = 3
};

// Object: Enum Solarland.EFollowCursorOffsetType
enum class EFollowCursorOffsetType : uint8_t
{
	None = 0,
	AdjustOnQuadrant = 1,
	AdjustOnOverEdge = 2,
	EFollowCursorOffsetType_MAX = 3
};

// Object: Enum Solarland.AIVehicleState
enum class EAIVehicleState : uint8_t
{
	AIVehicleState_Forward = 0,
	AIVehicleState_ReverseSolveBlock = 1,
	AIVehicleState_SolveBlockFoward = 2,
	AIVehicleState_ReverseToTarget = 3,
	AIVehicleState_MAX = 4
};

// Object: Enum Solarland.EAntiCheatReportType
enum class EAntiCheatReportType : uint8_t
{
	Player = 0,
	Weapon = 1,
	Vehicle = 2,
	EAntiCheatReportType_MAX = 3
};

// Object: Enum Solarland.EActiveEffectDurationChangeProxy
enum class EActiveEffectDurationChangeProxy : uint8_t
{
	MaintainCurrent = 0,
	MaintainRemain = 1,
	ScalingCurrent = 2,
	EActiveEffectDurationChangeProxy_MAX = 3
};

// Object: Enum Solarland.ESolarGAInputID
enum class ESolarGAInputID : uint8_t
{
	None = 0,
	SkillOne = 1,
	SkillTwo = 2,
	SkillThree = 3,
	Jump = 4,
	Crouch = 5,
	Sprint = 6,
	JetVertical = 7,
	JetHorizontal = 8,
	Parachute = 9,
	SkydiveAccelerate = 10,
	Fire = 11,
	OutVehicle = 12,
	SkillTest = 13,
	HoldBreath = 14,
	SwitchShootMode = 15,
	SwitchHybridScope = 16,
	ESolarGAInputID_MAX = 17
};

// Object: Enum Solarland.ELogChannel
enum class ELogChannel : uint8_t
{
	General = 0,
	Mode = 1,
	Hunt = 2,
	BattleRoyal = 3,
	Weapon = 4,
	Character = 5,
	Vehicle = 6,
	Camera = 7,
	Animation = 8,
	Physics = 9,
	Inventory = 10,
	World = 11,
	ELogChannel_MAX = 12
};

// Object: Enum Solarland.ESmokeType
enum class ESmokeType : uint8_t
{
	Sphere = 0,
	Wall = 1,
	ESmokeType_MAX = 2
};

// Object: Enum Solarland.EGameModeGroup
enum class EGameModeGroup : uint8_t
{
	None = 0,
	TeamDeathMatch = 1,
	RankBattleRoyale = 2,
	WarmupMatch = 3,
	Training = 6,
	TestBattleRoyale = 7,
	RevivalMode = 8,
	SingleDeathMatch = 10,
	BotBattleRoyale = 11,
	JetPackBattleRoyale = 12,
	MatchBattleRoyale = 14,
	BattleGround = 15,
	ArmsRace = 16,
	EGameModeGroup_MAX = 17
};

// Object: Enum Solarland.ESolarGameUserSettingPart
enum class ESolarGameUserSettingPart : uint8_t
{
	PickupSettings = 0,
	GraphicsSettings = 1,
	WeaponSettings = 2,
	LanguageSettings = 3,
	SoundSettings = 4,
	BasicSettings = 5,
	PersonalitySettings = 6,
	SensitivitySettings = 7,
	ShakeSettings = 8,
	DriverSettings = 9,
	ChatOperatorSettings = 10,
	CharacterVoiceSettings = 11,
	SensitivitySettingsKeyboard = 12,
	SensitivitySettingsGamepad = 13,
	KeyboardControlSettings = 14,
	GamepadSettings = 15,
	GamepadAdvancedSettings = 16,
	RtcBattleGroundSettings = 17,
	PickupSettingsPC = 18,
	VaultSettings = 19,
	All = 20,
	ESolarGameUserSettingPart_MAX = 21
};

// Object: Enum Solarland.ESolarAimModeType
enum class ESolarAimModeType : uint8_t
{
	Default = 0,
	Change = 1,
	Press = 2,
	ESolarAimModeType_MAX = 3
};

// Object: Enum Solarland.ESolarContentScaleFactorLevel
enum class ESolarContentScaleFactorLevel : uint8_t
{
	ESCSFL_NONE = 0,
	ESCSFL_Low = 1,
	ESCSFL_Mid = 2,
	ESCSFL_High = 3,
	ESCSFL_HighEnd = 4,
	ESCSFL_MAX = 5
};

// Object: Enum Solarland.EHoverCraftHitType
enum class EHoverCraftHitType : uint8_t
{
	Default = 0,
	HoverCraftVehicle = 1,
	HoverVehicle = 2,
	LeggedVehicle = 3,
	WheeledVehicle = 4,
	EHoverCraftHitType_MAX = 5
};

// Object: Enum Solarland.EReportStageType
enum class EReportStageType : uint8_t
{
	Battle = 0,
	SkyDive = 1,
	Other = 2,
	Max = 3
};

// Object: Enum Solarland.ESolarLocImageType
enum class ESolarLocImageType : uint8_t
{
	Chinese = 0,
	English = 1,
	ESolarLocImageType_MAX = 2
};

// Object: Enum Solarland.EChatShowDetailType
enum class EChatShowDetailType : uint8_t
{
	None = 0,
	CHAT = 1,
	QUICKCHAT = 2,
	SystemMessage = 3,
	EChatShowDetailType_MAX = 4
};

// Object: Enum Solarland.ELimNativeMsgContentType
enum class ELimNativeMsgContentType : uint8_t
{
	Unknown = 0,
	Text = 1,
	Voice = 2,
	Image = 3,
	Notification = 4,
	ShareGameCard = 5,
	CustomEmotion = 6,
	Recalled = 7,
	ELimNativeMsgContentType_MAX = 8
};

// Object: Enum Solarland.ELimNativeConvType
enum class ELimNativeConvType : uint8_t
{
	Group = 0,
	Peer = 1,
	Room = 2,
	CustomGroup = 3,
	Robot = 4,
	System = 5,
	TempGroup = 6,
	ELimNativeConvType_MAX = 7
};

// Object: Enum Solarland.EInputKeyMappingType
enum class EInputKeyMappingType : uint8_t
{
	KeyAndMouse1 = 0,
	KeyAndMouse2 = 1,
	Gamepad = 2,
	Count = 3,
	EInputKeyMappingType_MAX = 4
};

// Object: Enum Solarland.EInputActionContextType
enum class EInputActionContextType : uint8_t
{
	Pawn = 0,
	Controller = 1,
	LevelScriptActor = 2,
	UserWidget = 3,
	Count = 4,
	EInputActionContextType_MAX = 5
};

// Object: Enum Solarland.EInputActionFlags
enum class EInputActionFlags : uint8_t
{
	None = 0,
	FlagBigMap = 1,
	FlagBackpack = 2,
	FlagChatWheel = 3,
	FlagParachute = 4,
	FlagSpectate = 5,
	FlagTeamDeath = 6,
	FlagRelive = 7,
	FlagBuddyWheel = 8,
	FlagCommonPopupUI = 9,
	FlagBlockAll = 31,
	FlagMax = 32,
	EInputActionFlags_MAX = 33
};

// Object: Enum Solarland.ESolarInputContextType
enum class ESolarInputContextType : uint8_t
{
	MouseAndKeyboard = 0,
	Gamepad = 1,
	Count = 2,
	ESolarInputContextType_MAX = 3
};

// Object: Enum Solarland.ESecondInteractCheckMode
enum class ESecondInteractCheckMode : uint8_t
{
	None = 0,
	ClosestLine = 1,
	ActorRoot = 2,
	Zipline = 3,
	SlidingRail = 4,
	ESecondInteractCheckMode_MAX = 5
};

// Object: Enum Solarland.EInteractCDTimer
enum class EInteractCDTimer : uint8_t
{
	None = 0,
	LoopInteract = 1,
	Item = 2,
	MovingRail = 3,
	General = 4,
	MAX = 5
};

// Object: Enum Solarland.EBlockInteractTagConfigType
enum class EBlockInteractTagConfigType : uint8_t
{
	Add = 0,
	Override = 1,
	EBlockInteractTagConfigType_MAX = 2
};

// Object: Enum Solarland.EInteractRangeCheckMode
enum class EInteractRangeCheckMode : uint8_t
{
	ActorRoot = 0,
	ComponentRoot = 1,
	Custom = 2,
	EInteractRangeCheckMode_MAX = 3
};

// Object: Enum Solarland.EMobileInteractCheckMode
enum class EMobileInteractCheckMode : uint8_t
{
	NormalOverlap = 0,
	CustomOverlap = 1,
	FullyCustom = 2,
	EMobileInteractCheckMode_MAX = 3
};

// Object: Enum Solarland.EInteractMarkCheckMode
enum class EInteractMarkCheckMode : uint8_t
{
	TraceLine = 0,
	TraceCapsule = 1,
	EInteractMarkCheckMode_MAX = 2
};

// Object: Enum Solarland.EShowWayType
enum class EShowWayType : uint8_t
{
	Ground = 0,
	Airdrop = 1,
	EShowWayType_MAX = 2
};

// Object: Enum Solarland.EAirDropMovementState
enum class EAirDropMovementState : uint8_t
{
	None = 0,
	Waiting = 1,
	FreeFalling = 2,
	UniformFalling = 3,
	DecelerateFalling = 4,
	Landing = 5,
	Landed = 6,
	Removed = 7,
	EAirDropMovementState_MAX = 8
};

// Object: Enum Solarland.EAirdropMarkState
enum class EAirdropMarkState : uint8_t
{
	Normal = 0,
	Dropping = 1,
	Opened = 2,
	EAirdropMarkState_MAX = 3
};

// Object: Enum Solarland.EGeneralInteractMarkState
enum class EGeneralInteractMarkState : uint8_t
{
	Normal = 0,
	CanNotInteract = 1,
	EGeneralInteractMarkState_MAX = 2
};

// Object: Enum Solarland.EDoorDebugType
enum class EDoorDebugType : uint8_t
{
	Disable = 0,
	ShowHp = 1,
	ShowDSDoor = 2,
	ShowSweep = 3,
	Other = 4,
	EDoorDebugType_MAX = 5
};

// Object: Enum Solarland.EDoorEffectType
enum class EDoorEffectType : uint8_t
{
	Block = 0,
	HitDoor = 1,
	OpenDoor = 2,
	HitLatch = 3,
	CloseDoor = 4,
	StopOpen = 5,
	StopClose = 6,
	EDoorEffectType_MAX = 7
};

// Object: Enum Solarland.EInteractionDoorState
enum class EInteractionDoorState : uint8_t
{
	None = 0,
	Closed = 1,
	Closing = 2,
	Opened = 3,
	Opening = 4,
	Destroyed = 5,
	EInteractionDoorState_MAX = 6
};

// Object: Enum Solarland.ESolarInteractionCommandType
enum class ESolarInteractionCommandType : uint8_t
{
	InteractDoor = 0,
	Zipline = 1,
	FollowDance = 2,
	ExecuteEnemy = 3,
	RoleAbility = 4,
	ExpDevice = 5,
	SlidingRail = 6,
	Max = 7
};

// Object: Enum Solarland.EPanelBackpackDisplayStyle
enum class EPanelBackpackDisplayStyle : uint8_t
{
	Hidden = 0,
	Key_Tab = 1,
	Key_Interact = 2,
	EPanelBackpackDisplayStyle_MAX = 3
};

// Object: Enum Solarland.EInteractiveKeyState
enum class EInteractiveKeyState : uint8_t
{
	None = 0,
	UnArm = 1,
	EquipGun = 2,
	InVehicle = 3,
	OpenScope = 4,
	Holding = 5,
	Swimming = 6,
	FollowFly = 7,
	SingleOrDirectFly = 8,
	Cruise = 9,
	SupperSkillUI = 10,
	LowHP = 11,
	DeathVerge = 12,
	Dead = 13,
	Max = 14
};

// Object: Enum Solarland.ESolarItemPrivilegeType
enum class ESolarItemPrivilegeType : uint8_t
{
	NONE = 0,
	NETBAR = 1,
	ESolarItemPrivilegeType_MAX = 2
};

// Object: Enum Solarland.ESolarItemShowType
enum class ESolarItemShowType : uint8_t
{
	NOTSHOW = 0,
	SHOW = 1,
	ESolarItemShowType_MAX = 2
};

// Object: Enum Solarland.ESolarRedHintType
enum class ESolarRedHintType : uint8_t
{
	ZERO = 0,
	SHOW = 1,
	HIDE = 2,
	ESolarRedHintType_MAX = 3
};

// Object: Enum Solarland.ESolarItemOwnType
enum class ESolarItemOwnType : uint8_t
{
	ZERO = 0,
	NOOWN = 1,
	OWN = 2,
	ESolarItemOwnType_MAX = 3
};

// Object: Enum Solarland.ESolarItemBuyType
enum class ESolarItemBuyType : uint8_t
{
	ZERO = 0,
	NOBUY = 1,
	BUY = 2,
	CANTBUY = 3,
	ESolarItemBuyType_MAX = 4
};

// Object: Enum Solarland.ESolarItemUseType
enum class ESolarItemUseType : uint8_t
{
	ZERO = 0,
	NOUSE = 1,
	USING = 2,
	ESolarItemUseType_MAX = 3
};

// Object: Enum Solarland.ESolarItemLimitType
enum class ESolarItemLimitType : uint8_t
{
	ZERO = 0,
	NOLIMIT = 1,
	LIMITING = 2,
	ESolarItemLimitType_MAX = 3
};

// Object: Enum Solarland.ESolarItemMarkType
enum class ESolarItemMarkType : uint8_t
{
	ZERO = 0,
	NOMARK = 1,
	MARKED = 2,
	ESolarItemMarkType_MAX = 3
};

// Object: Enum Solarland.ESolarItemDownloadType
enum class ESolarItemDownloadType : uint8_t
{
	ZERO = 0,
	NOTDOWNLOAD = 1,
	DOWNLOADING = 2,
	DOWNLOADED = 3,
	PAUSING = 4,
	ESolarItemDownloadType_MAX = 5
};

// Object: Enum Solarland.ESolarItemLockType
enum class ESolarItemLockType : uint8_t
{
	ZERO = 0,
	NOLOCK = 1,
	LOCKED = 2,
	TEMPUNLOCK = 3,
	ESolarItemLockType_MAX = 4
};

// Object: Enum Solarland.ESolarItemSelectType
enum class ESolarItemSelectType : uint8_t
{
	ZERO = 0,
	NOTSELECT = 1,
	SELECTED = 2,
	ESolarItemSelectType_MAX = 3
};

// Object: Enum Solarland.ESolarItemQualityType
enum class ESolarItemQualityType : uint8_t
{
	ZERO = 0,
	N = 1,
	R = 2,
	SR = 3,
	SSR = 4,
	SSRPLUS = 5,
	MR = 6,
	ESolarItemQualityType_MAX = 7
};

// Object: Enum Solarland.EDroppingMethod
enum class EDroppingMethod : uint8_t
{
	DIRECT_DROP = 0,
	LONG_PRESS_TO_DROP = 1,
	CANNOT_DROP = 2,
	EDroppingMethod_MAX = 3
};

// Object: Enum Solarland.EItemConfirmID
enum class EItemConfirmID : uint32_t
{
	DropExtraEnergyConfirmID = 110003,
	ReplaceExtraEnergyConfirmID = 110004,
	DropEnergyModuleConfirmID = 110007,
	ReplaceEnergyModuleConfirmID = 110008,
	EItemConfirmID_MAX = 110009
};

// Object: Enum Solarland.EItemLocalTextID
enum class EItemLocalTextID : uint8_t
{
	LevelNumTextID = 40,
	EItemLocalTextID_MAX = 41
};

// Object: Enum Solarland.ESpawnStage
enum class ESpawnStage : uint8_t
{
	STAGE_NONE = 0,
	STAGE_READY = 1,
	STAGE_BATTLE = 2,
	STAGE_ALL = 3,
	STAGE_MAX = 4
};

// Object: Enum Solarland.EOutcomeType
enum class EOutcomeType : uint8_t
{
	None = 0,
	Single = 1,
	Pool = 2,
	DynamicPool = 3,
	EOutcomeType_MAX = 4
};

// Object: Enum Solarland.EItemSourceType
enum class EItemSourceType : uint8_t
{
	None = 0,
	DeathBox = 1,
	Discard = 2,
	Spawner = 3,
	TacticalBox = 4,
	TacticalBoxHighLevel = 5,
	AirdropBox = 6,
	ExpSpring = 7,
	TreasureBox = 8,
	ExpDevice = 9,
	SlotMachine = 10,
	RaffleBuddy = 11,
	CargoBot = 12,
	BotAdditional = 13,
	StealBuddy = 14,
	FabricationDevice = 15,
	Max = 16
};

// Object: Enum Solarland.EItemDiscardState
enum class EItemDiscardState : uint8_t
{
	EItemDiscardState_DEFAULT = 0,
	EItemDiscardState_DEATHBOX = 1,
	EItemDiscardState_MAX = 2
};

// Object: Enum Solarland.EEntryConditionRelationType
enum class EEntryConditionRelationType : uint8_t
{
	Or = 0,
	And = 1,
	EEntryConditionRelationType_MAX = 2
};

// Object: Enum Solarland.EEntryConditionInteractType
enum class EEntryConditionInteractType : uint8_t
{
	None = 0,
	ExpDevice = 1,
	TacticalBox = 2,
	TacticalBox_HighLevel = 3,
	EEntryConditionInteractType_MAX = 4
};

// Object: Enum Solarland.EEntryConditionType
enum class EEntryConditionType : uint8_t
{
	Kill = 0,
	Damage = 1,
	Interact = 2,
	UpgradeLevel = 3,
	EEntryConditionType_MAX = 4
};

// Object: Enum Solarland.ETacticalEquipmentType
enum class ETacticalEquipmentType : uint8_t
{
	Skill = 0,
	MedicalCare = 1,
	Movement = 2,
	Weapon = 3,
	ETacticalEquipmentType_MAX = 4
};

// Object: Enum Solarland.ETEUILockState
enum class ETEUILockState : uint8_t
{
	Default = 0,
	Lock = 1,
	Unlock = 2,
	ETEUILockState_MAX = 3
};

// Object: Enum Solarland.EItemGiverState
enum class EItemGiverState : uint8_t
{
	Available = 0,
	InUse = 1,
	Illegal = 2,
	EItemGiverState_MAX = 3
};

// Object: Enum Solarland.ERandomPackAdjustType
enum class ERandomPackAdjustType : uint8_t
{
	None = 0,
	SelfAdjust = 1,
	TeammateAdjust = 2,
	ERandomPackAdjustType_MAX = 3
};

// Object: Enum Solarland.ESpawnerDropType
enum class ESpawnerDropType : uint8_t
{
	Outcome = 0,
	RandomPack = 1,
	ESpawnerDropType_MAX = 2
};

// Object: Enum Solarland.ETreasureBoxSpawnType
enum class ETreasureBoxSpawnType : uint8_t
{
	SingleRandom = 0,
	Group = 1,
	ETreasureBoxSpawnType_MAX = 2
};

// Object: Enum Solarland.ESpawnerLevel
enum class ESpawnerLevel : uint8_t
{
	LEVEL_0 = 0,
	LEVEL_1 = 1,
	LEVEL_2 = 2,
	LEVEL_3 = 3,
	LEVEL_4 = 4,
	LEVEL_5 = 5,
	LEVEL_6 = 6,
	LEVEL_7 = 7,
	LEVEL_10 = 10,
	LEVEL_11 = 11,
	LEVEL_MAX = 12
};

// Object: Enum Solarland.ESpawnerType
enum class ESpawnerType : uint8_t
{
	NONE = 0,
	NORMAL = 1,
	TREASUREBOX = 2,
	AIRDROP = 3,
	VEHICLE = 4,
	TACTICALBOX = 5,
	MISSIONSPAWNER = 6,
	SLOTMACHINE = 7,
	SPECIAL_BUDDY = 8,
	ESpawnerType_MAX = 9
};

// Object: Enum Solarland.EWalkingDirection
enum class EWalkingDirection : uint8_t
{
	None = 0,
	Forward = 1,
	Backward = 2,
	Left = 4,
	Right = 8,
	EWalkingDirection_MAX = 9
};

// Object: Enum Solarland.EVehicleShrinkCapsuleExtent
enum class EVehicleShrinkCapsuleExtent : uint8_t
{
	SHRINK_None = 0,
	SHRINK_RadiusCustom = 1,
	SHRINK_HeightCustom = 2,
	SHRINK_AllCustom = 3,
	SHRINK_MAX = 4
};

// Object: Enum Solarland.EVehicleLocomotionState
enum class EVehicleLocomotionState : uint8_t
{
	Walk = 0,
	Run = 1,
	Sprint = 2,
	Max = 3
};

// Object: Enum Solarland.ELobbyCharacterLightMode
enum class ELobbyCharacterLightMode : uint8_t
{
	LM_Point = 0,
	LM_Spot = 1,
	LM_Directional = 2,
	LM_Sky = 3,
	LM_MAX = 4
};

// Object: Enum Solarland.ELobbyCharacterLightType
enum class ELobbyCharacterLightType : uint8_t
{
	Directional = 0,
	PointLightA = 1,
	PointLightB = 2,
	SpotLightA = 3,
	SpotLightB = 4,
	SpotLightC = 5,
	SkyLight = 6,
	ELobbyCharacterLightType_MAX = 7
};

// Object: Enum Solarland.ELotteryBuddySoundType
enum class ELotteryBuddySoundType : uint8_t
{
	None = 0,
	BuddyHit = 1,
	BuddyDead = 2,
	BuddyDeadVO = 3,
	ELotteryBuddySoundType_MAX = 4
};

// Object: Enum Solarland.ELotteryBuddyState
enum class ELotteryBuddyState : uint8_t
{
	None = 0,
	Prepare = 1,
	Activated = 2,
	SpawnItem = 3,
	FadeOut = 4,
	Finished = 5,
	ELotteryBuddyState_MAX = 6
};

// Object: Enum Solarland.ESolarBuildConfiguration
enum class ESolarBuildConfiguration : uint8_t
{
	Unknown = 0,
	Debug = 1,
	Development = 2,
	Shipping = 3,
	Test = 4,
	ESolarBuildConfiguration_MAX = 5
};

// Object: Enum Solarland.EElementVisibilityType
enum class EElementVisibilityType : uint8_t
{
	Visible = 0,
	Hidden = 1,
	EElementVisibilityType_MAX = 2
};

// Object: Enum Solarland.EElementStateType
enum class EElementStateType : uint8_t
{
	Normal = 0,
	Suspend = 1,
	EElementStateType_MAX = 2
};

// Object: Enum Solarland.ESolarMapElementPropertyType
enum class ESolarMapElementPropertyType : uint8_t
{
	String = 0,
	Float = 1,
	Int = 2,
	Bool = 3,
	ESolarMapElementPropertyType_MAX = 4
};

// Object: Enum Solarland.ESGameMode_ElementType
enum class ESGameMode_ElementType : uint8_t
{
	PlayerStart = 0,
	ItemSpawner = 1,
	AirDrop = 2,
	ChargingPile = 3,
	JumpPad = 4,
	CarPad = 5,
	Vehicle = 6,
	Poison = 7,
	Custom = 8,
	ESGameMode_MAX = 9
};

// Object: Enum Solarland.EMapType
enum class EMapType : uint8_t
{
	Default = 0,
	Map01 = 1,
	Map02 = 2,
	Map03 = 3,
	Map04 = 4,
	TDM01 = 5,
	TDM02 = 6,
	Solo = 7,
	TrainingCourse = 8,
	Tutorial = 9,
	EMapType_MAX = 10
};

// Object: Enum Solarland.ESkillWarningLevel
enum class ESkillWarningLevel : uint8_t
{
	None = 0,
	Primary = 1,
	Secondary = 2,
	ESkillWarningLevel_MAX = 3
};

// Object: Enum Solarland.EMiniMapWorldMarkType
enum class EMiniMapWorldMarkType : uint8_t
{
	Icon = 0,
	Anim = 1,
	EMiniMapWorldMarkType_MAX = 2
};

// Object: Enum Solarland.EBattlePromptType
enum class EBattlePromptType : uint8_t
{
	None = 0,
	Player = 1,
	Vehicle = 2,
	Move = 3,
	Fire = 4,
	Run = 5,
	Crouch = 6,
	Skydive = 7,
	PlayerStep = 8,
	PlayerSprint = 9,
	PlayerCrouchMove = 10,
	PlayerSkydive = 11,
	PlayerFire = 12,
	VehicleMove = 13,
	VehicleFire = 14,
	EBattlePromptType_MAX = 15
};

// Object: Enum Solarland.EBuddyExposeDurationPolicy
enum class EBuddyExposeDurationPolicy : uint8_t
{
	None = 0,
	HasDuration = 1,
	Infinite = 2,
	EBuddyExposeDurationPolicy_MAX = 3
};

// Object: Enum Solarland.EMeshWidgetOrderGroup
enum class EMeshWidgetOrderGroup : uint8_t
{
	None = 0,
	WarningMarker = 1,
	MarkerBG = 2,
	ItemMarker = 3,
	NormalMarker = 4,
	Character = 5,
	Skill = 6,
	SkillBG = 7,
	Interact = 8,
	Selecting = 9,
	Max = 10
};

// Object: Enum Solarland.EMeshWidgetDisplayType
enum class EMeshWidgetDisplayType : uint8_t
{
	Icon = 0,
	Flash = 1,
	Diffuse = 2,
	EMeshWidgetDisplayType_MAX = 3
};

// Object: Enum Solarland.EReviveMarkStatus
enum class EReviveMarkStatus : uint8_t
{
	Normal = 0,
	Playing = 1,
	EReviveMarkStatus_MAX = 2
};

// Object: Enum Solarland.EAirdropMarkStatus
enum class EAirdropMarkStatus : uint8_t
{
	Default = 0,
	Coming = 1,
	Available = 2,
	Opening = 3,
	Opened = 4,
	EAirdropMarkStatus_MAX = 5
};

// Object: Enum Solarland.EMarkerType
enum class EMarkerType : uint8_t
{
	None = 0,
	AirDrop = 1,
	RedZone = 2,
	VehicleMark = 3,
	ShieldUpgradeShop = 4,
	ReviveTeammate = 5,
	BlueCircle = 6,
	ExpSpring = 7,
	EnemyFire = 8,
	AIDog = 9,
	SummonOwl = 10,
	Doppelganger = 11,
	SuperDoppelganger = 12,
	VehicleSpawn = 13,
	SummonActorCircle = 14,
	WorldMarkIcon = 15,
	HellStrikeCaster = 16,
	WorldMarkIconBG = 17,
	NeutralMonster = 18,
	RespawnDevice = 19,
	TacticalBox = 20,
	TrapMine = 21,
	EnemyScanned = 22,
	EMarkerType_MAX = 23
};

// Object: Enum Solarland.EMapObjectPointType
enum class EMapObjectPointType : uint8_t
{
	None = 0,
	ShieldShop = 1,
	KongMingLantern = 2,
	TacticalBuilding = 3,
	SkywardDive = 4,
	RespawnDevice = 5,
	VendingMachine = 6,
	Buddy = 7,
	SpecialBuddy = 8,
	FabricationDevice = 9,
	EMapObjectPointType_MAX = 10
};

// Object: Enum Solarland.EMicUnSpeakState
enum class EMicUnSpeakState : uint8_t
{
	Unopened = 0,
	UnopenedBan = 1,
	EMicUnSpeakState_MAX = 2
};

// Object: Enum Solarland.EMicSpeakState
enum class EMicSpeakState : uint8_t
{
	OpenMic = 0,
	Team = 1,
	All = 2,
	NONE = 3,
	EMicSpeakState_MAX = 4
};

// Object: Enum Solarland.EMissionEndType
enum class EMissionEndType : uint8_t
{
	InProgress = 0,
	Completed = 1,
	Faild = 2,
	PlayerAllDead = 3,
	TimeOut = 4,
	MissTarget = 5,
	EMissionEndType_MAX = 6
};

// Object: Enum Solarland.EMissionSpawnType
enum class EMissionSpawnType : uint8_t
{
	AcceptForAll = 0,
	AcceptForSelf = 1,
	EMissionSpawnType_MAX = 2
};

// Object: Enum Solarland.EMissionContent
enum class EMissionContent : uint8_t
{
	Chest = 0,
	Worship = 1,
	MULTIPLE_TASK_MAX = 2,
	Pursuit = 3,
	TASK_MAX = 4,
	Escape = 5,
	None = 6,
	EMissionContent_MAX = 7
};

// Object: Enum Solarland.EMissionType
enum class EMissionType : uint8_t
{
	NonHUD = 0,
	Explore = 1,
	Battle = 2,
	Survive = 3,
	EMissionType_MAX = 4
};

// Object: Enum Solarland.EMissionOwner
enum class EMissionOwner : uint8_t
{
	Personal = 0,
	Teams = 1,
	None = 2,
	EMissionOwner_MAX = 3
};

// Object: Enum Solarland.EMonsterVisualNotice
enum class EMonsterVisualNotice : uint8_t
{
	Suspicion = 0,
	Alarm = 1,
	EMonsterVisualNotice_MAX = 2
};

// Object: Enum Solarland.ESolarMonsterBehaviorState
enum class ESolarMonsterBehaviorState : uint8_t
{
	None = 0,
	Patrol = 1,
	Alert = 2,
	Battle = 3,
	BackToBase = 4,
	ESolarMonsterBehaviorState_MAX = 5
};

// Object: Enum Solarland.EMovableType
enum class EMovableType : uint8_t
{
	MoveWidget = 0,
	MoveJoystick = 1,
	EMovableType_MAX = 2
};

// Object: Enum Solarland.ENavLinkType
enum class ENavLinkType : uint8_t
{
	Jet = 0,
	Vault = 1,
	Zipline = 2,
	WallRun = 3,
	Door = 4,
	None = 5,
	ENavLinkType_MAX = 6
};

// Object: Enum Solarland.EOwnerType
enum class EOwnerType : uint8_t
{
	None = 0,
	Vehicle = 1,
	TreasureBox = 2,
	EOwnerType_MAX = 3
};

// Object: Enum Solarland.EWeedType
enum class EWeedType : uint8_t
{
	ValidMark = 0,
	InvalidMark = 1,
	AutoGenerateMark = 2,
	EWeedType_MAX = 3
};

// Object: Enum Solarland.ERestState
enum class ERestState : uint8_t
{
	AT_REST = 0,
	JUST_STARTED_MOVING = 1,
	MOVING = 2,
	ERestState_MAX = 3
};

// Object: Enum Solarland.EExtrapolationMode
enum class EExtrapolationMode : uint8_t
{
	UNLIMITED = 0,
	LIMITED = 1,
	NONE = 2,
	EExtrapolationMode_MAX = 3
};

// Object: Enum Solarland.ESyncMode
enum class ESyncMode : uint8_t
{
	NONE = 0,
	X = 1,
	Y = 2,
	Z = 3,
	XY = 4,
	XZ = 5,
	YZ = 6,
	XYZ = 7,
	ESyncMode_MAX = 8
};

// Object: Enum Solarland.ENightComesState
enum class ENightComesState : uint8_t
{
	None = 0,
	Begin = 1,
	Keep = 2,
	End = 3,
	ENightComesState_MAX = 4
};

// Object: Enum Solarland.ESolarPoolObjectWarmUpTargetPlatform
enum class ESolarPoolObjectWarmUpTargetPlatform : uint8_t
{
	PC = 0,
	Mobile = 1,
	All = 2,
	ESolarPoolObjectWarmUpTargetPlatform_MAX = 3
};

// Object: Enum Solarland.ESolarPoolObjectWarmUpTargetNetMode
enum class ESolarPoolObjectWarmUpTargetNetMode : uint8_t
{
	Client = 0,
	Server = 1,
	All = 2,
	ESolarPoolObjectWarmUpTargetNetMode_MAX = 3
};

// Object: Enum Solarland.EOperationModeType
enum class EOperationModeType : uint8_t
{
	Common = 0,
	Parachute = 1,
	ArcadeBegin = 2,
	Jetpack = 3,
	EOperationModeType_MAX = 4
};

// Object: Enum Solarland.EPartitionGroupType
enum class EPartitionGroupType : uint8_t
{
	All = 0,
	BaseBattle = 1,
	AdvancedBattle = 2,
	InformationExchange = 3,
	EPartitionGroupType_MAX = 4
};

// Object: Enum Solarland.EPerceivableEffectAreaTendency
enum class EPerceivableEffectAreaTendency : uint8_t
{
	Hostile = 0,
	Neutral = 1,
	Friendly = 2,
	EPerceivableEffectAreaTendency_MAX = 3
};

// Object: Enum Solarland.EPerceivableEffectAreaType
enum class EPerceivableEffectAreaType : uint8_t
{
	Unknow = 0,
	SmokeGrenade = 1,
	NightCome = 2,
	AutomaticTurret = 3,
	AIDog = 4,
	BlackHole = 5,
	Incendiary = 6,
	EnergyBubble = 7,
	SummonWall = 8,
	UAVShield = 9,
	UAVRescue = 10,
	HealPile = 11,
	Doppelganger = 12,
	EPerceivableEffectAreaType_MAX = 13
};

// Object: Enum Solarland.EPickupListItemType
enum class EPickupListItemType : uint8_t
{
	None = 0,
	Single = 1,
	Merge = 2,
	Customize = 3,
	EPickupListItemType_MAX = 4
};

// Object: Enum Solarland.EPickupListChangeReason
enum class EPickupListChangeReason : uint8_t
{
	Default = 0,
	Backpack = 1,
	InteractionBlocked = 2,
	Weapon = 3,
	PickupBlocked = 4,
	Morph = 5,
	EPickupListChangeReason_MAX = 6
};

// Object: Enum Solarland.ESolarPileType
enum class ESolarPileType : uint8_t
{
	ChargingPile = 0,
	HealPile = 1,
	ESolarPileType_MAX = 2
};

// Object: Enum Solarland.EChargingChannel
enum class EChargingChannel : uint8_t
{
	MAIN = 0,
	EXTRA = 1,
	EChargingChannel_MAX = 2
};

// Object: Enum Solarland.EPileHealingType
enum class EPileHealingType : uint8_t
{
	None = 0,
	Health = 1,
	Armor = 2,
	EPileHealingType_MAX = 3
};

// Object: Enum Solarland.ESolarPingLevel
enum class ESolarPingLevel : uint8_t
{
	None = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	ESolarPingLevel_MAX = 4
};

// Object: Enum Solarland.ESolarNetworkConnectionType
enum class ESolarNetworkConnectionType : uint8_t
{
	Cell = 0,
	WiFi = 1,
	None = 2,
	ESolarNetworkConnectionType_MAX = 3
};

// Object: Enum Solarland.EJankBoundType
enum class EJankBoundType : uint8_t
{
	JANK_BOUND_TYPE_NONE = 0,
	JANK_BOUND_TYPE_GT = 1,
	JANK_BOUND_TYPE_RT = 2,
	JANK_BOUND_TYPE_RHI = 3,
	JANK_BOUND_TYPE_GPU = 4,
	JANK_BOUND_TYPE_MAX = 5
};

// Object: Enum Solarland.ELevelTickType
enum class ELevelTickType : uint8_t
{
	LEVELTICK_TimeOnly = 0,
	LEVELTICK_ViewportsOnly = 1,
	LEVELTICK_All = 2,
	LEVELTICK_PauseTick = 3,
	LEVELTICK_MAX = 4
};

// Object: Enum Solarland.EVisibleReason
enum class EVisibleReason : uint8_t
{
	None = 0,
	BackUp = 1,
	TooFar = 2,
	InRadarScan = 3,
	InmassInvisible = 4,
	InSmoke = 5,
	RaycastVisible = 6,
	RaycastUnVisible = 7,
	BlockBySmoke = 8,
	BlockBySmokeWall = 9,
	EVisibleReason_MAX = 10
};

// Object: Enum Solarland.FEVSmokeGrenadeInfoType
enum class EFEVSmokeGrenadeInfoType : uint8_t
{
	Fly = 0,
	Smoke = 1,
	FEVSmokeGrenadeInfoType_MAX = 2
};

// Object: Enum Solarland.EEVActorType
enum class EEVActorType : uint8_t
{
	None = 0,
	SmokeGrenade = 1,
	NightComes = 2,
	SmokeWall = 3,
	EEVActorType_MAX = 4
};

// Object: Enum Solarland.EEVActorShapeType
enum class EEVActorShapeType : uint8_t
{
	None = 0,
	Box = 1,
	Sphere = 2,
	Plane = 3,
	EEVActorShapeType_MAX = 4
};

// Object: Enum Solarland.ESolarEigenvalueCollectorMode
enum class ESolarEigenvalueCollectorMode : uint8_t
{
	NoRecord = 0,
	GlobalRecord = 1,
	TargetRecord = 2,
	ESolarEigenvalueCollectorMode_MAX = 3
};

// Object: Enum Solarland.EEVDamageType
enum class EEVDamageType : uint8_t
{
	Unknown = 0,
	Weapon = 1,
	Skill = 2,
	Vehicle = 3,
	Punch = 4,
	EEVDamageType_MAX = 5
};

// Object: Enum Solarland.EInteractiveFlag
enum class EInteractiveFlag : uint8_t
{
	None = 0,
	DanceLeader = 1,
	DeathVergeEnemy = 2,
	EInteractiveFlag_MAX = 3
};

// Object: Enum Solarland.EActionWheelState
enum class EActionWheelState : uint8_t
{
	Closed = 0,
	TemporaryShown = 1,
	Toggled = 2,
	EActionWheelState_MAX = 3
};

// Object: Enum Solarland.EBlendToRotationMode
enum class EBlendToRotationMode : uint8_t
{
	CameraLag = 0,
	RotationInputInterp = 1,
	EBlendToRotationMode_MAX = 2
};

// Object: Enum Solarland.ETacitScoreType
enum class ETacitScoreType : uint8_t
{
	KillTogether = 0,
	Revive = 1,
	PullUp = 2,
	ETacitScoreType_MAX = 3
};

// Object: Enum Solarland.ESolarPlayerSensitivitysType
enum class ESolarPlayerSensitivitysType : uint8_t
{
	None = 0,
	HoldWeaponSensitivity = 1,
	WeaponShootSensitivity = 2,
	WeaponShoulderNoShotSensitivity = 3,
	WeaponShoulderShotSensitivity = 4,
	WeaponSkillSensitivity = 5,
	SightSensitivity = 6,
	ScopeSensitivity = 7,
	ScopeShootSensitivity = 8,
	VehicleDriverSensitivity = 9,
	VehicleFireSensitivity = 10,
	SuperSkillSensitivity = 11,
	TacticalSkillSensitivity = 12,
	ESolarPlayerSensitivitysType_MAX = 13
};

// Object: Enum Solarland.ECharacterOwnerType
enum class ECharacterOwnerType : uint8_t
{
	CSITNone = 0,
	CSITOwn = 1,
	CSITExperience = 2,
	CSITLimit = 4,
	CSITPrivilege = 8,
	CSITCollegePrivilege = 16,
	ECharacterOwnerType_MAX = 17
};

// Object: Enum Solarland.EPersonalRewardType
enum class EPersonalRewardType : uint8_t
{
	OnlyOneSelf = 0,
	Team = 1,
	ScopeTeam = 2,
	AverageAliveTeam = 3,
	EPersonalRewardType_MAX = 4
};

// Object: Enum Solarland.EGainEXPFromDmgType
enum class EGainEXPFromDmgType : uint8_t
{
	None = 0,
	DmgToCharacter = 1,
	DmgToVehicle = 2,
	DmgToSummon = 3,
	EGainEXPFromDmgType_MAX = 4
};

// Object: Enum Solarland.EPlayerWeaponAimMode
enum class EPlayerWeaponAimMode : uint8_t
{
	Default = 0,
	SideScope = 1,
	TacticalStance = 2,
	EPlayerWeaponAimMode_MAX = 3
};

// Object: Enum Solarland.EWeaponPartVisibilityChangeFlag
enum class EWeaponPartVisibilityChangeFlag : uint8_t
{
	Default = 0,
	BySignificance = 1,
	ByHold = 2,
	ByOpenScope = 3,
	ByPartsVisibility = 4,
	ByDisableOtherPart = 5,
	InvisibleForDS = 6,
	EWeaponPartVisibilityChangeFlag_MAX = 7
};

// Object: Enum Solarland.EWeaponGripType
enum class EWeaponGripType : uint8_t
{
	None = 0,
	AngledGrip = 1,
	VerticalGrip = 2,
	TacticalStance = 3,
	EWeaponGripType_MAX = 4
};

// Object: Enum Solarland.EWeaponAttributeParamType
enum class EWeaponAttributeParamType : uint8_t
{
	Base = 0,
	BonusA = 1,
	BonusB = 2,
	EWeaponAttributeParamType_MAX = 3
};

// Object: Enum Solarland.EWeaponAdsAttributeType
enum class EWeaponAdsAttributeType : uint8_t
{
	CrossHairKick = 0,
	SingleShotKickLocX = 1,
	SingleShotKickRotPitch = 2,
	SingleShotKickRotYaw = 3,
	CameraShake = 4,
	IdleBreath = 5,
	EWeaponAdsAttributeType_MAX = 6
};

// Object: Enum Solarland.EWeaponAttributeType
enum class EWeaponAttributeType : uint8_t
{
	HoriRecoilFixed = 0,
	HoriRecoilRandom = 1,
	VertRecoilFixed = 2,
	VertRecoilRandom = 3,
	HoriSpreadBase = 4,
	HoriSpreadIncrement = 5,
	VertSpreadBase = 6,
	VertSpreadIncrement = 7,
	ExtraClipAmmo = 8,
	ReloadSpeed = 9,
	AdsEnterSpeed = 10,
	BaseDamageLevel = 11,
	DamageDistanceScale = 12,
	EWeaponAttributeType_MAX = 13
};

// Object: Enum Solarland.EPlayerWeaponOperationType
enum class EPlayerWeaponOperationType : uint8_t
{
	None = 0,
	Replace = 1,
	Drop = 2,
	Swap = 3,
	StartEquip = 4,
	FinishEquip = 5,
	StartUnequip = 6,
	FinishUnequip = 7,
	StartShoot = 8,
	StopShoot = 9,
	UseMainShootPattern = 10,
	UseSubShootPattern = 11,
	FinishSwitchShootPattern = 12,
	ToAimMode_TacticalStance = 13,
	OpenScope = 14,
	CloseScope = 15,
	MarkScopeOpenDone = 16,
	EnterViewWeapon = 17,
	ExitViewWeapon = 18,
	ToAimMode_Default = 19,
	ToAimMode_SideScope = 20,
	EPlayerWeaponOperationType_MAX = 21
};

// Object: Enum Solarland.EWeaponFireChargingState
enum class EWeaponFireChargingState : uint8_t
{
	None = 0,
	Charging = 1,
	ChargingFinished = 2,
	Cooling = 3,
	EWeaponFireChargingState_MAX = 4
};

// Object: Enum Solarland.EEquipWeaponActionType
enum class EEquipWeaponActionType : uint8_t
{
	Normal = 0,
	Quick = 1,
	PickUp = 2,
	EEquipWeaponActionType_MAX = 3
};

// Object: Enum Solarland.ESwitchWeaponAnimFlowType
enum class ESwitchWeaponAnimFlowType : uint8_t
{
	None = 0,
	LargeToLarge = 1,
	LargeToSmall = 2,
	LargeToFist = 3,
	FistToLarge = 4,
	SmallToSmall = 5,
	SmallToLarge = 6,
	SmallToFist = 7,
	FistToSmall = 8,
	ESwitchWeaponAnimFlowType_MAX = 9
};

// Object: Enum Solarland.ESolarWeaponUnequipClassify
enum class ESolarWeaponUnequipClassify : uint8_t
{
	Fist = 1,
	LargeToBackpack = 2,
	SmallToLeg = 4,
	ESolarWeaponUnequipClassify_MAX = 5
};

// Object: Enum Solarland.EPlayerWeaponEquipStatus
enum class EPlayerWeaponEquipStatus : uint8_t
{
	None = 0,
	Holding = 1,
	PendingToHang = 2,
	Hanging = 3,
	EPlayerWeaponEquipStatus_MAX = 4
};

// Object: Enum Solarland.EDefaultEffectScene
enum class EDefaultEffectScene : uint8_t
{
	All = 0,
	Lobby = 1,
	Battle = 2,
	EDefaultEffectScene_MAX = 3
};

// Object: Enum Solarland.ESolarPreLoadingLobbyMatchConfigType
enum class ESolarPreLoadingLobbyMatchConfigType : uint8_t
{
	NONE = 0,
	COMMON = 1,
	LEVEL = 2,
	GAMEMODE = 3,
	OTHER = 4,
	ESolarPreLoadingLobbyMatchConfigType_MAX = 5
};

// Object: Enum Solarland.EPreservedBotType
enum class EPreservedBotType : uint8_t
{
	PendingInit = 0,
	OnCall = 1,
	WaitingForSend = 2,
	Killer = 3,
	WaitingToDie = 4,
	EPreservedBotType_MAX = 5
};

// Object: Enum Solarland.ESolarProjBulletCollisionType
enum class ESolarProjBulletCollisionType : uint8_t
{
	Shape = 0,
	Box = 1,
	ESolarProjBulletCollisionType_MAX = 2
};

// Object: Enum Solarland.ESkillProjectileBounceType
enum class ESkillProjectileBounceType : uint8_t
{
	Default = 0,
	AngleAndCount = 1,
	StopOnActor = 2,
	OnlyBounceOnActor = 3,
	ESkillProjectileBounceType_MAX = 4
};

// Object: Enum Solarland.ESkillProjectileCustomMoveMode
enum class ESkillProjectileCustomMoveMode : uint8_t
{
	NormalMove = 0,
	PredictMove = 1,
	AutonomousMove = 2,
	ESkillProjectileCustomMoveMode_MAX = 3
};

// Object: Enum Solarland.EMapScanRadarNoticeType
enum class EMapScanRadarNoticeType : uint8_t
{
	ScanFinish = 0,
	FoundNothing = 1,
	FoundEnemy = 2,
	BeFound = 3,
	FoundEnemyMobile = 4,
	BeFoundMobile = 5,
	EnemyLocationTip = 6,
	RadarLocationTip = 7,
	EnemyLocationTipMobile = 8,
	RadarLocationTipMobile = 9,
	Max = 10
};

// Object: Enum Solarland.ERadarShape
enum class ERadarShape : uint8_t
{
	Sphere = 0,
	Box = 1,
	Sphere3D = 2,
	ERadarShape_MAX = 3
};

// Object: Enum Solarland.EInGameChatSceneType
enum class EInGameChatSceneType : uint8_t
{
	HeroSelect = 0,
	InGame = 1,
	Settlement = 2,
	Other = 3,
	EInGameChatSceneType_MAX = 4
};

// Object: Enum Solarland.EChatGroupType
enum class EChatGroupType : uint8_t
{
	None = 0,
	LimChat = 1,
	TeamQuickMessage = 2,
	SystemMessage = 3,
	EChatGroupType_MAX = 4
};

// Object: Enum Solarland.EQualityLineOperateState
enum class EQualityLineOperateState : uint8_t
{
	None = 0,
	Show = 1,
	Hide = 2,
	Clear = 3,
	EQualityLineOperateState_MAX = 4
};

// Object: Enum Solarland.ERecoveryPickableType
enum class ERecoveryPickableType : uint8_t
{
	None = 0,
	KillerPlayerFaction = 1,
	VictimPlayerFaction = 2,
	All = 3,
	ERecoveryPickableType_MAX = 4
};

// Object: Enum Solarland.ERecoveryPackageState
enum class ERecoveryPackageState : uint8_t
{
	None = 0,
	InPool = 1,
	Pickable = 2,
	Disappearing = 3,
	ERecoveryPackageState_MAX = 4
};

// Object: Enum Solarland.ERedHintPath
enum class ERedHintPath : uint8_t
{
	None = 0,
	Root = 1,
	Social = 2,
	Arsenal = 3,
	Arsenal_Weapon = 4,
	Arsenal_Skin = 5,
	Arsenal_Part = 6,
	Shop = 7,
	Mail = 8,
	Capsulers = 9,
	Capsulers_Detail = 10,
	Capsulers_Story = 11,
	Capsulers_Skin = 12,
	Capsulers_LevelUp = 13,
	Capsulers_Pose = 14,
	Capsulers_PoseTab = 15,
	Capsulers_BG = 16,
	Capsulers_BGTab = 17,
	Capsulers_BGFrame = 18,
	Capsulers_BGFrameTab = 19,
	Capsulers_DeathBox = 20,
	Capsulers_DeathBoxTab = 21,
	Capsulers_Voice = 22,
	Capsulers_VoiceKillVoice = 23,
	Capsulers_VoiceTeamDie = 24,
	Capsulers_VoiceTopKill = 25,
	Capsulers_VoiceParachute = 26,
	Capsulers_VoiceBattleTab = 27,
	Capsulers_VoicePersonalityTab = 28,
	Capsulers_VoiceTab = 29,
	WareHouse = 30,
	Task = 31,
	Activity = 32,
	RankFight = 33,
	Achievement = 34,
	EditBusinessCard = 35,
	PlayerInfo = 36,
	GameMode = 37,
	Raffle = 38,
	Vehicle = 39,
	Vehicle_Skin = 40,
	Clan = 41,
	ClanPermission = 42,
	Collection = 43,
	Tournament = 44,
	VipCard = 45,
	ClanMember = 46,
	Max = 47,
	BattlePass = 48
};

// Object: Enum Solarland.ERedHintValueType
enum class ERedHintValueType : uint8_t
{
	Single = 0,
	MultiValue = 1,
	ERedHintValueType_MAX = 2
};

// Object: Enum Solarland.ECharacterSkydivingState
enum class ECharacterSkydivingState : uint8_t
{
	Invalid = 0,
	EveryBattle = 1,
	Flying = 2,
	Skydiving = 3,
	Landing = 4,
	ECharacterSkydivingState_MAX = 5
};

// Object: Enum Solarland.EReplayDamageSourceType
enum class EReplayDamageSourceType : uint8_t
{
	None = 0,
	Weapon = 1,
	Vehicle = 2,
	Skill = 3,
	EReplayDamageSourceType_MAX = 4
};

// Object: Enum Solarland.EAutoDirectorActivityType
enum class EAutoDirectorActivityType : uint8_t
{
	None = 0,
	PlayerWeaponHit = 1,
	PlayerWeaponDown = 2,
	PlayerWeaponKill = 3,
	PickupItem = 4,
	DriveVehicle = 5,
	VehicleWeaponHit = 6,
	VehicleWeaponDown = 7,
	VehicleWeaponKill = 8,
	BandagePlayer = 9,
	RevivePlayer = 10,
	UseTacticalAbility = 11,
	UseUltimateAbility = 12,
	AbilityDown = 13,
	AbilityKill = 14,
	StartSkydive = 15,
	EAutoDirectorActivityType_MAX = 16
};

// Object: Enum Solarland.EAutoDirectorCameraMode
enum class EAutoDirectorCameraMode : uint8_t
{
	Free = 0,
	Follow = 1,
	EAutoDirectorCameraMode_MAX = 2
};

// Object: Enum Solarland.EReplayFindSpectateTargetApproach
enum class EReplayFindSpectateTargetApproach : uint8_t
{
	None = 0,
	SuggestTarget = 1,
	LastTarget = 2,
	ClosestToCamera = 3,
	FirstInPlayerList = 4,
	EReplayFindSpectateTargetApproach_MAX = 5
};

// Object: Enum Solarland.EHighlightFileType
enum class EHighlightFileType : uint8_t
{
	Data = 0,
	Flag = 1,
	Keep = 2,
	Playing = 3,
	Writing = 4,
	EHighlightFileType_MAX = 5
};

// Object: Enum Solarland.EReplayPlayingFinishReason
enum class EReplayPlayingFinishReason : uint8_t
{
	Normal = 0,
	GMForce = 1,
	StreamerDownloadChunkTimeout = 2,
	StreamerServiceUnavailable = 3,
	EReplayPlayingFinishReason_MAX = 4
};

// Object: Enum Solarland.EClassRepNodeMapping
enum class EClassRepNodeMapping : uint8_t
{
	Missing = 0,
	NotRouted = 1,
	CustomRelevancy = 2,
	RelevantAllConnections = 3,
	RelevantAllConnections_Dormancy = 4,
	RelevantAllConnections_FastShared = 5,
	Spatialize_Static = 6,
	Spatialize_Dynamic = 7,
	Spatialize_Dormancy = 8,
	SpatializeSmall_Dormancy = 9,
	EClassRepNodeMapping_MAX = 10
};

// Object: Enum Solarland.ELightBeamType
enum class ELightBeamType : uint8_t
{
	NoBeam = 0,
	AvailableBeam = 1,
	SelfBeam = 2,
	EnemyBeam = 3,
	ELightBeamType_MAX = 4
};

// Object: Enum Solarland.EIncreaseAndDecreaseTransitionMode
enum class EIncreaseAndDecreaseTransitionMode : uint8_t
{
	Continuously = 0,
	BreakAndKeepLast = 1,
	EIncreaseAndDecreaseTransitionMode_MAX = 2
};

// Object: Enum Solarland.ESignalSystemSwitcher
enum class ESignalSystemSwitcher : uint8_t
{
	Disable = 0,
	DomesticOnly = 1,
	ForeignOnly = 2,
	EnableBoth = 3,
	ESignalSystemSwitcher_MAX = 4
};

// Object: Enum Solarland.EDynamicPoisonState
enum class EDynamicPoisonState : uint8_t
{
	None = 0,
	Warning = 1,
	Moving = 2,
	EDynamicPoisonState_MAX = 3
};

// Object: Enum Solarland.ESafeAreaNoticeType
enum class ESafeAreaNoticeType : uint8_t
{
	ThirtySecondsWarning = 0,
	TenSecondsWarning = 1,
	ESafeAreaNoticeType_MAX = 2
};

// Object: Enum Solarland.EActorInSafeAreaStatus
enum class EActorInSafeAreaStatus : uint8_t
{
	InSafeArea = 0,
	NotInSafeArea = 1,
	InTargetSafeArea = 2,
	EActorInSafeAreaStatus_MAX = 3
};

// Object: Enum Solarland.ESafeAreaAKEventType
enum class ESafeAreaAKEventType : uint8_t
{
	None = 0,
	Moving = 1,
	Idle = 2,
	ESafeAreaAKEventType_MAX = 3
};

// Object: Enum Solarland.ESafeAreaStatus
enum class ESafeAreaStatus : uint8_t
{
	None = 0,
	WaitingForStart = 1,
	WaitingForShrink = 2,
	Shrink = 3,
	ShrinkEnd = 4,
	Pause = 5,
	End = 6,
	Manual = 7,
	MovingToDynamicCenter = 8,
	NoEffect = 9,
	ESafeAreaStatus_MAX = 10
};

// Object: Enum Solarland.ENeverShowDuration
enum class ENeverShowDuration : uint8_t
{
	Day = 0,
	Week = 1,
	Month = 2,
	Year = 3,
	Never = 4,
	None = 5,
	ENeverShowDuration_MAX = 6
};

// Object: Enum Solarland.ESettingSlotStyle
enum class ESettingSlotStyle : uint8_t
{
	CheckBox = 0,
	Slider = 1,
	Title = 2,
	DropBox = 3,
	MultiDrop = 4,
	TextBtn = 5,
	ESettingSlotStyle_MAX = 6
};

// Object: Enum Solarland.EShieldUpgradeItemShopState
enum class EShieldUpgradeItemShopState : uint8_t
{
	None = 0,
	Upgrading = 1,
	Done = 2,
	EShieldUpgradeItemShopState_MAX = 3
};

// Object: Enum Solarland.EParticleOptimization
enum class EParticleOptimization : uint8_t
{
	Origin = 0,
	LowPriorityOptimization = 1,
	MidPriorityOptimization = 2,
	HighPriorityOptimization = 3,
	UltraHighPriorityOptimization = 4,
	EParticleOptimization_MAX = 5
};

// Object: Enum Solarland.ESolarEMPParticleType
enum class ESolarEMPParticleType : uint8_t
{
	FadeIn = 0,
	FadeOut = 1,
	Loop = 2,
	ESolarEMPParticleType_MAX = 3
};

// Object: Enum Solarland.ESolarEMPForceFieldState
enum class ESolarEMPForceFieldState : uint8_t
{
	None = 0,
	Ready = 1,
	Active = 2,
	End = 3,
	ESolarEMPForceFieldState_MAX = 4
};

// Object: Enum Solarland.EHookState
enum class EHookState : uint8_t
{
	None = 0,
	Launching = 1,
	Hooked = 2,
	Retrieving = 3,
	EHookState_MAX = 4
};

// Object: Enum Solarland.EIncendiaryState
enum class EIncendiaryState : uint8_t
{
	None = 0,
	Burning = 1,
	Destroyed = 2,
	EIncendiaryState_MAX = 3
};

// Object: Enum Solarland.EPenetrateGrenadeState
enum class EPenetrateGrenadeState : uint8_t
{
	None = 0,
	Ready = 1,
	Damage = 2,
	Broken = 3,
	EPenetrateGrenadeState_MAX = 4
};

// Object: Enum Solarland.ECharacterStateForSkill
enum class ECharacterStateForSkill : uint8_t
{
	Jog = 0,
	Sprint = 1,
	Slide = 2,
	ZiplineSlidingRail = 3,
	CrouchIdle = 4,
	CrouchRun = 5,
	Falling = 6,
	Jump = 7,
	Launch = 8,
	Vault = 9,
	ECharacterStateForSkill_MAX = 10
};

// Object: Enum Solarland.ERoleSkillVoiceType
enum class ERoleSkillVoiceType : uint8_t
{
	None = 0,
	SuperSkillVoice = 1,
	TacticalSkillOneVoice = 2,
	TacticalSkillTwoVoice = 3,
	ERoleSkillVoiceType_MAX = 4
};

// Object: Enum Solarland.EParamaterChangeState
enum class EParamaterChangeState : uint8_t
{
	BlendIn = 0,
	Actived = 1,
	BlendOut = 2,
	Finished = 3,
	EParamaterChangeState_MAX = 4
};

// Object: Enum Solarland.EParamterCurveType
enum class EParamterCurveType : uint8_t
{
	Scalar = 0,
	Vector = 1,
	EParamterCurveType_MAX = 2
};

// Object: Enum Solarland.ETempShieldFXTriggerType
enum class ETempShieldFXTriggerType : uint8_t
{
	None = 0,
	OnGiveTempShield = 1,
	OnRecoverCharacterShield = 2,
	ETempShieldFXTriggerType_MAX = 3
};

// Object: Enum Solarland.ETempShieldOverflowType
enum class ETempShieldOverflowType : uint8_t
{
	ChargeTempShield = 0,
	ChargeShieldFirst = 1,
	ETempShieldOverflowType_MAX = 2
};

// Object: Enum Solarland.ESolarSurroundLightningApplyType
enum class ESolarSurroundLightningApplyType : uint8_t
{
	SurroundLightningApplyType_Character = 0,
	SurroundLightningApplyType_Vehicle = 1,
	SurroundLightningApplyType_Other = 2,
	SurroundLightningApplyType_MAX = 3
};

// Object: Enum Solarland.EMontageDataTriggerType
enum class EMontageDataTriggerType : uint8_t
{
	None = 0,
	Start = 1,
	BlendIn = 2,
	BlendOut = 3,
	End = 4,
	CustomDelay = 5,
	EMontageDataTriggerType_MAX = 6
};

// Object: Enum Solarland.EMontageUserDataType
enum class EMontageUserDataType : uint8_t
{
	None = 0,
	SpecABP = 1,
	OverrideAsset = 2,
	OverlayAdditive = 3,
	EMontageUserDataType_MAX = 4
};

// Object: Enum Solarland.ESkyIslandNoticeCondition
enum class ESkyIslandNoticeCondition : uint8_t
{
	Everybody = 0,
	OnlyInIsland = 1,
	ESkyIslandNoticeCondition_MAX = 2
};

// Object: Enum Solarland.ESkyIslandNoticeType
enum class ESkyIslandNoticeType : uint8_t
{
	None = 0,
	PreOpen = 1,
	Open = 2,
	CloseSoon = 3,
	Close = 4,
	ForbidSelfResurrection = 5,
	ESkyIslandNoticeType_MAX = 6
};

// Object: Enum Solarland.ESkyIslandTransporterType
enum class ESkyIslandTransporterType : uint8_t
{
	GetOn = 0,
	GetOff = 1,
	ESkyIslandTransporterType_MAX = 2
};

// Object: Enum Solarland.ESolarSkyIslandState
enum class ESolarSkyIslandState : uint8_t
{
	PreOpen = 0,
	Open = 1,
	Close = 2,
	Destroy = 3,
	ESolarSkyIslandState_MAX = 4
};

// Object: Enum Solarland.ESlotMachineRewardQuality
enum class ESlotMachineRewardQuality : uint8_t
{
	None = 0,
	Blue = 1,
	Purple = 2,
	Gold = 3,
	ESlotMachineRewardQuality_MAX = 4
};

// Object: Enum Solarland.ESlotMachineState
enum class ESlotMachineState : uint8_t
{
	None = 0,
	Idle = 1,
	Tossing = 2,
	Drawing = 3,
	Resulting = 4,
	Bursting = 5,
	ESlotMachineState_MAX = 6
};

// Object: Enum Solarland.ESmokeGrenadeState
enum class ESmokeGrenadeState : uint8_t
{
	Fly = 0,
	Smoke = 1,
	ESmokeGrenadeState_MAX = 2
};

// Object: Enum Solarland.ESmokeGrenadeSpawnType
enum class ESmokeGrenadeSpawnType : uint8_t
{
	None = 0,
	Normal = 1,
	Devil = 2,
	ESmokeGrenadeSpawnType_MAX = 3
};

// Object: Enum Solarland.ESolarSmoothOption
enum class ESolarSmoothOption : uint8_t
{
	Linear = 0,
	EaseInSine = 1,
	EaseOutSine = 2,
	EaseInOutSine = 3,
	EaseInQuad = 4,
	EaseOutQuad = 5,
	EaseInOutQuad = 6,
	EaseInCubic = 7,
	EaseOutCubic = 8,
	EaseInOutCubic = 9,
	EaseInQuart = 10,
	EaseOutQuart = 11,
	EaseInOutQuart = 12,
	EaseInQuint = 13,
	EaseOutQuint = 14,
	EaseInOutQuint = 15,
	EaseInExpo = 16,
	EaseOutExpo = 17,
	EaseInOutExpo = 18,
	Custom = 19,
	ESolarSmoothOption_MAX = 20
};

// Object: Enum Solarland.ESpatialAudioDiffractionBuildMode
enum class ESpatialAudioDiffractionBuildMode : uint8_t
{
	Default = 0,
	ForceBuild = 1,
	ForceIgnore = 2,
	ESpatialAudioDiffractionBuildMode_MAX = 3
};

// Object: Enum Solarland.ESolarSpatialAudioRoomShowDebugOption
enum class ESolarSpatialAudioRoomShowDebugOption : uint8_t
{
	None = 0,
	OneFloor_Gound = 1,
	OneFloor_Voxels = 2,
	OneFloor_InnerWalls = 3,
	OneFloor_OuterWalls = 4,
	OneFloor_FloorBoundaries = 5,
	OneFloor_All = 6,
	Max = 7
};

// Object: Enum Solarland.ESolarSpatialAudioRoomVoxel
enum class ESolarSpatialAudioRoomVoxel : uint8_t
{
	None = 0,
	ObstacleInside = 1,
	ObstacleSurface = 2,
	EmptySpace = 3,
	FloorInsideRoom = 4,
	FloorOutsideRoom = 5,
	ESolarSpatialAudioRoomVoxel_MAX = 6
};

// Object: Enum Solarland.ESolarSpatialFindPathPriority
enum class ESolarSpatialFindPathPriority : uint8_t
{
	High = 0,
	Normal = 1,
	Approximate = 2,
	ESolarSpatialFindPathPriority_MAX = 3
};

// Object: Enum Solarland.ETriggerAILike
enum class ETriggerAILike : uint8_t
{
	None = 0,
	Kill = 1,
	BuyResurrection = 2,
	RespawnDevice = 3,
	ETriggerAILike_MAX = 4
};

// Object: Enum Solarland.ESpectatorMode
enum class ESpectatorMode : uint8_t
{
	DeathWatch = 0,
	Replay = 1,
	ESpectatorMode_MAX = 2
};

// Object: Enum Solarland.EStrongholdType
enum class EStrongholdType : uint8_t
{
	Default = 0,
	NormalPOI = 1,
	Skyland = 2,
	EStrongholdType_MAX = 3
};

// Object: Enum Solarland.EAIDogSoundGroup
enum class EAIDogSoundGroup : uint8_t
{
	None = 0,
	SpawnSound = 1,
	DestroySound = 2,
	MoveMarkSound = 3,
	CommandAcceptSound = 4,
	CommandDeniedSound = 5,
	MoveBlockSound = 6,
	StartMoveLoopSound = 7,
	EndMoveLoopSound = 8,
	DestroyNoticeSound = 9,
	LevelUpSound = 10,
	UpgradedSound = 11,
	RecycleSound = 12,
	AlertSound = 13,
	ExitUpgradedSound = 14,
	EAIDogSoundGroup_MAX = 15
};

// Object: Enum Solarland.EAIDogTurretState
enum class EAIDogTurretState : uint8_t
{
	Fire = 0,
	InReset = 1,
	Idle = 2,
	None = 3,
	EAIDogTurretState_MAX = 4
};

// Object: Enum Solarland.EAIDogDeadReason
enum class EAIDogDeadReason : uint8_t
{
	HealthToZero = 0,
	Recycle = 1,
	AutoRecycle = 2,
	None = 3,
	EAIDogDeadReason_MAX = 4
};

// Object: Enum Solarland.EOrderMoveFeedback
enum class EOrderMoveFeedback : uint8_t
{
	SummonerTooFar = 0,
	Failed = 1,
	AlreadyAtGoal = 2,
	NoPath = 3,
	DetourTooFar = 4,
	PartialPath = 5,
	FullPath = 6,
	Blocked = 7,
	Abort_Paralyzed = 8,
	Abort_BlackHole = 9,
	Affected_WindField = 10,
	ReachedGoal = 11,
	EOrderMoveFeedback_MAX = 12
};

// Object: Enum Solarland.ESummonFailedReason
enum class ESummonFailedReason : uint8_t
{
	E_None = 0,
	E_UnKnowError = 1,
	E_QuickSummonNavMeshFailed = 2,
	E_NormalCheckFailed = 3,
	E_RoomCheckFailed = 4,
	E_ForbiddenSurfacesFailed = 5,
	E_PlaneEnoughFailed = 6,
	E_PhysMaterialFailed = 7,
	E_SurfaceActorClassFailed = 8,
	E_ChannelTestFailed = 9,
	E_WaterCheckFailed = 10,
	E_OverlapActorFailed = 11,
	E_CustomCheckMeshFailed = 12,
	E_ValidateStartLocationFailed = 13,
	E_ValidateTraceEndFailed = 14,
	E_ValidateTraceBlockFailed = 15,
	E_SummonTowerZiplineFailed = 16,
	E_MAX = 17
};

// Object: Enum Solarland.ESolarSummonOwlMoveMode
enum class ESolarSummonOwlMoveMode : uint8_t
{
	E_Stop = 0,
	E_ToPointPath = 1,
	E_CatchedMove = 2,
	E_TrackTarget = 3,
	E_MAX = 4
};

// Object: Enum Solarland.ETabControlListStyle
enum class ETabControlListStyle : uint8_t
{
	None = 0,
	Text = 1,
	Icon = 2,
	ETabControlListStyle_MAX = 3
};

// Object: Enum Solarland.ETabControlListSlotType
enum class ETabControlListSlotType : uint8_t
{
	Leaf = 0,
	Compound = 1,
	ETabControlListSlotType_MAX = 2
};

// Object: Enum Solarland.ESolarTablesEnum_ResourceType
enum class ESolarTablesEnum_ResourceType : uint8_t
{
	Hero = 0,
	HeroSkin = 1,
	WeaponSkin = 2,
	SubTier = 3,
	Season = 4,
	WeaponType = 5,
	Buddy = 6,
	ParentTier = 7,
	_Count = 8,
	ESolarTablesEnum_MAX = 9
};

// Object: Enum Solarland.ESolarTablesEnum_CalculatingSign
enum class ESolarTablesEnum_CalculatingSign : uint8_t
{
	Plus = 0,
	Multiplication = 1,
	Equal = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Object: Enum Solarland.ESolarTablesEnum_PartsType
enum class ESolarTablesEnum_PartsType : uint8_t
{
	Muzzle = 0,
	Scope = 1,
	Clip = 2,
	Runes = 3,
	Grip = 4,
	GunStock = 5,
	Scope2x = 6,
	Scope4x = 7,
	Scope8x = 8,
	_Count = 9,
	ESolarTablesEnum_MAX = 10
};

// Object: Enum Solarland.ESolarTablesEnum_AccessoryType
enum class ESolarTablesEnum_AccessoryType : uint8_t
{
	WeaponParts = 0,
	WeaponAmmo = 1,
	_Count = 2,
	ESolarTablesEnum_MAX = 3
};

// Object: Enum Solarland.ESolarTablesEnum_FireCostType
enum class ESolarTablesEnum_FireCostType : uint8_t
{
	Descrete = 0,
	Continuous = 1,
	_Count = 2,
	ESolarTablesEnum_MAX = 3
};

// Object: Enum Solarland.ESolarTablesEnum_TriggerType
enum class ESolarTablesEnum_TriggerType : uint8_t
{
	KeyDown = 0,
	KeyUp = 1,
	KeyHold = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Object: Enum Solarland.ESolarTablesEnum_TrajectoryType
enum class ESolarTablesEnum_TrajectoryType : uint8_t
{
	Line = 0,
	LineGravity = 1,
	Curve = 2,
	Canister = 3,
	Beam = 4,
	Rocket = 5,
	VirtualBullet = 6,
	_Count = 7,
	ESolarTablesEnum_MAX = 8
};

// Object: Enum Solarland.ESolarTablesEnum_FireMethodType
enum class ESolarTablesEnum_FireMethodType : uint8_t
{
	Bullet = 0,
	Skill = 1,
	SummonBullet = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Object: Enum Solarland.ESolarTablesEnum_WeaponType
enum class ESolarTablesEnum_WeaponType : uint8_t
{
	AssualtRifle = 0,
	Submachinegun = 1,
	Shotgun = 2,
	Sniper = 3,
	Vehicle = 4,
	ItemWeapon = 5,
	SummonWeapon = 6,
	AntiVehicle = 7,
	_Count = 8,
	ESolarTablesEnum_MAX = 9
};

// Object: Enum Solarland.ESolarTablesEnum_TrigerType
enum class ESolarTablesEnum_TrigerType : uint8_t
{
	GameTime = 0,
	AliveCount = 1,
	RealTime = 2,
	MatchRoundTime = 3,
	GameWorldTime = 4,
	_Count = 5,
	ESolarTablesEnum_MAX = 6
};

// Object: Enum Solarland.ESolarTablesEnum_CategoryType
enum class ESolarTablesEnum_CategoryType : uint8_t
{
	CategoryType_None = 0,
	CategoryType_Reco = 1,
	CategoryType_Character = 2,
	CategoryType_CharacterSkin = 3,
	CategoryType_WeaponSkin = 4,
	CategoryType_Capsule = 5,
	CategoryType_Bag = 6,
	CategoryType_Tail = 7,
	CategoryType_Home = 8,
	CategoryType_Others = 9,
	_Count = 10,
	ESolarTablesEnum_MAX = 11
};

// Object: Enum Solarland.ESolarTablesEnum_ShareType
enum class ESolarTablesEnum_ShareType : uint8_t
{
	ActionType_None = 0,
	ShareType_RankShare = 1,
	ShareType_BattlePassShare = 2,
	ShareType_AchieveItemShare = 3,
	ShareType_ScoreShare = 4,
	ShareType_LoginActivityShare = 5,
	ShareType_MedalShare = 6,
	ShareType_UserGrowthShare = 7,
	ShareType_FollowCommunity = 8,
	ShareType_PersonalHistory = 9,
	ShareType_IdolShare = 10,
	_Count = 11,
	ESolarTablesEnum_MAX = 12
};

// Object: Enum Solarland.ESolarTablesEnum_ReplayShortcutCategory
enum class ESolarTablesEnum_ReplayShortcutCategory : uint8_t
{
	Camera = 0,
	UI = 1,
	Advance = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Object: Enum Solarland.ESolarTablesEnum_ReplayShortcutShowType
enum class ESolarTablesEnum_ReplayShortcutShowType : uint8_t
{
	Never = 0,
	General = 1,
	ViewControl = 2,
	FreeView = 3,
	Spectate = 4,
	FPP = 5,
	Lock = 6,
	FreeLookAt = 7,
	AutoDirector = 8,
	AutoComment = 9,
	_Count = 10,
	ESolarTablesEnum_MAX = 11
};

// Object: Enum Solarland.ESolarTablesEnum_HighlightCameraEffect
enum class ESolarTablesEnum_HighlightCameraEffect : uint8_t
{
	None = 0,
	ThirdPerson = 1,
	CloseUp = 2,
	VictimPerspective = 3,
	FollowProjectile = 4,
	Sequence = 5,
	_Count = 6,
	ESolarTablesEnum_MAX = 7
};

// Object: Enum Solarland.ESolarTablesEnum_MeleeWeaponType
enum class ESolarTablesEnum_MeleeWeaponType : uint8_t
{
	Fist = 0,
	Knife = 1,
	Claw = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Object: Enum Solarland.ESolarTablesEnum_CharacterLightType
enum class ESolarTablesEnum_CharacterLightType : uint8_t
{
	None = 0,
	Idle = 1,
	CloseShot = 2,
	All = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Object: Enum Solarland.ESolarTablesEnum_ItemType
enum class ESolarTablesEnum_ItemType : uint8_t
{
	Weapon = 0,
	Blueprint = 1,
	Workbench = 2,
	Potion = 3,
	Food = 4,
	_Count = 5,
	ESolarTablesEnum_MAX = 6
};

// Object: Enum Solarland.ESolarTablesEnum_Enum_Test1
enum class ESolarTablesEnum_Enum_Test1 : uint8_t
{
	Test1 = 0,
	Test2 = 1,
	Test3 = 2,
	Test4 = 3,
	Test5 = 4,
	_Count = 5,
	ESolarTablesEnum_Enum_MAX = 6
};

// Object: Enum Solarland.ESolarTablesEnum_LobbyMatchEnterType
enum class ESolarTablesEnum_LobbyMatchEnterType : uint8_t
{
	CanClick = 0,
	PartialClick = 1,
	ForbidClick = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Object: Enum Solarland.ESolarTablesEnum_StackType
enum class ESolarTablesEnum_StackType : uint8_t
{
	StackByQTY = 0,
	StackByTime = 1,
	_Count = 2,
	ESolarTablesEnum_MAX = 3
};

// Object: Enum Solarland.ESolarTablesEnum_InputRelatedType
enum class ESolarTablesEnum_InputRelatedType : uint8_t
{
	InputRelatedNone = 0,
	Input_F = 1,
	InputRelated2 = 2,
	InputRelated3 = 3,
	InputRelated4 = 4,
	InputRelated5 = 5,
	InputRelated6 = 6,
	InputRelated7 = 7,
	InputRelated8 = 8,
	InputRelated9 = 9,
	InputRelated10 = 10,
	Input_J = 11,
	Input_Shift = 12,
	Input_SKillZ = 13,
	Input_SKillQ = 14,
	Input_SKillE = 15,
	Input_Emote = 16,
	Input_Reload = 17,
	Input_H = 18,
	Input_SKillX = 19,
	Input_T = 20,
	Input_G = 21,
	Input_FreeLook = 22,
	_Count = 23,
	ESolarTablesEnum_MAX = 24
};

// Object: Enum Solarland.ESolarTablesEnum_InputContextType
enum class ESolarTablesEnum_InputContextType : uint8_t
{
	InputCommon = 0,
	InputPlayer = 1,
	InputVehicle = 2,
	InputOB = 3,
	InputPlayerSkill = 4,
	InputActionWheel = 5,
	_Count = 6,
	ESolarTablesEnum_MAX = 7
};

// Object: Enum Solarland.ESolarTablesEnum_InputTabType
enum class ESolarTablesEnum_InputTabType : uint8_t
{
	InputTabPlayer = 0,
	InputTabVehicle = 1,
	InputTabOB = 2,
	InputTabMisc = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Object: Enum Solarland.ESolarTablesEnum_InputCtrlType
enum class ESolarTablesEnum_InputCtrlType : uint8_t
{
	InputCtrlHide = 0,
	InputCtrlShow = 1,
	InputCtrlCustom = 2,
	InputCtrlCustomAndCom = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Object: Enum Solarland.ESolarTablesEnum_GamepadCtrlType
enum class ESolarTablesEnum_GamepadCtrlType : uint8_t
{
	GamepadCtrlHide = 0,
	GamepadCtrlShowOnly = 1,
	GamepadCtrlCustom = 2,
	GamepadCtrlCustomAndCom = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Object: Enum Solarland.ESolarTablesEnum_InputGamepadType
enum class ESolarTablesEnum_InputGamepadType : uint8_t
{
	InputGamepadOneKey = 0,
	InputGamepadComKey = 1,
	InputGamepadFreeComKey = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Object: Enum Solarland.ESolarTablesEnum_ClassModeType
enum class ESolarTablesEnum_ClassModeType : uint8_t
{
	CLASS_MODE_NONE = 0,
	CLASS_MODE_V13_3 = 1,
	CLASS_MODE_UniqueSkill = 2,
	CLASS_MODE_RoleGrow = 3,
	CLASS_MODE_OFFLINE = 4,
	_Count = 5,
	ESolarTablesEnum_MAX = 6
};

// Object: Enum Solarland.ESolarTablesEnum_ExcuterType
enum class ESolarTablesEnum_ExcuterType : uint8_t
{
	AirDrop = 0,
	GasCircle = 1,
	Bomb = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Object: Enum Solarland.ESolarTablesEnum_DisplayType
enum class ESolarTablesEnum_DisplayType : uint8_t
{
	None = 0,
	Tips = 1,
	Window = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Object: Enum Solarland.ESolarTablesEnum_JumpType
enum class ESolarTablesEnum_JumpType : uint8_t
{
	ActionType_None = 0,
	JumpType_Liveshow = 1,
	_Count = 2,
	ESolarTablesEnum_MAX = 3
};

// Object: Enum Solarland.ESolarTablesEnum_ChestType
enum class ESolarTablesEnum_ChestType : uint8_t
{
	AirDrop = 0,
	ElecChest = 1,
	TacticalBox = 2,
	SlotMachine = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Object: Enum Solarland.ESolarTablesEnum_Duration
enum class ESolarTablesEnum_Duration : uint8_t
{
	Day = 0,
	Week = 1,
	Month = 2,
	Year = 3,
	Never = 4,
	None = 5,
	_Count = 6,
	ESolarTablesEnum_MAX = 7
};

// Object: Enum Solarland.ESolarTablesEnum_CharacterLevelUpType
enum class ESolarTablesEnum_CharacterLevelUpType : uint8_t
{
	Health = 0,
	Damage = 1,
	Movement = 2,
	FlyCooldown = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Object: Enum Solarland.ESolarTablesEnum_BehaviorType
enum class ESolarTablesEnum_BehaviorType : uint8_t
{
	SurvivalTime = 0,
	Kills = 1,
	Assists = 2,
	Selfhealing = 3,
	TeammateHealing = 4,
	Unpacking = 5,
	CollectElectricity = 6,
	PickExpPack = 7,
	EveryDamageDealt = 8,
	NpcKills = 9,
	NpcAssists = 10,
	TacticalBox = 11,
	ShieldUpgradeShop = 12,
	TeamDestroy = 13,
	RevengeKilling = 14,
	WeakReward = 15,
	KillDown = 16,
	AssistingKillDown = 17,
	OpenAirDrop = 18,
	OpenHotSpringBox = 19,
	ReviveTeamates = 20,
	ReviveReward = 21,
	HelpReward = 22,
	CollectBuddy = 23,
	CollectRareBuddy = 24,
	DynamicKillDown = 25,
	DynamicAssistingKillDown = 26,
	ScanningConsoleDevice = 27,
	PoisonProphetDevice = 28,
	BuddyMachine = 29,
	CollectGoldBuddy = 30,
	VaultDoor = 31,
	CargoBot = 32,
	RevivalModeReviveTeammates = 33,
	_Count = 34,
	ESolarTablesEnum_MAX = 35
};

// Object: Enum Solarland.ESolarTablesEnum_Enum_Behavior
enum class ESolarTablesEnum_Enum_Behavior : uint8_t
{
	Behavior1 = 0,
	Behavior2 = 1,
	Behavior3 = 2,
	Behavior4 = 3,
	Behavior5 = 4,
	Behavior6 = 5,
	Behavior7 = 6,
	Behavior8 = 7,
	Behavior9 = 8,
	Behavior10 = 9,
	Behavior11 = 10,
	Behavior12 = 11,
	Behavior13 = 12,
	Behavior14 = 13,
	Behavior15 = 14,
	Behavior16 = 15,
	Behavior17 = 16,
	Behavior18 = 17,
	Behavior19 = 18,
	Behavior20 = 19,
	Behavior21 = 20,
	Behavior22 = 21,
	Behavior23 = 22,
	Behavior24 = 23,
	Behavior25 = 24,
	Behavior26 = 25,
	Behavior27 = 26,
	Behavior28 = 27,
	Behavior29 = 28,
	Behavior30 = 29,
	Behavior31 = 30,
	Behavior32 = 31,
	Behavior33 = 32,
	Behavior34 = 33,
	_Count = 34,
	ESolarTablesEnum_Enum_MAX = 35
};

// Object: Enum Solarland.ESolarTablesEnum_ActionType
enum class ESolarTablesEnum_ActionType : uint8_t
{
	ActionType_None = 0,
	ActionType_OpenGift = 1,
	ActionType_Charge = 2,
	ActionType_Battle = 3,
	ActionType_Mail = 4,
	ActionType_ShopBuy = 5,
	ActionType_DailyTask = 6,
	ActionType_Activity = 7,
	ActionType_Guid = 8,
	ActionType_GM = 9,
	ActionType_BattleBag = 10,
	ActionType_ItemUse = 11,
	ActionType_Refund = 12,
	ActionType_BattleDouble = 13,
	ActionType_UnitProf = 14,
	ActionType_SanctuaryBuild = 15,
	ActionType_SanctuaryFacility = 16,
	ActionType_Weapon_Upgrade = 17,
	ActionType_Activereward = 18,
	ActionType_ComposeItem = 19,
	ActionType_LoginReward = 20,
	ActionType_NewUserLogin = 21,
	ActionType_HomeDailyTask = 22,
	ActionType_BattlePass = 23,
	ActionType_LevelReward = 24,
	ActionType_HomeUpgrade = 25,
	ActionType_BattlePassRepeat = 26,
	ActionType_TopUP = 27,
	ActionType_Achievement = 28,
	ActionType_LuckDraw = 29,
	ActionType_BattlePassShare = 30,
	ActionType_CDKey = 31,
	ActionType_HalfMonthLogin = 32,
	ActionType_MonthlyEvent = 33,
	ActionType_FriendEvent = 34,
	ActionType_WeekChanllenge = 35,
	ActionType_RoomCard = 36,
	ActionType_BindAccount = 37,
	ActionType_UserGrowthEvent = 38,
	ActionType_SendGift = 39,
	ActionType_SellItem = 40,
	ActionType_CollectRedeem = 41,
	ActionType_RandomPack = 42,
	ActionType_Clan = 43,
	ActionType_Bet = 44,
	ActionType_BetBonus = 45,
	ActionType_BetReturn = 46,
	ActionType_CarouselDraw = 47,
	ActionType_WeekFree = 48,
	ActionType_TutorialLevelReward = 49,
	ActionType_TournamentMiss = 50,
	ActionType_TournamentReward = 51,
	ActionType_RankingCard = 52,
	ActionType_BattleSupplyBox = 53,
	ActionType_BattlePassMission = 54,
	ActionType_SupplyBox = 55,
	ActionType_VipcardReceive = 56,
	ActionType_VipcardSign = 57,
	ActionType_Vipcard = 58,
	ActionType_Signcard = 59,
	ActionType_ChangeName = 60,
	ActionType_ServerCard = 61,
	ActionType_ExResourceDownload = 62,
	ActionType_CustomServer_Renewal = 63,
	ActionType_NewLuckDraw = 64,
	ActionType_SerialTask = 65,
	ActionType_Rank = 66,
	ActionType_NewBP = 67,
	ActionType_NewBPReward = 68,
	ActionType_PermanentReward = 69,
	ActionType_NewTaskRefresh = 70,
	ActionType_ExchangeShop = 71,
	ActionType_BuyGiftBox = 72,
	ActionType_WeeklyShop = 73,
	ActionType_StageReward = 74,
	ActionType_PermanentDraw = 75,
	ActionType_PermanentDrawExchange = 76,
	ActionType_DiamondsRebate = 77,
	ActionType_PassBallReward = 78,
	ActionType_BattlePassDiamonds = 79,
	ActionType_LoginRewardNew = 80,
	ActionType_RankMatchReward = 81,
	ActionType_NewHeroReward = 82,
	ActionType_TopUpAccumulationReward = 83,
	ActionType_WeeklyShopBuy = 84,
	ActionType_WeeklyShopRefresh = 85,
	ActionType_BpcoinsPurchase = 86,
	ActionType_NewBPElite = 87,
	ActionType_HighlightShare = 88,
	ActionType_EventsOverview = 89,
	ActionType_ItemGifted = 90,
	ActionType_HighlightReward = 91,
	ActionType_PointBox = 92,
	ActionType_CashCoupon = 93,
	ActionType_InvitePeopleReward = 94,
	ActionType_RoundReward = 95,
	ActionType_PrivBondingReward = 96,
	ActionType_CollegePrivilegeReward = 97,
	ActionType_LongTermActive = 98,
	ActionType_MysteriousShop = 99,
	ActionType_ExploreEvent = 100,
	ActionType_PointReward = 101,
	ActionType_PlayTogether = 102,
	ActionType_HealCenter = 103,
	ActionType_ItemManagement = 104,
	ActionType_PizzaShop = 105,
	ActionType_TimeGoal = 106,
	ActionType_ActivenessStepReward = 107,
	ActionType_BuyChargeGiftBox = 108,
	ActionType_Return = 109,
	ActionType_ReturnBox = 110,
	ActionType_ReturnLoginGold = 111,
	ActionType_ChineseNewYear = 112,
	ActionType_ChineseNewYearShop = 113,
	ActionType_TowerClimb = 114,
	ActionType_ReturnLoginBindReward = 115,
	_Count = 116,
	ESolarTablesEnum_MAX = 117
};

// Object: Enum Solarland.ETaskStatus
enum class ETaskStatus : uint8_t
{
	Runing = 0,
	Completed = 1,
	ReceiveAward = 2,
	ETaskStatus_MAX = 3
};

// Object: Enum Solarland.ETitanAIState
enum class ETitanAIState : uint8_t
{
	Idle = 0,
	GoBackHome = 1,
	ETitanAIState_MAX = 2
};

// Object: Enum Solarland.ETornadoRecoveryState
enum class ETornadoRecoveryState : uint8_t
{
	None = 0,
	ToSkyDive = 1,
	ToFalling = 2,
	ETornadoRecoveryState_MAX = 3
};

// Object: Enum Solarland.ETornadoLeaveReason
enum class ETornadoLeaveReason : uint8_t
{
	None = 0,
	ReachHeight = 1,
	ReachDist = 2,
	Block = 3,
	Teleport = 4,
	CharacterDead = 5,
	TornadoEnd = 6,
	ETornadoLeaveReason_MAX = 7
};

// Object: Enum Solarland.ETornadoState
enum class ETornadoState : uint8_t
{
	None = 0,
	BuddyBegin = 1,
	BuddyAppear = 2,
	BuddyLoop = 3,
	BuddyDisappear = 4,
	TornadoEffecting = 5,
	TornadoEnd = 6,
	ETornadoState_MAX = 7
};

// Object: Enum Solarland.ETutRookieBattleMarkType
enum class ETutRookieBattleMarkType : uint8_t
{
	AirDropLanded = 0,
	ApproachShieldUpgrade = 1,
	ApproachBuddy = 2,
	ApproachDeathBox = 3,
	ApproachRespawnDevice = 4,
	ETutRookieBattleMarkType_MAX = 5
};

// Object: Enum Solarland.ETutorialMaskType
enum class ETutorialMaskType : uint8_t
{
	Rectangle = 0,
	Circle = 1,
	ETutorialMaskType_MAX = 2
};

// Object: Enum Solarland.ETutorialGestureHandType
enum class ETutorialGestureHandType : uint8_t
{
	Right = 0,
	Left = 1,
	ETutorialGestureHandType_MAX = 2
};

// Object: Enum Solarland.ETutorialGestureType
enum class ETutorialGestureType : uint8_t
{
	None = 0,
	Click = 1,
	SlideUp = 2,
	SlideRight = 3,
	SlideLeft = 4,
	ETutorialGestureType_MAX = 5
};

// Object: Enum Solarland.FTutCommonTipType
enum class EFTutCommonTipType : uint8_t
{
	None = 0,
	Style1 = 1,
	Style2 = 2,
	FTutCommonTipType_MAX = 3
};

// Object: Enum Solarland.ETutorialUIType
enum class ETutorialUIType : uint8_t
{
	None = 0,
	Common = 1,
	Special = 2,
	PanelStyle1 = 3,
	ETutorialUIType_MAX = 4
};

// Object: Enum Solarland.ETutorialNodeType
enum class ETutorialNodeType : uint8_t
{
	Single = 0,
	Parallel = 1,
	Delay = 2,
	ETutorialNodeType_MAX = 3
};

// Object: Enum Solarland.ELevelRewardStatus
enum class ELevelRewardStatus : uint8_t
{
	NotClaimed = 0,
	Claimed = 1,
	Disable = 2,
	ELevelRewardStatus_MAX = 3
};

// Object: Enum Solarland.EWidgetPlayAnimationFlag
enum class EWidgetPlayAnimationFlag : uint8_t
{
	None = 0,
	Finish = 1,
	EWidgetPlayAnimationFlag_MAX = 2
};

// Object: Enum Solarland.EWidgetInteractionFlag
enum class EWidgetInteractionFlag : uint8_t
{
	None = 0,
	Pressed = 1,
	Released = 2,
	Clicked = 3,
	EWidgetInteractionFlag_MAX = 4
};

// Object: Enum Solarland.ETutorialPremiseFlag
enum class ETutorialPremiseFlag : uint8_t
{
	Default = 0,
	BotBR = 1,
	MatchBR = 2,
	ETutorialPremiseFlag_MAX = 3
};

// Object: Enum Solarland.ETutorialStage
enum class ETutorialStage : uint8_t
{
	None = 0,
	Lobby = 1,
	BattleField = 2,
	TutorialLevel = 4,
	ETutorialStage_MAX = 5
};

// Object: Enum Solarland.ETutorialConditionType
enum class ETutorialConditionType : uint8_t
{
	None = 0,
	Trigger = 1,
	Interrupt = 2,
	Finish = 3,
	ForeverClose = 4,
	ETutorialConditionType_MAX = 5
};

// Object: Enum Solarland.ETutorialType
enum class ETutorialType : uint8_t
{
	TEvent = 0,
	TTick = 1,
	ETutorialType_MAX = 2
};

// Object: Enum Solarland.ETutGameProgressType
enum class ETutGameProgressType : uint8_t
{
	None = 0,
	Entry = 1,
	CruiseEnd = 2,
	ETutGameProgressType_MAX = 3
};

// Object: Enum Solarland.ETutOperationTimesType
enum class ETutOperationTimesType : uint8_t
{
	None = 0,
	AutoPickup = 1,
	AutoOpenDoor = 2,
	ETutOperationTimesType_MAX = 3
};

// Object: Enum Solarland.ETutApproachActorType
enum class ETutApproachActorType : uint8_t
{
	None = 0,
	ShieldUpgrade = 1,
	Buddy = 2,
	DeathBox = 3,
	RespawnDevice = 4,
	ETutApproachActorType_MAX = 5
};

// Object: Enum Solarland.ETutInteractionActorSpawnType
enum class ETutInteractionActorSpawnType : uint8_t
{
	None = 0,
	Airdrop = 1,
	ExpSpring = 2,
	AirShip = 3,
	ETutInteractionActorSpawnType_MAX = 4
};

// Object: Enum Solarland.EPlayerProficiency
enum class EPlayerProficiency : uint8_t
{
	None = 0,
	Rookie = 1,
	FPS = 2,
	Veteran = 3,
	EPlayerProficiency_MAX = 4
};

// Object: Enum Solarland.EUAVRescueState
enum class EUAVRescueState : uint8_t
{
	None = 0,
	Idle = 1,
	Heal = 2,
	Navigate = 3,
	Rescue = 4,
	EUAVRescueState_MAX = 5
};

// Object: Enum Solarland.EWidgetPassiveMode
enum class EWidgetPassiveMode : uint8_t
{
	Normal = 0,
	Passive_Buff = 1,
	Passive_Debuff = 2,
	EWidgetPassiveMode_MAX = 3
};

// Object: Enum Solarland.EPlayDoorWarnVoiceMoment
enum class EPlayDoorWarnVoiceMoment : uint8_t
{
	Interaction = 0,
	PostInteraction = 1,
	EPlayDoorWarnVoiceMoment_MAX = 2
};

// Object: Enum Solarland.EVaultDoorState
enum class EVaultDoorState : uint8_t
{
	Closed = 0,
	Interacting = 1,
	PreOpen = 2,
	Opening = 3,
	Opened = 4,
	EVaultDoorState_MAX = 5
};

// Object: Enum Solarland.EVaultDoorInteractType
enum class EVaultDoorInteractType : uint8_t
{
	CanNotInteract = 0,
	CanOpen = 1,
	Opening = 2,
	WaitForceOpen = 3,
	CanExposeKey = 4,
	ExposeKeyCD = 5,
	EVaultDoorInteractType_MAX = 6
};

// Object: Enum Solarland.EVaultDoorKeyLocationType
enum class EVaultDoorKeyLocationType : uint8_t
{
	None = 0,
	Ground = 1,
	UVA = 2,
	Enemy = 3,
	Teammate = 4,
	EVaultDoorKeyLocationType_MAX = 5
};

// Object: Enum Solarland.EVehicleRotateAnimationType
enum class EVehicleRotateAnimationType : uint8_t
{
	None = 0,
	Right_90 = 1,
	Right_180 = 2,
	Left_90 = 3,
	Left_180 = 4,
	Right = 5,
	Left = 6,
	EVehicleRotateAnimationType_MAX = 7
};

// Object: Enum Solarland.EVehicleTypeOnDisplayUI
enum class EVehicleTypeOnDisplayUI : uint8_t
{
	Normal = 0,
	BigCannon = 1,
	CloudBuddy = 2,
	EVehicleTypeOnDisplayUI_MAX = 3
};

// Object: Enum Solarland.EIronManHandPart
enum class EIronManHandPart : uint8_t
{
	LeftHand = 0,
	RightHand = 1,
	EIronManHandPart_MAX = 2
};

// Object: Enum Solarland.EIronManSoundEvent
enum class EIronManSoundEvent : uint8_t
{
	LaserHit = 0,
	EIronManSoundEvent_MAX = 1
};

// Object: Enum Solarland.EPreloadVehicleUIType
enum class EPreloadVehicleUIType : uint8_t
{
	None = 0,
	CrossHairUI = 1,
	VehicleSpecialUI = 2,
	EPreloadVehicleUIType_MAX = 3
};

// Object: Enum Solarland.EPlayerInputMask
enum class EPlayerInputMask : uint8_t
{
	Invalidated = 0,
	VehicleBraking = 1,
	VehicleTrumpet = 2,
	VehicleAutoMove = 4,
	All = 7,
	EPlayerInputMask_MAX = 8
};

// Object: Enum Solarland.EHoverVehicleVFXType
enum class EHoverVehicleVFXType : uint8_t
{
	Forward = 0,
	Backward = 1,
	Right = 2,
	Left = 3,
	Max = 4
};

// Object: Enum Solarland.EEnterWaterVFX
enum class EEnterWaterVFX : uint8_t
{
	HorizontalLightEffect = 0,
	HorizontalHeavyEffect = 1,
	VerticalLightEffect = 2,
	VerticalHeavyEffect = 3,
	MAX = 4
};

// Object: Enum Solarland.ECorrectionReason
enum class ECorrectionReason : uint8_t
{
	ClientTimeDiscrepancy = 0,
	InvalidSpeed = 1,
	TooShortDeltaTime = 2,
	WaitingForClientConfirm = 3,
	InvalidCollision = 4,
	FloatingInAir = 5,
	StandingOnUnwalkableVehicle = 6,
	ECorrectionReason_MAX = 7
};

// Object: Enum Solarland.EVehicleSpawnSourceType
enum class EVehicleSpawnSourceType : uint8_t
{
	CommonSpawn = 0,
	VehicleSummonWeapon = 1,
	EVehicleSpawnSourceType_MAX = 2
};

// Object: Enum Solarland.EVehicleControlUIType
enum class EVehicleControlUIType : uint8_t
{
	Vehicle = 0,
	Character = 1,
	None = 2,
	EVehicleControlUIType_MAX = 3
};

// Object: Enum Solarland.EVehicleRotateCondition
enum class EVehicleRotateCondition : uint8_t
{
	None = 0,
	Forward = 1,
	Backward = 2,
	Right = 4,
	Left = 8,
	All = 15,
	EVehicleRotateCondition_MAX = 16
};

// Object: Enum Solarland.EVehicleOpenTips
enum class EVehicleOpenTips : uint8_t
{
	FloorCanNotOpen = 0,
	SpeedCanNotOpen = 1,
	EVehicleOpenTips_MAX = 2
};

// Object: Enum Solarland.ESiegeVehicleAnimation
enum class ESiegeVehicleAnimation : uint8_t
{
	CloseIdle = 0,
	OpenIdle = 1,
	Fire = 2,
	ESiegeVehicleAnimation_MAX = 3
};

// Object: Enum Solarland.EVehicleDamageStatus
enum class EVehicleDamageStatus : uint8_t
{
	Normal = 0,
	Damaged = 1,
	SeriouslyDamaged = 2,
	BrokenDanger = 3,
	Broken = 4,
	MAX = 5
};

// Object: Enum Solarland.EVehicleAnimationState
enum class EVehicleAnimationState : uint8_t
{
	None = 0,
	Jump = 1,
	Dash = 2,
	TakingOff = 3,
	Cruising = 4,
	PreJump = 5,
	Flying = 6,
	Deactivate = 7,
	TimesUp = 8,
	Dead = 9,
	EVehicleAnimationState_MAX = 10
};

// Object: Enum Solarland.ERocketFireMode
enum class ERocketFireMode : uint8_t
{
	NomalFire = 0,
	PrecisionFire = 1,
	Max = 2
};

// Object: Enum Solarland.EVehiclePageType
enum class EVehiclePageType : uint8_t
{
	Lobby = 0,
	VehicleBag = 1,
	BattlePass = 2,
	LuckDraw = 3,
	GetReward = 4,
	GrowTask = 5,
	Shop = 6,
	CarouselDraw = 7,
	SupplyBoxDetail = 8,
	SupplyBoxRaffle = 9,
	Max = 10
};

// Object: Enum Solarland.EVehicleSpawnEffectType
enum class EVehicleSpawnEffectType : uint8_t
{
	None = 0,
	RefreshingProgress = 1,
	PreVehicleSummon = 2,
	EVehicleSpawnEffectType_MAX = 3
};

// Object: Enum Solarland.EVehicleSpawnerType
enum class EVehicleSpawnerType : uint8_t
{
	Default = 0,
	Boss = 1,
	EVehicleSpawnerType_MAX = 2
};

// Object: Enum Solarland.EVehicleState
enum class EVehicleState : uint8_t
{
	None = 0,
	Ground = 1,
	Air = 2,
	Sliding = 3,
	EVehicleState_MAX = 4
};

// Object: Enum Solarland.EWaterWallSpawnState
enum class EWaterWallSpawnState : uint8_t
{
	E_NotSpawned = 0,
	E_Spawning = 1,
	E_Spawned = 2,
	E_WaitingDestroy = 3,
	E_MAX = 4
};

// Object: Enum Solarland.ESolarWeaponSpreadState
enum class ESolarWeaponSpreadState : uint8_t
{
	Standby = 0,
	Approach = 1,
	Recover = 2,
	ESolarWeaponSpreadState_MAX = 3
};

// Object: Enum Solarland.ESolarBlackHoleParticle
enum class ESolarBlackHoleParticle : uint8_t
{
	ForceField = 0,
	CoreFadeIn = 1,
	CoreFadeOut = 2,
	CoreLoop = 3,
	CoreHit = 4,
	Explode = 5,
	CharacterDebuff = 6,
	ESolarBlackHoleParticle_MAX = 7
};

// Object: Enum Solarland.ESolarBlackHoleState
enum class ESolarBlackHoleState : uint8_t
{
	None = 0,
	Startup = 1,
	Ready = 2,
	Active = 3,
	End = 4,
	ESolarBlackHoleState_MAX = 5
};

// Object: Enum Solarland.EWeaponOverloadState
enum class EWeaponOverloadState : uint8_t
{
	NormalDecrease = 0,
	FireSuspend = 1,
	ForceOverload = 2,
	EWeaponOverloadState_MAX = 3
};

// Object: Enum Solarland.EPlayerWeaponTypeForFireInput
enum class EPlayerWeaponTypeForFireInput : uint8_t
{
	AssaultRifle = 0,
	SubmachineGun = 1,
	ShotgunSingle = 2,
	ShotgunAuto = 3,
	SniperSingle = 4,
	SniperAuto = 5,
	ItemWeapon = 6,
	SpecialWeapon = 7,
	Max = 8
};

// Object: Enum Solarland.EFireDistType
enum class EFireDistType : uint8_t
{
	Close = 0,
	Medium = 1,
	Long = 2,
	None = 3,
	EFireDistType_MAX = 4
};

// Object: Enum Solarland.EWeaponControlCurvesScalerMoveSpeedType
enum class EWeaponControlCurvesScalerMoveSpeedType : uint8_t
{
	AllAxes = 0,
	XYAxes = 1,
	Forward = 2,
	Rightward = 3,
	Upward = 4,
	EWeaponControlCurvesScalerMoveSpeedType_MAX = 5
};

// Object: Enum Solarland.EVirtualBulletType
enum class EVirtualBulletType : uint8_t
{
	LinearBullet = 0,
	CurveBullet = 1,
	GravityBullet = 2,
	TracingBullet = 3,
	EVirtualBulletType_MAX = 4
};

// Object: Enum Solarland.ESolarPlayerWeaponTagType
enum class ESolarPlayerWeaponTagType : uint8_t
{
	WeaponType = 0,
	WeaponDifficulty = 1,
	WeaponProperties = 2,
	Max = 3
};

// Object: Enum Solarland.EWeaponScopeMagnification
enum class EWeaponScopeMagnification : uint8_t
{
	X1 = 0,
	X2 = 1,
	X3 = 2,
	X4 = 3,
	X6 = 4,
	X8 = 5,
	EWeaponScopeMagnification_MAX = 6
};

// Object: Enum Solarland.EWeaponSpreadShape
enum class EWeaponSpreadShape : uint8_t
{
	Ellipse = 0,
	Rectangle = 1,
	EWeaponSpreadShape_MAX = 2
};

// Object: Enum Solarland.EGearState
enum class EGearState : uint8_t
{
	Reverse = 0,
	Neutral = 1,
	Forward = 2,
	EGearState_MAX = 3
};

// Object: Enum Solarland.EUpgradeState
enum class EUpgradeState : uint8_t
{
	Locked = 0,
	Upgradable = 1,
	Upgraded = 2,
	EUpgradeState_MAX = 3
};

// Object: Enum Solarland.EInputEventHandleType
enum class EInputEventHandleType : uint8_t
{
	Unhandle = 0,
	SimulateKey = 1,
	BroadcastEvent = 2,
	SimulateTouch = 3,
	NoKeyOnly = 4,
	NoEventOnly = 5,
	NoTouchOnly = 6,
	HandleAll = 7,
	EInputEventHandleType_MAX = 8
};

// Object: Enum Solarland.ETouchMovePriority
enum class ETouchMovePriority : uint8_t
{
	Invalid = 0,
	Lowest = 1,
	Lower = 2,
	Normal = 3,
	Higher = 4,
	Highest = 5,
	ETouchMovePriority_MAX = 6
};

// Object: Enum Solarland.EWindFieldSoundType
enum class EWindFieldSoundType : uint8_t
{
	None = 0,
	SummonActivate = 1,
	SummonLoop = 2,
	SummonSuccess = 3,
	Death = 4,
	WindStart = 5,
	WindLoop = 6,
	WindEnd = 7,
	EWindFieldSoundType_MAX = 8
};

// Object: Enum Solarland.EWindFieldState
enum class EWindFieldState : uint8_t
{
	None = 0,
	Delay = 1,
	Prepare = 2,
	Activated = 3,
	FadeOut = 4,
	Finished = 5,
	EWindFieldState_MAX = 6
};

// Object: Enum Solarland.ESoundPoolSimpleRule
enum class ESoundPoolSimpleRule : uint8_t
{
	Random = 0,
	RandomNoRepeat = 1,
	Sequential = 2,
	ESoundPoolSimpleRule_MAX = 3
};

// Object: Enum Solarland.ESoundGroupContextLabel
enum class ESoundGroupContextLabel : uint8_t
{
	None = 0,
	IsSelf = 1,
	IsTeammate = 2,
	IsAttackingOther = 4,
	IsAttackedByOther = 8,
	HasSilencer = 16,
	IsInRoom = 32,
	ESoundGroupContextLabel_MAX = 33
};

// Object: Enum Solarland.ESolarImageProgressHalfCirclePrivotType
enum class ESolarImageProgressHalfCirclePrivotType : uint8_t
{
	MidLeft = 0,
	MidRight = 1,
	MidBottom = 2,
	MidTop = 4,
	ESolarImageProgressHalfCirclePrivotType_MAX = 5
};

// Object: Enum Solarland.ESolarImageProgressQuaterCirclePrivotType
enum class ESolarImageProgressQuaterCirclePrivotType : uint8_t
{
	LeftBottom = 0,
	RightBottom = 1,
	LeftTop = 16,
	RightTop = 17,
	ESolarImageProgressQuaterCirclePrivotType_MAX = 18
};

// Object: Enum Solarland.ESolarImageProgressLineDirType
enum class ESolarImageProgressLineDirType : uint8_t
{
	Horizantal = 0,
	Vertical = 1,
	ESolarImageProgressLineDirType_MAX = 2
};

// Object: Enum Solarland.ESolarImageProgressType
enum class ESolarImageProgressType : uint8_t
{
	None = 0,
	Line = 1,
	QuarterCircle = 2,
	HalfCircle = 3,
	Circle = 4,
	ESolarImageProgressType_MAX = 5
};

// Object: Enum Solarland.ESolarImageFillType
enum class ESolarImageFillType : uint8_t
{
	Normal = 0,
	Mirror = 1,
	Quarter = 2,
	ESolarImageFillType_MAX = 3
};

// Object: Enum Solarland.EStealFeedback
enum class EStealFeedback : uint8_t
{
	NoTarget = 0,
	StealFailed = 1,
	StealSuccess = 2,
	EStealFeedback_MAX = 3
};

// Object: Enum Solarland.StealResult
enum class EStealResult : uint8_t
{
	StealSuccess = 0,
	KilledWhenStealPlayer = 1,
	KilledWhenStealItem = 2,
	StealFailed = 3,
	StealResult_MAX = 4
};

// Object: Enum Solarland.EDisplayAttachType
enum class EDisplayAttachType : uint8_t
{
	None = 0,
	DeathBox = 1,
	TreasureBox = 2,
	AirDropBox = 3,
	ItemOnGround = 4,
	EDisplayAttachType_MAX = 5
};

// Object: Enum Solarland.EGoldenStealState
enum class EGoldenStealState : uint8_t
{
	None = 0,
	Spawn = 1,
	Idle = 2,
	End = 3,
	Killed = 4,
	EGoldenStealState_MAX = 5
};

// Object: Enum Solarland.EStealPokemonState
enum class EStealPokemonState : uint8_t
{
	None = 0,
	Spawned = 1,
	WaitForSend = 2,
	SendToSteal = 3,
	AppearToTarget = 4,
	FlyToTarget = 5,
	DisplayStealing = 6,
	DisplayStealingArroundPlayer = 7,
	ReturningSuccess = 8,
	ReturningFailed = 9,
	Killed = 10,
	End = 11,
	EStealPokemonState_MAX = 12
};

// Object: Enum Solarland.EEaseMode
enum class EEaseMode : uint8_t
{
	LinearIn = 0,
	QuadEaseIn = 1,
	QuadEaseOut = 2,
	CubicEaseIn = 3,
	CubicEaseOut = 4,
	EEaseMode_MAX = 5
};

// Object: Enum Solarland.EFollowCharacterRotationMode
enum class EFollowCharacterRotationMode : uint8_t
{
	None = 0,
	LookAtCharacter = 1,
	LookAtCamera = 2,
	EFollowCharacterRotationMode_MAX = 3
};

// Object: Enum Solarland.ESolarBarDisplayMode
enum class ESolarBarDisplayMode : uint8_t
{
	E_Hidden = 0,
	E_AlwaysShow = 1,
	E_ShowIfTakeDamage = 2,
	E_MAX = 3
};

// Object: Enum Solarland.ESolarSummonHPChangeReason
enum class ESolarSummonHPChangeReason : uint8_t
{
	E_DirectSet = 0,
	E_Heal = 1,
	E_Hit = 2,
	E_SelfDecay = 3,
	E_MAX = 4
};

// Object: Enum Solarland.ERefreshCause
enum class ERefreshCause : uint8_t
{
	ECause_None = 0,
	ECause_OutOrIntoScreen = 1,
	ECause_RescueStateChange = 2,
	ECause_MAX = 3
};

// Object: Enum Solarland.EThunderFlashPhase
enum class EThunderFlashPhase : uint8_t
{
	None = 0,
	Idle = 1,
	Move = 2,
	Start = 3,
	Loop = 4,
	End = 5,
	Max = 6
};

// Object: Enum Solarland.ETMFPSModeSetType
enum class ETMFPSModeSetType : uint8_t
{
	None = 0,
	ChangeCharacter = 1,
	ChangeSetting = 2,
	ETMFPSModeSetType_MAX = 3
};

// Object: Enum Solarland.ETrapGrenadeDecalParticleType
enum class ETrapGrenadeDecalParticleType : uint8_t
{
	Decal = 0,
	Warning = 1,
	Spawn = 2,
	SpawnEnd = 3,
	ETrapGrenadeDecalParticleType_MAX = 4
};

// Object: Enum Solarland.ETrapGrenadeState
enum class ETrapGrenadeState : uint8_t
{
	Flying = 0,
	Standby = 1,
	DecalWarning = 2,
	DecalLoop = 3,
	DecalEnd = 4,
	BrokenDueToLifeTime = 5,
	BrokenDueToDamage = 6,
	BrokenDueToDamageVolumeLifeTime = 7,
	ETrapGrenadeState_MAX = 8
};

// Object: Enum Solarland.EHotSpringLifeState
enum class EHotSpringLifeState : uint8_t
{
	None = 0,
	Normal = 1,
	Disappear = 2,
	Destoryed = 3,
	EHotSpringLifeState_MAX = 4
};

// Object: Enum Solarland.ECipherBoxOpenState
enum class ECipherBoxOpenState : uint8_t
{
	Closed = 0,
	Opening = 1,
	Opened = 2,
	ECipherBoxOpenState_MAX = 3
};

// Object: Enum Solarland.ECipherBoxType
enum class ECipherBoxType : uint8_t
{
	None = 0,
	AIRDROPBOX = 1,
	HOTSPRINTBOX = 2,
	ECipherBoxType_MAX = 3
};

// Object: Enum Solarland.ETreatmentAndShieldRecoverBuffType
enum class ETreatmentAndShieldRecoverBuffType : uint8_t
{
	E_None = 0,
	E_Treatment = 1,
	E_ShieldRecover = 2,
	E_MAX = 3
};

// Object: Enum Solarland.EInputCanelAbilityType
enum class EInputCanelAbilityType : uint8_t
{
	DoublePress = 0,
	Release = 1,
	EInputCanelAbilityType_MAX = 2
};

// Object: Enum Solarland.ETutMaskSupportType
enum class ETutMaskSupportType : uint8_t
{
	Rectangle = 0,
	Circle = 1,
	ETutMaskSupportType_MAX = 2
};

// Object: Enum Solarland.ESplineMeshType
enum class ESplineMeshType : uint8_t
{
	DEFAULT = 0,
	START = 1,
	END = 2,
	ESplineMeshType_MAX = 3
};

// Object: Enum Solarland.ETutFindUIPlanType
enum class ETutFindUIPlanType : uint8_t
{
	None = 0,
	BindAnim = 1,
	GuaranteedTick = 2,
	ETutFindUIPlanType_MAX = 3
};

// Object: Enum Solarland.ERingGhostParticleType
enum class ERingGhostParticleType : uint8_t
{
	Default = 0,
	Valid = 1,
	InValid = 2,
	ERingGhostParticleType_MAX = 3
};

// Object: Enum Solarland.EArmsProgressDisplayType
enum class EArmsProgressDisplayType : uint8_t
{
	None = 0,
	Self = 1,
	Next = 2,
	AllyFaction = 4,
	EnemyFaction = 8,
	EArmsProgressDisplayType_MAX = 9
};

// Object: Enum Solarland.ECountDownStyle
enum class ECountDownStyle : uint8_t
{
	Big = 0,
	Small = 1,
	ECountDownStyle_MAX = 2
};

// Object: Enum Solarland.EBackpackCapacityState
enum class EBackpackCapacityState : uint8_t
{
	Empty = 0,
	Equipped = 1,
	Lock = 2,
	EBackpackCapacityState_MAX = 3
};

// Object: Enum Solarland.EBackpackEquipState
enum class EBackpackEquipState : uint8_t
{
	None = 0,
	CanAssembly = 1,
	NoAssembly = 2,
	EBackpackEquipState_MAX = 3
};

// Object: Enum Solarland.EUIGeneralItemSlotState
enum class EUIGeneralItemSlotState : uint8_t
{
	Empty = 0,
	Occupied = 1,
	Disable = 2,
	EUIGeneralItemSlotState_MAX = 3
};

// Object: Enum Solarland.EUIPokeBallPassiveSlotState
enum class EUIPokeBallPassiveSlotState : uint8_t
{
	Empty = 0,
	Occupied = 1,
	Disable = 2,
	EUIPokeBallPassiveSlotState_MAX = 3
};

// Object: Enum Solarland.EBackpackInfoPageType
enum class EBackpackInfoPageType : uint8_t
{
	Backpack = 0,
	Talent = 1,
	TrainingModeMenu = 2,
	TDMScoreboard = 3,
	Max = 4
};

// Object: Enum Solarland.ETweenInterpolationType
enum class ETweenInterpolationType : uint8_t
{
	Easing = 0,
	Curve = 1,
	ETweenInterpolationType_MAX = 2
};

// Object: Enum Solarland.EDefenderTeamType
enum class EDefenderTeamType : uint8_t
{
	None = 0,
	MyTeam = 1,
	DazzlingTeam = 2,
	DefenderTeam = 3,
	EDefenderTeamType_MAX = 4
};

// Object: Enum Solarland.EDragWidgetState
enum class EDragWidgetState : uint8_t
{
	Empty = 0,
	Partial = 1,
	Full = 2,
	EDragWidgetState_MAX = 3
};

// Object: Enum Solarland.EActionWheelImageType
enum class EActionWheelImageType : uint8_t
{
	None = 0,
	Action = 1,
	Sticker = 2,
	EActionWheelImageType_MAX = 3
};

// Object: Enum Solarland.EInputActionType
enum class EInputActionType : uint8_t
{
	RoleSkillOne = 0,
	RoleSkillTwo = 1,
	RoleSkillThree = 2,
	RoleSkillFour = 3,
	LongPressRoleSkillOne = 4,
	LongPressRoleSkillTwo = 5,
	LongPressRoleSkillThree = 6,
	LongPressRoleSkillFour = 7,
	Fire = 8,
	CancelAbility = 9,
	None = 10,
	EInputActionType_MAX = 11
};

// Object: Enum Solarland.EPlayerWidgetState
enum class EPlayerWidgetState : uint8_t
{
	NORMAL = 0,
	DRIVER = 1,
	PASSGNER = 2,
	EQUIPVEHICLEWEAPON = 3,
	CRUISING = 4,
	PATACHUTING = 5,
	SWIMMING = 6,
	INHUMANCANNON = 7,
	MAX = 8
};

// Object: Enum Solarland.EGainNoticeType
enum class EGainNoticeType : uint8_t
{
	GainExp = 0,
	GainScore = 1,
	EGainNoticeType_MAX = 2
};

// Object: Enum Solarland.ELocalNoticeType
enum class ELocalNoticeType : uint8_t
{
	Revenge = 0,
	KillDown = 1,
	ClearTeam = 2,
	ShutDown = 3,
	KillDefender = 4,
	ELocalNoticeType_MAX = 5
};

// Object: Enum Solarland.EUIWidgetProxyName
enum class EUIWidgetProxyName : uint8_t
{
	None = 0,
	UI_BuyResurrectionPanel = 1,
	OpenAirDrop = 2,
	ExpSpring = 3,
	RescueTeammate = 4,
	RespawnDevice = 5,
	ConsoleDevice = 6,
	GeneralTrigger_0 = 7,
	SkywardDive = 8,
	RevivalDeathBox = 9,
	OpenVaultDoor = 10,
	FindVaultDoorKey = 11,
	EUIWidgetProxyName_MAX = 12
};

// Object: Enum Solarland.EUIWidgetName
enum class EUIWidgetName : uint8_t
{
	None = 0,
	TabSpeaker = 1,
	TabMicroPhone = 2,
	ChatMain = 3,
	ActionWheel = 4,
	EUIWidgetName_MAX = 5
};

// Object: Enum Solarland.EUIWeaponPartState
enum class EUIWeaponPartState : uint8_t
{
	NotEquip = 0,
	Equipped = 1,
	CantEquip = 2,
	EUIWeaponPartState_MAX = 3
};

// Object: Enum Solarland.EWidgetVisibilityFlags
enum class EWidgetVisibilityFlags : uint8_t
{
	None = 0,
	ChatSwitch = 1,
	ChatMsgSending = 2,
	ConnectionState = 3,
	TalentState = 4,
	TalentValidation = 5,
	EWidgetVisibilityFlags_MAX = 6
};

// Object: Enum Solarland.EVehicleWeaponScopeType
enum class EVehicleWeaponScopeType : uint8_t
{
	None = 0,
	Magnifier_X2 = 1,
	Magnifier_X4 = 2,
	Magnifier_X8 = 3,
	Max = 4
};

// Object: Enum Solarland.EVehicleSpawnAlternateType
enum class EVehicleSpawnAlternateType : uint8_t
{
	Hour = 0,
	Day = 1,
	Week = 2,
	Month = 3,
	Season = 4,
	EVehicleSpawnAlternateType_MAX = 5
};

// Object: Enum Solarland.EVehicleSpawnType
enum class EVehicleSpawnType : uint8_t
{
	SingleRandom = 0,
	Group = 1,
	GroupWithSingleRandom = 2,
	EVehicleSpawnType_MAX = 3
};

// Object: Enum Solarland.EStealthParamType
enum class EStealthParamType : uint8_t
{
	None = 0,
	Type_1P = 1,
	Type_3P = 2,
	Type_3P_Enemy = 3,
	EStealthParamType_MAX = 4
};

// Object: Enum Solarland.EWholeShieldState
enum class EWholeShieldState : uint8_t
{
	Begin = 0,
	InProgress = 1,
	End = 2,
	EWholeShieldState_MAX = 3
};

// Object: Enum Solarland.EVendingMachineRewardQuality
enum class EVendingMachineRewardQuality : uint8_t
{
	None = 0,
	Blue = 1,
	Purple = 2,
	Gold = 3,
	EVendingMachineRewardQuality_MAX = 4
};

// Object: Enum Solarland.EVendingMachineState
enum class EVendingMachineState : uint8_t
{
	None = 0,
	Idle = 1,
	Tossing = 2,
	Drawing = 3,
	Resulting = 4,
	Bursting = 5,
	EVendingMachineState_MAX = 6
};

// Object: Enum Solarland.EDualShockTriggerMode
enum class EDualShockTriggerMode : uint8_t
{
	NoFeedback = 0,
	ConstantResistance = 1,
	ResistiveSection = 2,
	PositionTriggeredVibration = 3,
	BilinearResistance = 4,
	DualModeFeedback = 5,
	AmplitudeCyclingVibration = 6,
	EDualShockTriggerMode_MAX = 7
};

// Object: Enum Solarland.EVibrateKeyRemappingType
enum class EVibrateKeyRemappingType : uint8_t
{
	None = 0,
	Fire = 1,
	EVibrateKeyRemappingType_MAX = 2
};

// Object: Enum Solarland.EVisualSoundCalculatePoint
enum class EVisualSoundCalculatePoint : uint8_t
{
	Camera = 0,
	Character = 1,
	EVisualSoundCalculatePoint_MAX = 2
};

// Object: Enum Solarland.EVisualSoundDetectionRule
enum class EVisualSoundDetectionRule : uint8_t
{
	XYZ = 0,
	XY = 1,
	XY_FiniteZ = 2,
	EVisualSoundDetectionRule_MAX = 3
};

// Object: Enum Solarland.EShieldAcitveType
enum class EShieldAcitveType : uint8_t
{
	Normal = 0,
	Slithering = 1,
	Max = 2
};

// Object: Enum Solarland.EShieldDestroyReason
enum class EShieldDestroyReason : uint8_t
{
	FadeOut = 0,
	Broken = 1,
	Explode = 2,
	Max = 3
};

// Object: Enum Solarland.EWeaponAnimState
enum class EWeaponAnimState : uint8_t
{
	Idle = 0,
	Fire = 1,
	AltFire = 2,
	Reload = 3,
	Overload = 4,
	OpenScope = 5,
	CloseScope = 6,
	Bolt = 7,
	Preview = 8,
	Summon = 9,
	EWeaponAnimState_MAX = 10
};

// Object: Enum Solarland.EGamepadAssistAimModeFlag
enum class EGamepadAssistAimModeFlag : uint8_t
{
	None = 0,
	Default = 1,
	Precise = 2,
	EGamepadAssistAimModeFlag_MAX = 3
};

// Object: Enum Solarland.EWeaponBuffApplyType
enum class EWeaponBuffApplyType : uint8_t
{
	Any = 0,
	OnlyShieldDamage = 1,
	OnlyHealthDamage = 2,
	EWeaponBuffApplyType_MAX = 3
};

// Object: Enum Solarland.EWeaponTrajectoryType
enum class EWeaponTrajectoryType : uint8_t
{
	VirtualBullet = 0,
	Canister = 1,
	EWeaponTrajectoryType_MAX = 2
};

// Object: Enum Solarland.EWeaponDamageDecayMode
enum class EWeaponDamageDecayMode : uint8_t
{
	Instant = 0,
	Linear = 1,
	EWeaponDamageDecayMode_MAX = 2
};

// Object: Enum Solarland.ESolarWeaponLODState
enum class ESolarWeaponLODState : uint8_t
{
	Hold = 0,
	OpenScope = 1,
	Discard = 2,
	AttachedOnBackpack = 3,
	ESolarWeaponLODState_MAX = 4
};

// Object: Enum Solarland.EGunPlayLocomotionTargetBone
enum class EGunPlayLocomotionTargetBone : uint8_t
{
	TagWeapon = 0,
	TagTorso = 1,
	EGunPlayLocomotionTargetBone_MAX = 2
};

// Object: Enum Solarland.EWeaponSkinType
enum class EWeaponSkinType : uint8_t
{
	Material = 0,
	Mesh = 1,
	EWeaponSkinType_MAX = 2
};

// Object: Enum Solarland.EWeaponMechanicalSideFlag
enum class EWeaponMechanicalSideFlag : uint16_t
{
	None = 0,
	OnGround = 2,
	Unequip = 4,
	ForceFiring = 16,
	ChargedFire = 32,
	NeedBolt = 64,
	GatlingRolling = 128,
	DetectedWall = 256,
	NeedRechamber = 512,
	NoAmmoReserved = 1024,
	ReloadRecover = 2048,
	LoopReloading = 4096,
	EWeaponMechanicalSideFlag_MAX = 4097
};

// Object: Enum Solarland.EWeaponMechanicalUniqueState
enum class EWeaponMechanicalUniqueState : uint8_t
{
	None = 0,
	Idle = 1,
	PreFire = 2,
	RealFire = 3,
	Rechamber = 4,
	Reloading = 5,
	Bolting = 6,
	Charging = 7,
	Overloading = 8,
	KeyUPHolding = 9,
	EWeaponMechanicalUniqueState_MAX = 10
};

// Object: Enum Solarland.EWeaponRecoilPatternType
enum class EWeaponRecoilPatternType : uint8_t
{
	Auto = 0,
	Burst = 1,
	EWeaponRecoilPatternType_MAX = 2
};

// Object: Enum Solarland.EFixedValueMode
enum class EFixedValueMode : uint8_t
{
	Raw = 0,
	Increment = 1,
	EFixedValueMode_MAX = 2
};

// Object: Enum Solarland.EAnimSourceType
enum class EAnimSourceType : uint8_t
{
	TPS = 0,
	FPS = 1,
	ADS = 2,
	EAnimSourceType_MAX = 3
};

// Object: Enum Solarland.EWeaponSpreadDistributionRule
enum class EWeaponSpreadDistributionRule : uint8_t
{
	CentralLimitTheorem = 0,
	DistributionCurve = 1,
	Canister = 2,
	CanisterFixed = 3,
	EWeaponSpreadDistributionRule_MAX = 4
};

// Object: Enum Solarland.EAutoLockTargetState
enum class EAutoLockTargetState : uint8_t
{
	NONE = 0,
	LOCKING = 1,
	LOCKED = 2,
	UNLOCKING = 3,
	LOST = 4,
	EAutoLockTargetState_MAX = 5
};

// Object: Enum Solarland.EAutoLockState
enum class EAutoLockState : uint8_t
{
	NONE = 0,
	SEARCHING = 1,
	SHOOTING = 2,
	EAutoLockState_MAX = 3
};

// Object: Enum Solarland.ESolarWeaponFireInputButtonState
enum class ESolarWeaponFireInputButtonState : uint8_t
{
	FireWaiting = 0,
	FirePressed = 1,
	CancelWaiting = 2,
	CancelPressed = 3,
	Invalid = 4,
	ESolarWeaponFireInputButtonState_MAX = 5
};

// Object: Enum Solarland.ECheckFireResultType
enum class ECheckFireResultType : uint8_t
{
	None = 0,
	Fire = 1,
	Reload = 2,
	OpenScope = 3,
	CloseScope = 4,
	Charge = 5,
	EndCharge = 6,
	ECheckFireResultType_MAX = 7
};

// Object: Enum Solarland.EOperateScopeStateReason
enum class EOperateScopeStateReason : uint8_t
{
	None = 0,
	OpenScopeButton = 1,
	OpenQuickAds = 2,
	Open = 3,
	CloseScopeButton = 4,
	CloseBolt = 5,
	Close = 6,
	ScopeButton = 7,
	AllFlag = 8,
	EOperateScopeStateReason_MAX = 9
};

// Object: Enum Solarland.ECameraAdjustFlag
enum class ECameraAdjustFlag : uint8_t
{
	None = 0,
	Opening = 1,
	Opened = 2,
	Closing = 4,
	Closed = 8,
	ECameraAdjustFlag_MAX = 9
};

// Object: Enum Solarland.EWeaponPhysxErrorProtectionReason
enum class EWeaponPhysxErrorProtectionReason : uint8_t
{
	None = 0,
	PhysxEvent = 1,
	ProactiveHitCheck = 2,
	InteractionCheck = 3,
	EWeaponPhysxErrorProtectionReason_MAX = 4
};

// Object: Enum Solarland.EWeaponOperationExecutionReason
enum class EWeaponOperationExecutionReason : uint8_t
{
	None = 0,
	NetOwner = 1,
	NetSync = 2,
	Local = 3,
	EWeaponOperationExecutionReason_MAX = 4
};

// Object: Enum Solarland.EWeaponStatusResetReason
enum class EWeaponStatusResetReason : uint8_t
{
	None = 0,
	Initialized = 1,
	HasExpiredOperation = 2,
	ReplayHasUnreadyOperation = 3,
	ReplayHasDiscontinuousOperation = 4,
	BeSpectatedAsLocalPlayer = 5,
	EquipFailed = 6,
	OnCharacterReset = 7,
	EWeaponStatusResetReason_MAX = 8
};

// Object: Enum Solarland.EVehicleWeaponServerRecieveProto
enum class EVehicleWeaponServerRecieveProto : uint8_t
{
	Reload = 0,
	StartReload = 1,
	EVehicleWeaponServerRecieveProto_MAX = 2
};

// Object: Enum Solarland.EWeaponSystemVehicleState
enum class EWeaponSystemVehicleState : uint8_t
{
	PreCharging = 0,
	PreFire = 1,
	PreReload = 2,
	PreOpenScope = 3,
	PreCloseScope = 4,
	PreFireOverload = 5,
	EWeaponSystemVehicleState_MAX = 6
};

// Object: Enum Solarland.EWeaponSystemVehicleProto
enum class EWeaponSystemVehicleProto : uint8_t
{
	EWeaponSystemVehicleProto_Equip = 0,
	EWeaponSystemVehicleProto_UnEquip = 1,
	EWeaponSystemVehicleProto_StartReload = 2,
	EWeaponSystemVehicleProto_MAX = 3
};

// Object: Enum Solarland.ESkillHUDBuffContinuousState
enum class ESkillHUDBuffContinuousState : uint8_t
{
	None = 0,
	Continuous = 1,
	Buff_Main = 2,
	Buff_Sub = 4,
	ESkillHUDBuffContinuousState_MAX = 5
};

// Object: Enum Solarland.ECountDownState
enum class ECountDownState : uint8_t
{
	CD_Normal = 0,
	CD_Buff = 1,
	CD_MAX = 2
};

// Object: Enum Solarland.ECenterToTargetMarkState
enum class ECenterToTargetMarkState : uint8_t
{
	E_Center = 0,
	E_MoveToTarget = 1,
	E_Target = 2,
	E_MAX = 3
};

// Object: Enum Solarland.EHeroSubItemDeviceState
enum class EHeroSubItemDeviceState : uint8_t
{
	E_Normal = 0,
	E_Warning = 1,
	E_Trigger = 2,
	E_Hit = 3,
	E_Destroyed = 4,
	E_MAX = 5
};

// Object: Enum Solarland.EHeroSubItemType
enum class EHeroSubItemType : uint8_t
{
	E_Owl = 0,
	E_AIDog = 1,
	E_Rex = 2,
	E_MAX = 3
};

// Object: Enum Solarland.EMarkButtonState
enum class EMarkButtonState : uint8_t
{
	Normal = 0,
	Pressed = 1,
	Selecting = 2,
	Canceled = 3,
	Respond = 4,
	EMarkButtonState_MAX = 5
};

// Object: Enum Solarland.EWorldMarkLoopAnimationShapeType
enum class EWorldMarkLoopAnimationShapeType : uint8_t
{
	None = 0,
	Oval = 1,
	Box = 2,
	Triangle = 3,
	EWorldMarkLoopAnimationShapeType_MAX = 4
};

// Object: Enum Solarland.EMiniMapMarkOperationType
enum class EMiniMapMarkOperationType : uint8_t
{
	None = 0,
	CreateMiniMapIcon = 1,
	SelectMiniMapIcon = 2,
	EMiniMapMarkOperationType_MAX = 3
};

// Object: Enum Solarland.EYinSymbolBuffEndReason
enum class EYinSymbolBuffEndReason : uint8_t
{
	None = 0,
	TimeOut = 1,
	ChangeTarget = 2,
	InMirrorWorld = 3,
	EYinSymbolBuffEndReason_MAX = 4
};

// Object: Enum Solarland.EZiplineFarEndType
enum class EZiplineFarEndType : uint8_t
{
	Upward = 0,
	Downward = 1,
	Horizontal = 2,
	DiagonallyUp = 3,
	MAX = 4
};

// Object: Enum Solarland.EZiplineBuildingPhase
enum class EZiplineBuildingPhase : uint8_t
{
	Finished = 0,
	Prepare = 1,
	BuildCloseEnd = 2,
	BuildCable = 3,
	BuildFarEnd = 4,
	WaitingForDestroy = 5,
	PendingDestroy = 6,
	MAX = 7
};

// Object: ScriptStruct Solarland.ActionData
// Size: 0x2B0 (Inherited: 0x0)
struct FActionData
{
	struct UObject* PayloadObject; // 0x0(0x8)
	uint8_t Pad_0x8[0x8]; // 0x8(0x8)
	struct FTransform Transform; // 0x10(0x30)
	struct FHitResult HitResult; // 0x40(0x88)
	struct TMap<struct FName, float> Floats; // 0xC8(0x50)
	struct TMap<struct FName, struct FVector> Vectors; // 0x118(0x50)
	struct TMap<struct FName, struct UObject*> Objects; // 0x168(0x50)
	struct TMap<struct FAreaHandle, int32_t> AreaHandles; // 0x1B8(0x50)
	uint8_t Pad_0x208[0x8]; // 0x208(0x8)
	struct TMap<int32_t, struct FActionSectionParticleComponents> SectionParticles; // 0x210(0x50)
	struct TMap<struct AActor*, struct FAffectedActor> AffectedActorMap; // 0x260(0x50)
};

// Object: ScriptStruct Solarland.AffectedActor
// Size: 0x8 (Inherited: 0x0)
struct FAffectedActor
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
};

// Object: ScriptStruct Solarland.ActionSectionParticleComponents
// Size: 0x10 (Inherited: 0x0)
struct FActionSectionParticleComponents
{
	struct TArray<struct UParticleSystemComponent*> Components; // 0x0(0x10)
};

// Object: ScriptStruct Solarland.AreaHandle
// Size: 0x8 (Inherited: 0x0)
struct FAreaHandle
{
	struct FName AreaName; // 0x0(0x8)
};

// Object: ScriptStruct Solarland.AnyValue
// Size: 0x18 (Inherited: 0x0)
struct FAnyValue
{
	uint8_t Pad_0x0[0x18]; // 0x0(0x18)
};

// Object: ScriptStruct Solarland.LiveWatchOnlyMsg
// Size: 0x40 (Inherited: 0x0)
struct FLiveWatchOnlyMsg
{
	struct FString BattleID; // 0x0(0x10)
	struct FString FromPlayerID; // 0x10(0x10)
	struct FString ToPlayerID; // 0x20(0x10)
	struct FString Content; // 0x30(0x10)
};

// Object: ScriptStruct Solarland.DropBlacklist
// Size: 0x1C8 (Inherited: 0x0)
struct FDropBlacklist
{
	struct TArray<int32_t> WeaponBlacklist; // 0x0(0x10)
	struct TArray<int32_t> WeaponWhitelist; // 0x10(0x10)
	struct TArray<int32_t> VehicleBlacklist; // 0x20(0x10)
	struct TArray<int32_t> VehicleWhitelist; // 0x30(0x10)
	struct TArray<int32_t> BuddyBlacklist; // 0x40(0x10)
	struct TArray<int32_t> ItemBlacklist; // 0x50(0x10)
	struct TArray<int32_t> HeroBlacklist; // 0x60(0x10)
	struct TArray<int32_t> ActivityOutcomeIDs; // 0x70(0x10)
	bool bOnlyUseWeaponWhitelist; // 0x80(0x1)
	uint8_t Pad_0x81[0x147]; // 0x81(0x147)
};

// Object: ScriptStruct Solarland.GlobalSkillObjectInfoContainer
// Size: 0x120 (Inherited: 0x108)
struct FGlobalSkillObjectInfoContainer : FFastArraySerializer
{
	struct TArray<struct FGlobalSkillObjectInfo> GlobalSkillObjectInfos; // 0x108(0x10)
	struct ASolarGameState* Owner; // 0x118(0x8)
};

// Object: ScriptStruct Solarland.GlobalSkillObjectInfo
// Size: 0x40 (Inherited: 0xC)
struct FGlobalSkillObjectInfo : FFastArraySerializerItem
{
	int32_t GlobalSkillObjectGUID; // 0xC(0x4)
	struct FGameplayTag GameplayTag; // 0x10(0x8)
	struct TArray<struct FVector_NetQuantize> SpawnLocation; // 0x18(0x10)
	float EnhanceMultiplier; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
	struct ASolarPlayerState* InstigatorPS; // 0x30(0x8)
	int32_t AbilityLevel; // 0x38(0x4)
	int32_t ActivateID; // 0x3C(0x4)
};

// Object: ScriptStruct Solarland.HellStrikeWarningWidgetInfoContainer
// Size: 0x120 (Inherited: 0x108)
struct FHellStrikeWarningWidgetInfoContainer : FFastArraySerializer
{
	struct TArray<struct FHellStrikeWarningWidgetInfo> HellStrikeWarningWidgetMarkInfos; // 0x108(0x10)
	struct TWeakObjectPtr<struct UWorld> OwnerWorld; // 0x118(0x8)
};

// Object: ScriptStruct Solarland.HellStrikeWarningWidgetInfo
// Size: 0x24 (Inherited: 0xC)
struct FHellStrikeWarningWidgetInfo : FFastArraySerializerItem
{
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	float Timestamp; // 0x10(0x4)
	uint8_t InstigatorTeamID; // 0x14(0x1)
	uint8_t Pad_0x15[0x3]; // 0x15(0x3)
	struct FVector_NetQuantize InstigatorLocation; // 0x18(0xC)
};

// Object: ScriptStruct Solarland.GameStartConditionList
// Size: 0x78 (Inherited: 0x0)
struct FGameStartConditionList
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct FGameplayTagContainer ServerStartConditionList; // 0x8(0x20)
	struct FGameplayTagContainer ClientStartConditionList; // 0x28(0x20)
	struct FGameplayTagContainer AdditionalClientStartConditionList; // 0x48(0x20)
	struct AGameStateBase* Owner; // 0x68(0x8)
	uint8_t Pad_0x70[0x8]; // 0x70(0x8)
};

// Object: ScriptStruct Solarland.PrePooledBundle
// Size: 0x10 (Inherited: 0x0)
struct FPrePooledBundle
{
	struct FName ClassPath; // 0x0(0x8)
	int32_t Number; // 0x8(0x4)
	bool bNeedOnClient; // 0xC(0x1)
	bool bNeedOnServer; // 0xD(0x1)
	uint8_t Pad_0xE[0x2]; // 0xE(0x2)
};

// Object: ScriptStruct Solarland.CustomRoomData
// Size: 0x150 (Inherited: 0x0)
struct FCustomRoomData
{
	struct TArray<int32_t> WeaponBlacklist; // 0x0(0x10)
	struct TArray<int32_t> WeaponTypeBlacklist; // 0x10(0x10)
	struct TArray<int32_t> VehicleTypeBlacklist; // 0x20(0x10)
	struct TArray<int32_t> VehicleClassBlacklist; // 0x30(0x10)
	struct TArray<int32_t> BuddyBlacklist; // 0x40(0x10)
	struct FString Name; // 0x50(0x10)
	int64_t MinPlayerLimit; // 0x60(0x8)
	int64_t MaxPlayerLimit; // 0x68(0x8)
	struct FString OwnerID; // 0x70(0x10)
	struct FString Passwd; // 0x80(0x10)
	int32_t LevelLimit; // 0x90(0x4)
	uint8_t Pad_0x94[0x4]; // 0x94(0x4)
	int64_t ShowID; // 0x98(0x8)
	int64_t MaxOBPlayerLimit; // 0xA0(0x8)
	bool bIsEnabledSwapPos; // 0xA8(0x1)
	bool bIsEnabledInvite; // 0xA9(0x1)
	bool bIsEnableTeamJoin; // 0xAA(0x1)
	enum class ESCRoomType RoomType; // 0xAB(0x1)
	struct FTournamentData TournamentData; // 0xAC(0x10)
	int32_t RewardPoolID; // 0xBC(0x4)
	int32_t RewardPoolPrizeType; // 0xC0(0x4)
	uint8_t Pad_0xC4[0x4]; // 0xC4(0x4)
	struct FCustomServerData CustomServerData; // 0xC8(0x80)
	int32_t KeepMatchTime; // 0x148(0x4)
	bool bIsNewTournament; // 0x14C(0x1)
	uint8_t Pad_0x14D[0x3]; // 0x14D(0x3)
};

// Object: ScriptStruct Solarland.CustomServerData
// Size: 0x80 (Inherited: 0x0)
struct FCustomServerData
{
	struct FString ID; // 0x0(0x10)
	int32_t ConfigID; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct TArray<int32_t> WeaponBlacklist; // 0x18(0x10)
	struct TArray<int32_t> WeaponTypeBlacklist; // 0x28(0x10)
	struct TArray<int32_t> VehicleTypeBlacklist; // 0x38(0x10)
	struct TArray<int32_t> VehicleClassBlacklist; // 0x48(0x10)
	bool bBuddyClassAvailable; // 0x58(0x1)
	uint8_t Pad_0x59[0x7]; // 0x59(0x7)
	struct TArray<int32_t> BuddyBlacklist; // 0x60(0x10)
	struct TArray<struct FString> AdministratorList; // 0x70(0x10)
};

// Object: ScriptStruct Solarland.TournamentData
// Size: 0x10 (Inherited: 0x0)
struct FTournamentData
{
	int32_t StartTime; // 0x0(0x4)
	int32_t DelayTime; // 0x4(0x4)
	int32_t Turn; // 0x8(0x4)
	enum class ESCTournamentType TournamentType; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
};

// Object: ScriptStruct Solarland.KnockoutParams
// Size: 0x28 (Inherited: 0x0)
struct FKnockoutParams
{
	float KnockoutKillPoint; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<float> KnockoutRankPoints; // 0x8(0x10)
	float KnockoutDamagePoint; // 0x18(0x4)
	float KnockoutDamageTakenPoint; // 0x1C(0x4)
	float ScalarParam; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: ScriptStruct Solarland.SCMRankData
// Size: 0x18 (Inherited: 0x0)
struct FSCMRankData
{
	struct FString HostID; // 0x0(0x10)
	int32_t Rank; // 0x10(0x4)
	float Value; // 0x14(0x4)
};

// Object: ScriptStruct Solarland.SCMRankInfo
// Size: 0x18 (Inherited: 0x0)
struct FSCMRankInfo
{
	struct FString RankName; // 0x0(0x10)
	enum class ESCMDataRankType RankType; // 0x10(0x1)
	enum class ESCMHostType HostType; // 0x11(0x1)
	uint8_t Pad_0x12[0x6]; // 0x12(0x6)
};

// Object: ScriptStruct Solarland.HighlightReportData
// Size: 0x50 (Inherited: 0x0)
struct FHighlightReportData
{
	int32_t Source; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FString BattleID; // 0x8(0x10)
	struct FString MapID; // 0x18(0x10)
	int32_t MatchRanking; // 0x28(0x4)
	int32_t Rank; // 0x2C(0x4)
	int32_t KillNum; // 0x30(0x4)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	struct FString HighestRating; // 0x38(0x10)
	bool bIsInterrupt; // 0x48(0x1)
	uint8_t Pad_0x49[0x7]; // 0x49(0x7)
};

// Object: ScriptStruct Solarland.ReplayReportData
// Size: 0x78 (Inherited: 0x0)
struct FReplayReportData
{
	uint8_t Pad_0x0[0x60]; // 0x0(0x60)
	struct FString BattleID; // 0x60(0x10)
	float ReplayDuration; // 0x70(0x4)
	float AutoSpectateDuration; // 0x74(0x4)
};

// Object: ScriptStruct Solarland.StartPlayParams
// Size: 0x40 (Inherited: 0x0)
struct FStartPlayParams
{
	struct FString BattleID; // 0x0(0x10)
	struct FString PlayerID; // 0x10(0x10)
	struct FString URL; // 0x20(0x10)
	enum class EReplayType Type; // 0x30(0x1)
	bool bIsLocal; // 0x31(0x1)
	bool bIsLive; // 0x32(0x1)
	uint8_t Pad_0x33[0x1]; // 0x33(0x1)
	int32_t MapID; // 0x34(0x4)
	int32_t RuleId; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
};

// Object: ScriptStruct Solarland.SolarClientAdjustPositionInfo
// Size: 0x38 (Inherited: 0x0)
struct FSolarClientAdjustPositionInfo
{
	uint8_t Pad_0x0[0x20]; // 0x0(0x20)
	struct UPrimitiveComponent* NewBase; // 0x20(0x8)
	uint8_t Pad_0x28[0x10]; // 0x28(0x10)
};

// Object: ScriptStruct Solarland.MoveVibrateParams
// Size: 0x40 (Inherited: 0x0)
struct FMoveVibrateParams
{
	struct FString LandingHeavyEventName; // 0x0(0x10)
	struct FString LandingLightEventName; // 0x10(0x10)
	float LandingHeavySpeedThreshold; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct FString SlideTackleVibrateEventName; // 0x28(0x10)
	float SlideTackleVibrateCD; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
};

// Object: ScriptStruct Solarland.HeavyLandingParams
// Size: 0x118 (Inherited: 0x0)
struct FHeavyLandingParams
{
	float HeavyLandingSpeedThreshold; // 0x0(0x4)
	float HeavyLandingEffectDuration; // 0x4(0x4)
	struct FRuntimeFloatCurve HeavyLandingAccelerationRatioCurve; // 0x8(0x88)
	struct FRuntimeFloatCurve HeavyLandingVelocityRatioCurve; // 0x90(0x88)
};

// Object: ScriptStruct Solarland.CustomJumpParams
// Size: 0x4C8 (Inherited: 0x0)
struct FCustomJumpParams
{
	bool bJumpByCustomHeight; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float JumpHeight; // 0x4(0x4)
	float JumpTime; // 0x8(0x4)
	bool bJumpByInitVelocity; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	float JumpInitUpVelocity; // 0x10(0x4)
	float JumpNewOverridenGravity; // 0x14(0x4)
	float JumpOnFallingTimeThreshold; // 0x18(0x4)
	float JumpOnFallingHeightThreshold; // 0x1C(0x4)
	struct FGameplayTagRequirements JumpOnFallingTagRequirements; // 0x20(0x50)
	bool bEnableLateralSpeedAdjust; // 0x70(0x1)
	uint8_t Pad_0x71[0x7]; // 0x71(0x7)
	struct FRuntimeFloatCurve LateralSpeedAdjustCurve; // 0x78(0x88)
	bool bEnableJumpHeightAdjust; // 0x100(0x1)
	uint8_t Pad_0x101[0x7]; // 0x101(0x7)
	struct FRuntimeFloatCurve JumpHeightAdjustCurve; // 0x108(0x88)
	struct FAdjacentJumpParams AdjacentJumpParams; // 0x190(0x338)
};

// Object: ScriptStruct Solarland.AdjacentJumpParams
// Size: 0x338 (Inherited: 0x0)
struct FAdjacentJumpParams
{
	float AdjacentJumpEffectDuration; // 0x0(0x4)
	bool bLimitAdjacentJumpHVelocity; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
	struct FRuntimeFloatCurve FirstAdjacentJumpHeightRatioCurve; // 0x8(0x88)
	struct FRuntimeFloatCurve FirstAdjacentJumpTimeRatioCurve; // 0x90(0x88)
	struct FRuntimeFloatCurve AdjacentJumpHeightRatioCurve; // 0x118(0x88)
	struct FRuntimeFloatCurve AdjacentJumpTimeRatioCurve; // 0x1A0(0x88)
	struct FRuntimeFloatCurve FirstAdjacentJumpVelocityZRatioCurve; // 0x228(0x88)
	struct FRuntimeFloatCurve AdjacentJumpVelocityZRatioCurve; // 0x2B0(0x88)
};

// Object: ScriptStruct Solarland.WalkingStartOptimizeParams
// Size: 0x18 (Inherited: 0x0)
struct FWalkingStartOptimizeParams
{
	struct UCurveFloat* WalkingAccelerationAginstVel; // 0x0(0x8)
	float BaseMaxSprintSpeed; // 0x8(0x4)
	float GroundFrictionOpt; // 0xC(0x4)
	float BrakingFrictionFactorOpt; // 0x10(0x4)
	float BrakingDecelerationWalkingOpt; // 0x14(0x4)
};

// Object: ScriptStruct Solarland.SpawnedActorHandle
// Size: 0x4 (Inherited: 0x0)
struct FSpawnedActorHandle
{
	uint32_t Handle; // 0x0(0x4)
};

// Object: ScriptStruct Solarland.HighlightConfigFromSsm
// Size: 0x1 (Inherited: 0x0)
struct FHighlightConfigFromSsm
{
	bool bDisableHighlight; // 0x0(0x1)
};

// Object: ScriptStruct Solarland.ReplayMonitorConfig
// Size: 0x18 (Inherited: 0x0)
struct FReplayMonitorConfig
{
	float MonitorTimeBeforeKill; // 0x0(0x4)
	float MonitorTimeAfterKill; // 0x4(0x4)
	struct FString MonitorReplayUploadURL; // 0x8(0x10)
};

// Object: ScriptStruct Solarland.MonitorshotConfig
// Size: 0x90 (Inherited: 0x0)
struct FMonitorshotConfig
{
	int32_t EnableOnCurrentReportGameCheating; // 0x0(0x4)
	int32_t MaxCountInRound; // 0x4(0x4)
	struct FString ShotMoment; // 0x8(0x10)
	int32_t ShotInterval; // 0x18(0x4)
	int32_t ShotWidth; // 0x1C(0x4)
	int32_t ShotQuality; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct FString ImageSaveType; // 0x28(0x10)
	struct FString ShotMode; // 0x38(0x10)
	int32_t ImageMaxSize; // 0x48(0x4)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)
	struct FString ImageCaptureType; // 0x50(0x10)
	int32_t EnableImageSnapRole; // 0x60(0x4)
	int32_t EnableCaptureLoop; // 0x64(0x4)
	int32_t CaptureForceLevel; // 0x68(0x4)
	int32_t CaptureCountLimit; // 0x6C(0x4)
	int32_t CaptureRoleLimit; // 0x70(0x4)
	int32_t EnableScreenCrop; // 0x74(0x4)
	int32_t ScreenCropWidth; // 0x78(0x4)
	int32_t ScreenCropHeight; // 0x7C(0x4)
	int32_t EnableCaptureRoleInvisible; // 0x80(0x4)
	int32_t CaptureRoleDistanceMaxLimit; // 0x84(0x4)
	int32_t DriverCaptureLevel; // 0x88(0x4)
	uint8_t Pad_0x8C[0x4]; // 0x8C(0x4)
};

// Object: ScriptStruct Solarland.AntiCheatSetting
// Size: 0x50 (Inherited: 0x0)
struct FAntiCheatSetting
{
	int64_t ID; // 0x0(0x8)
	int64_t ValueType; // 0x8(0x8)
	double ValueStart; // 0x10(0x8)
	double ValueEnd; // 0x18(0x8)
	int64_t Tolerance; // 0x20(0x8)
	int64_t ProbeInterval; // 0x28(0x8)
	struct FString VariableName; // 0x30(0x10)
	struct FString ExtraData; // 0x40(0x10)
};

// Object: ScriptStruct Solarland.RegistedActorContainer
// Size: 0x50 (Inherited: 0x0)
struct FRegistedActorContainer
{
	uint8_t Pad_0x0[0x50]; // 0x0(0x50)
};

// Object: ScriptStruct Solarland.SolarItemData
// Size: 0x120 (Inherited: 0xC)
struct FSolarItemData : FFastArraySerializerItem
{
	int32_t ItemID; // 0xC(0x4)
	int64_t ThisID; // 0x10(0x8)
	struct FString Name; // 0x18(0x10)
	struct FString Icon; // 0x28(0x10)
	struct FString Info; // 0x38(0x10)
	int32_t Count; // 0x48(0x4)
	enum class EItemType ItemType; // 0x4C(0x4)
	int32_t Quality; // 0x50(0x4)
	int32_t MaxPile; // 0x54(0x4)
	int32_t TargetItemIndex; // 0x58(0x4)
	int32_t ItemSlot; // 0x5C(0x4)
	bool IfReplace; // 0x60(0x1)
	uint8_t Pad_0x61[0x7]; // 0x61(0x7)
	struct FString AbilityBP; // 0x68(0x10)
	struct FString ItemBP; // 0x78(0x10)
	int32_t DropTime; // 0x88(0x4)
	int32_t UnPickupTime; // 0x8C(0x4)
	bool IsRecommend; // 0x90(0x1)
	bool bDirty; // 0x91(0x1)
	bool IsPickupLock; // 0x92(0x1)
	uint8_t Pad_0x93[0x5]; // 0x93(0x5)
	int64_t UserId; // 0x98(0x8)
	int32_t Level; // 0xA0(0x4)
	int32_t Prize; // 0xA4(0x4)
	float CurValue; // 0xA8(0x4)
	bool UseOnPickup; // 0xAC(0x1)
	enum class EItemAppearanceType AppearanceType; // 0xAD(0x1)
	bool bUpdateOverlap; // 0xAE(0x1)
	uint8_t SourceType; // 0xAF(0x1)
	bool bSkyIslandItem; // 0xB0(0x1)
	uint8_t Pad_0xB1[0x7]; // 0xB1(0x7)
	struct TArray<uint8_t> PickedTeamID; // 0xB8(0x10)
	bool bShowPickupTips; // 0xC8(0x1)
	uint8_t Pad_0xC9[0x7]; // 0xC9(0x7)
	struct FString OwnerPlayerID; // 0xD0(0x10)
	uint8_t Pad_0xE0[0x4]; // 0xE0(0x4)
	uint8_t KillerTeamID; // 0xE4(0x1)
	uint8_t Pad_0xE5[0x3]; // 0xE5(0x3)
	struct TArray<struct FRepItemEntryData> EntryDatas; // 0xE8(0x10)
	struct FBuddyBallItem PokeBallItem; // 0xF8(0x10)
	struct FString SummonerPlayerID; // 0x108(0x10)
	uint8_t Pad_0x118[0x8]; // 0x118(0x8)
};

// Object: ScriptStruct Solarland.BuddyBallItem
// Size: 0x10 (Inherited: 0x0)
struct FBuddyBallItem
{
	struct TArray<uint8_t> DataArr; // 0x0(0x10)
};

// Object: ScriptStruct Solarland.RepItemEntryData
// Size: 0x28 (Inherited: 0x0)
struct FRepItemEntryData
{
	int32_t EntryID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<int32_t> Param1Progress; // 0x8(0x10)
	float LastEffectiveTime; // 0x18(0x4)
	float LastTempShieldValue; // 0x1C(0x4)
	uint8_t Pad_0x20[0x8]; // 0x20(0x8)
};

// Object: ScriptStruct Solarland.HitSoundData
// Size: 0x24 (Inherited: 0x0)
struct FHitSoundData
{
	struct TWeakObjectPtr<struct AActor> Instigator; // 0x0(0x8)
	enum class EHitSoundSourceType SourceType; // 0x8(0x1)
	enum class EHitSoundTargetType TargetType; // 0x9(0x1)
	uint8_t Pad_0xA[0x2]; // 0xA(0x2)
	struct FName SubTableKey; // 0xC(0x8)
	struct FName SubTableKey2; // 0x14(0x8)
	int32_t weaponid; // 0x1C(0x4)
	bool bForcePlay; // 0x20(0x1)
	uint8_t Pad_0x21[0x3]; // 0x21(0x3)
};

// Object: ScriptStruct Solarland.SolarSummonSoundData
// Size: 0x10 (Inherited: 0x0)
struct FSolarSummonSoundData
{
	struct TArray<struct FString> SoundNames; // 0x0(0x10)
};

// Object: ScriptStruct Solarland.SolarLandscapeListenerConfig
// Size: 0x18 (Inherited: 0x0)
struct FSolarLandscapeListenerConfig
{
	bool bListenLandscape; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float InEffectRange; // 0x4(0x4)
	enum class EOnLSModifiedStrategy LSModifiedStrategy; // 0x8(0x1)
	bool bAdjustRotate; // 0x9(0x1)
	enum class EOnLSDestroyStrategy LSDestroyStrategy; // 0xA(0x1)
	uint8_t Pad_0xB[0x1]; // 0xB(0x1)
	struct FVector FreeFallBoxExtent; // 0xC(0xC)
};

// Object: ScriptStruct Solarland.ActiveSkillGameplayCueContainer
// Size: 0x120 (Inherited: 0x108)
struct FActiveSkillGameplayCueContainer : FFastArraySerializer
{
	struct TArray<struct FActiveSkillGameplayCue> GameplayCues; // 0x108(0x10)
	struct AActor* Owner; // 0x118(0x8)
};

// Object: ScriptStruct Solarland.ActiveSkillGameplayCue
// Size: 0xE8 (Inherited: 0xC)
struct FActiveSkillGameplayCue : FFastArraySerializerItem
{
	struct FGameplayTag GameplayCueTag; // 0xC(0x8)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct FGameplayCueParameters Parameters; // 0x18(0xD0)
};

// Object: ScriptStruct Solarland.WeaponAssistAimTargetConfig
// Size: 0x48 (Inherited: 0x0)
struct FWeaponAssistAimTargetConfig
{
	struct FVector2D BaseFollowTriggerExtent; // 0x0(0x8)
	struct FVector2D BaseFollowStopExtent; // 0x8(0x8)
	struct TArray<struct FBaseFollowExtentByTag> BaseFollowExtentByTags; // 0x10(0x10)
	struct FVector2D TargetVelocityFollowTriggerExtent; // 0x20(0x8)
	struct FVector2D LockAimingExtent; // 0x28(0x8)
	struct FVector2D GlobalSensitivityScaleTriggerExtent; // 0x30(0x8)
	uint8_t Pad_0x38[0x10]; // 0x38(0x10)
};

// Object: ScriptStruct Solarland.BaseFollowExtentByTag
// Size: 0x60 (Inherited: 0x0)
struct FBaseFollowExtentByTag
{
	struct FGameplayTagRequirements TagRequirements; // 0x0(0x50)
	struct FVector2D BaseFollowTriggerExtent; // 0x50(0x8)
	struct FVector2D BaseFollowStopExtent; // 0x58(0x8)
};

// Object: ScriptStruct Solarland.SectionBeginInfo
// Size: 0xC (Inherited: 0x0)
struct FSectionBeginInfo
{
	int32_t SectionIndex; // 0x0(0x4)
	float SectionBeginTime; // 0x4(0x4)
	float CurrentMainTrack; // 0x8(0x4)
};

// Object: ScriptStruct Solarland.ForceMovementDetail
// Size: 0x20 (Inherited: 0x0)
struct FForceMovementDetail
{
	enum class EForceMovementSource Source; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FVector FixedVelocity; // 0x4(0xC)
	float MaxSpeedBonus; // 0x10(0x4)
	struct FVector AdditiveAcceleration; // 0x14(0xC)
};

// Object: ScriptStruct Solarland.TeamStatData
// Size: 0x4 (Inherited: 0x0)
struct FTeamStatData
{
	int32_t EXPDeviceOpenCount; // 0x0(0x4)
};

// Object: ScriptStruct Solarland.VehicleSpectateInfo
// Size: 0x14 (Inherited: 0x0)
struct FVehicleSpectateInfo
{
	struct TWeakObjectPtr<struct ASolarVehiclePawn> SpectateVehicle; // 0x0(0x8)
	struct TWeakObjectPtr<struct ASolarVehicleWeapon> SpectateVehicleWeapon; // 0x8(0x8)
	enum class EWeaponScopeType VehicleWeaponScopeType; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
};

// Object: ScriptStruct Solarland.SpectateConditions
// Size: 0x28 (Inherited: 0x0)
struct FSpectateConditions
{
	bool bCanBeSpectate; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float LookAtSelfDeathBoxCountDown; // 0x4(0x4)
	float BlockWhenAcedCountDown; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TArray<enum class EFindSpectateTargetType> FindSpectateTargetPolicy; // 0x10(0x10)
	uint8_t Pad_0x20[0x8]; // 0x20(0x8)
};

// Object: ScriptStruct Solarland.SpectateReportInfo
// Size: 0x28 (Inherited: 0x0)
struct FSpectateReportInfo
{
	uint32_t RankLevelID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FString TargetUserID; // 0x8(0x10)
	uint8_t TargetType; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
	uint32_t SpectateElapsedTime; // 0x1C(0x4)
	uint8_t Type; // 0x20(0x1)
	uint8_t Pad_0x21[0x7]; // 0x21(0x7)
};

// Object: ScriptStruct Solarland.SpectateScoutViewInfo
// Size: 0x18 (Inherited: 0x0)
struct FSpectateScoutViewInfo
{
	struct ASolarPlayerState* PlayerState; // 0x0(0x8)
	struct FVector_NetQuantize Location; // 0x8(0xC)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct Solarland.PostProcessEffectInfo
// Size: 0xC (Inherited: 0x0)
struct FPostProcessEffectInfo
{
	struct FGameplayTag PostProcessTag; // 0x0(0x8)
	int32_t InstigatorEffectLevel; // 0x8(0x4)
};

// Object: ScriptStruct Solarland.SpectatorRadarInfo
// Size: 0x10 (Inherited: 0x0)
struct FSpectatorRadarInfo
{
	struct FGameplayAbilitySpecHandle RadarHandle; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct ASolarRadarBase* RadarClass; // 0x8(0x8)
};

// Object: ScriptStruct Solarland.BattleUpgradeEffectParamData
// Size: 0x8 (Inherited: 0x0)
struct FBattleUpgradeEffectParamData
{
	enum class ESolarTablesEnum_BattleUpgradeEffectType EffectType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t ParameterSum; // 0x4(0x4)
};

// Object: ScriptStruct Solarland.RepCountdownData
// Size: 0x40 (Inherited: 0x0)
struct FRepCountdownData
{
	int32_t RepTimes; // 0x0(0x4)
	int32_t RepTextID; // 0x4(0x4)
	int32_t RepPassiveTextID; // 0x8(0x4)
	int32_t RepPassiveCharacterID; // 0xC(0x4)
	float RepDuration; // 0x10(0x4)
	float RepRemaining; // 0x14(0x4)
	float TimeSpeed; // 0x18(0x4)
	float RepAmount; // 0x1C(0x4)
	float RepStartTime; // 0x20(0x4)
	float RepEndTime; // 0x24(0x4)
	int32_t RepCancel; // 0x28(0x4)
	struct FGameplayTag RepTag; // 0x2C(0x8)
	int32_t InteractNum; // 0x34(0x4)
	float RemainingTime; // 0x38(0x4)
	bool bUseCustomColor; // 0x3C(0x1)
	bool bIsTimeAdd; // 0x3D(0x1)
	uint8_t Pad_0x3E[0x2]; // 0x3E(0x2)
};

// Object: ScriptStruct Solarland.CharacterRoleAbilityInfo
// Size: 0x20 (Inherited: 0x0)
struct FCharacterRoleAbilityInfo
{
	bool bHasAbility; // 0x0(0x1)
	uint8_t Pad_0x1[0x1]; // 0x1(0x1)
	bool bIsCountingDown; // 0x2(0x1)
	uint8_t Pad_0x3[0x1]; // 0x3(0x1)
	float StartCDTime; // 0x4(0x4)
	float TotalCDTime; // 0x8(0x4)
	int32_t State; // 0xC(0x4)
	uint8_t Pad_0x10[0x4]; // 0x10(0x4)
	bool bOngoing; // 0x14(0x1)
	uint8_t Pad_0x15[0x3]; // 0x15(0x3)
	int32_t Level; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct Solarland.ReplicateMaxPileData
// Size: 0x8 (Inherited: 0x0)
struct FReplicateMaxPileData
{
	int32_t ItemID; // 0x0(0x4)
	int32_t MaxPile; // 0x4(0x4)
};

// Object: ScriptStruct Solarland.ReplicateItemData
// Size: 0x30 (Inherited: 0x0)
struct FReplicateItemData
{
	int32_t ItemID; // 0x0(0x4)
	int32_t Count; // 0x4(0x4)
	int32_t Slot; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct FBuddyBallItem PokeBallItem; // 0x10(0x10)
	struct TArray<struct FRepItemEntryData> EntryDatas; // 0x20(0x10)
};

// Object: ScriptStruct Solarland.FinalHighlightInfo
// Size: 0x88 (Inherited: 0x0)
struct FFinalHighlightInfo
{
	struct TArray<struct FActivationHighlight> Highlights; // 0x0(0x10)
	struct TArray<int32_t> Labels; // 0x10(0x10)
	struct FPlayerHighlightOverview PlayerOverview; // 0x20(0x68)
};

// Object: ScriptStruct Solarland.PlayerHighlightOverview
// Size: 0x68 (Inherited: 0x0)
struct FPlayerHighlightOverview
{
	int32_t KillNum; // 0x0(0x4)
	int32_t AssistNum; // 0x4(0x4)
	int32_t Damage; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct FString PlayerID; // 0x10(0x10)
	bool bIsMVP; // 0x20(0x1)
	uint8_t Pad_0x21[0x3]; // 0x21(0x3)
	int32_t RemainPlayers; // 0x24(0x4)
	int32_t PlayerRank; // 0x28(0x4)
	int32_t TeamRank; // 0x2C(0x4)
	enum class ESolarSupportLanguages PlayerLanguage; // 0x30(0x1)
	enum class ESolarSupportLanguages SoundLanguage; // 0x31(0x1)
	uint8_t Pad_0x32[0x6]; // 0x32(0x6)
	struct TArray<int32_t> Labels; // 0x38(0x10)
	struct FHighlightHeroTitleInfo Title; // 0x48(0x18)
	float GlobalSpeedupScale; // 0x60(0x4)
	uint8_t Pad_0x64[0x4]; // 0x64(0x4)
};

// Object: ScriptStruct Solarland.HighlightHeroTitleInfo
// Size: 0x18 (Inherited: 0x0)
struct FHighlightHeroTitleInfo
{
	int32_t Area; // 0x0(0x4)
	int32_t Rank; // 0x4(0x4)
	int32_t Type; // 0x8(0x4)
	int32_t ID; // 0xC(0x4)
	int32_t CharacterID; // 0x10(0x4)
	bool bUseAsHeroTitle; // 0x14(0x1)
	uint8_t Pad_0x15[0x3]; // 0x15(0x3)
};

// Object: ScriptStruct Solarland.ActivationHighlight
// Size: 0xF0 (Inherited: 0x0)
struct FActivationHighlight
{
	int32_t FragmentID; // 0x0(0x4)
	float BeginTime; // 0x4(0x4)
	float CreateTime; // 0x8(0x4)
	float EndTime; // 0xC(0x4)
	uint8_t Pad_0x10[0x18]; // 0x10(0x18)
	struct TArray<struct FReplayActivityKillDetail> ActivityKillDetailArr; // 0x28(0x10)
	uint8_t Pad_0x38[0x4]; // 0x38(0x4)
	float HighlightScore; // 0x3C(0x4)
	uint8_t Pad_0x40[0x38]; // 0x40(0x38)
	struct TArray<struct FHighlightCameraEffectDetail> CameraEffectDetails; // 0x78(0x10)
	uint8_t Pad_0x88[0x10]; // 0x88(0x10)
	struct FCharacterVoiceDetail CharacterVoiceDetail; // 0x98(0xC)
	float SpeedupScale; // 0xA4(0x4)
	uint8_t Pad_0xA8[0x8]; // 0xA8(0x8)
	struct TArray<struct FHighlightEventSpeedupRange> SpeedupRanges; // 0xB0(0x10)
	uint8_t Pad_0xC0[0x30]; // 0xC0(0x30)
};

// Object: ScriptStruct Solarland.HighlightEventSpeedupRange
// Size: 0x14 (Inherited: 0x0)
struct FHighlightEventSpeedupRange
{
	uint8_t Pad_0x0[0x4]; // 0x0(0x4)
	struct FFloatRange SpeedupRange; // 0x4(0x10)
};

// Object: ScriptStruct Solarland.CharacterVoiceDetail
// Size: 0xC (Inherited: 0x0)
struct FCharacterVoiceDetail
{
	float EventTime; // 0x0(0x4)
	int32_t VoiceID; // 0x4(0x4)
	uint8_t Pad_0x8[0x4]; // 0x8(0x4)
};

// Object: ScriptStruct Solarland.HighlightCameraEffectDetail
// Size: 0x10 (Inherited: 0x0)
struct FHighlightCameraEffectDetail
{
	float EventTime; // 0x0(0x4)
	int32_t EffectGroupID; // 0x4(0x4)
	struct FGameplayTag AbilityTag; // 0x8(0x8)
};

// Object: ScriptStruct Solarland.ReplayActivityKillDetail
// Size: 0x40 (Inherited: 0x0)
struct FReplayActivityKillDetail
{
	uint8_t Pad_0x0[0x4]; // 0x0(0x4)
	float KillTime; // 0x4(0x4)
	enum class EReplayActivityHeatKillUseType KillUseType; // 0x8(0x1)
	enum class ESCMDamageType DamageType; // 0x9(0x1)
	uint8_t Pad_0xA[0x2]; // 0xA(0x2)
	int32_t KillToolID; // 0xC(0x4)
	int32_t KillToolExtraID; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct FString KillerSolarPlayerID; // 0x18(0x10)
	struct FString VictimSolarPlayerID; // 0x28(0x10)
	bool bHeadHit; // 0x38(0x1)
	bool bIsTargetAI; // 0x39(0x1)
	uint8_t Pad_0x3A[0x6]; // 0x3A(0x6)
};

// Object: ScriptStruct Solarland.BattleCharacterData
// Size: 0x78 (Inherited: 0x0)
struct FBattleCharacterData
{
	int32_t CharacterID; // 0x0(0x4)
	int32_t SkinID; // 0x4(0x4)
	int32_t CharacterLevel; // 0x8(0x4)
	int32_t UseTimes; // 0xC(0x4)
	int32_t CardPose; // 0x10(0x4)
	int32_t Cardbackground; // 0x14(0x4)
	int32_t CharacterExp; // 0x18(0x4)
	int32_t Title; // 0x1C(0x4)
	int64_t Expired; // 0x20(0x8)
	int32_t CombatScore; // 0x28(0x4)
	int32_t HeroRankScore; // 0x2C(0x4)
	int32_t PerformanceScore; // 0x30(0x4)
	int32_t ActiveRate; // 0x34(0x4)
	int32_t BagId; // 0x38(0x4)
	int32_t MeleeWeaponID; // 0x3C(0x4)
	int32_t TailFlameId; // 0x40(0x4)
	int32_t CapsuleActorId; // 0x44(0x4)
	int32_t DeathBoxId; // 0x48(0x4)
	int32_t CharacterOwnerType; // 0x4C(0x4)
	struct TArray<struct FEquipVoiceData> Voice; // 0x50(0x10)
	struct TArray<int32_t> SocialWheelData; // 0x60(0x10)
	int32_t BuddyBallSkinID; // 0x70(0x4)
	uint8_t Pad_0x74[0x4]; // 0x74(0x4)
};

// Object: ScriptStruct Solarland.EquipVoiceData
// Size: 0x18 (Inherited: 0x0)
struct FEquipVoiceData
{
	int32_t Type; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<int32_t> Ids; // 0x8(0x10)
};

// Object: ScriptStruct Solarland.InteractionProgressInfo
// Size: 0x28 (Inherited: 0x0)
struct FInteractionProgressInfo
{
	struct FGameplayTag InteractionTag; // 0x0(0x8)
	float TotalTime; // 0x8(0x4)
	float StartTimeStamp; // 0xC(0x4)
	enum class EInteractionBuffState BuffState; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	float TimeSpeed; // 0x14(0x4)
	int32_t ProgressTextID; // 0x18(0x4)
	float RemainTime; // 0x1C(0x4)
	bool bIsTimeAdd; // 0x20(0x1)
	uint8_t Pad_0x21[0x3]; // 0x21(0x3)
	int32_t InteractNum; // 0x24(0x4)
};

// Object: ScriptStruct Solarland.ExpRankMedalData
// Size: 0x40 (Inherited: 0x0)
struct FExpRankMedalData
{
	struct FString Area; // 0x0(0x10)
	struct FString Country; // 0x10(0x10)
	int32_t Rank; // 0x20(0x4)
	int32_t PlayerID; // 0x24(0x4)
	int32_t CharacterID; // 0x28(0x4)
	int32_t CharacterType; // 0x2C(0x4)
	int32_t RankScore; // 0x30(0x4)
	int32_t RankType; // 0x34(0x4)
	int32_t AutoID; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
};

// Object: ScriptStruct Solarland.CharacterSkin
// Size: 0x14 (Inherited: 0x0)
struct FCharacterSkin
{
	int32_t SkinID; // 0x0(0x4)
	int32_t SkinOwnerType; // 0x4(0x4)
	int32_t Pose; // 0x8(0x4)
	int32_t PlayerID; // 0xC(0x4)
	int32_t KillActionId; // 0x10(0x4)
};

// Object: ScriptStruct Solarland.WorldMarkData
// Size: 0xB8 (Inherited: 0xC)
struct FWorldMarkData : FFastArraySerializerItem
{
	int32_t WorldMarkGUID; // 0xC(0x4)
	struct FVector_NetQuantize WorldPos; // 0x10(0xC)
	uint8_t PosInTeam; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
	struct FVector2D ScreenCoordinate; // 0x20(0x8)
	enum class EWorldMarkType Type; // 0x28(0x1)
	uint8_t Pad_0x29[0x3]; // 0x29(0x3)
	int32_t ItemID; // 0x2C(0x4)
	int64_t ItemInstanceId; // 0x30(0x8)
	int32_t NameLocID; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
	struct FString IconImg; // 0x40(0x10)
	int32_t WeaponLevel; // 0x50(0x4)
	enum class EInteractableActorType InteractableType; // 0x54(0x1)
	uint8_t Pad_0x55[0x3]; // 0x55(0x3)
	struct TArray<int32_t> MarkVoiceEventName; // 0x58(0x10)
	int32_t OuterBoxThisID; // 0x68(0x4)
	float MarkTimeStamp; // 0x6C(0x4)
	bool bShowOnlyOwner; // 0x70(0x1)
	uint8_t Pad_0x71[0x3]; // 0x71(0x3)
	float LifeTime; // 0x74(0x4)
	float ExtraLiveTime; // 0x78(0x4)
	struct TWeakObjectPtr<struct AActor> AttachedActor; // 0x7C(0x8)
	struct TWeakObjectPtr<struct UPrimitiveComponent> AttachedComponent; // 0x84(0x8)
	uint8_t AttachedActorSpecialState; // 0x8C(0x1)
	uint8_t Pad_0x8D[0x3]; // 0x8D(0x3)
	int32_t MiniMapServerId; // 0x90(0x4)
	uint8_t Pad_0x94[0x4]; // 0x94(0x4)
	struct TArray<uint8_t> ResponseChosenPlayerPosInTeam; // 0x98(0x10)
	struct FVector MarkRelativeLocation; // 0xA8(0xC)
	uint8_t Pad_0xB4[0x4]; // 0xB4(0x4)
};

// Object: ScriptStruct Solarland.RTCResultType
// Size: 0x18 (Inherited: 0x0)
struct FRTCResultType
{
	int32_t RTCType; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FString RTCRoomID; // 0x8(0x10)
};

// Object: ScriptStruct Solarland.SolarVaultKeyMarkInfo
// Size: 0x10 (Inherited: 0x0)
struct FSolarVaultKeyMarkInfo
{
	struct FVector Location; // 0x0(0xC)
	int32_t LocationType; // 0xC(0x4)
};

// Object: ScriptStruct Solarland.MakerRepDataContainer
// Size: 0x170 (Inherited: 0x108)
struct FMakerRepDataContainer : FFastArraySerializer
{
	struct TArray<struct FMakerRepData> MakerRepDatas; // 0x108(0x10)
	struct USolarMapManager* MapManager; // 0x118(0x8)
	uint8_t Pad_0x120[0x50]; // 0x120(0x50)
};

// Object: ScriptStruct Solarland.MakerRepData
// Size: 0x34 (Inherited: 0xC)
struct FMakerRepData : FFastArraySerializerItem
{
	struct FGameplayTag Type; // 0xC(0x8)
	struct FGameplayTag Style; // 0x14(0x8)
	int32_t Key; // 0x1C(0x4)
	struct FVector_NetQuantize Param; // 0x20(0xC)
	struct TWeakObjectPtr<struct AActor> MarkedActor; // 0x2C(0x8)
};

// Object: ScriptStruct Solarland.PlayerTagStackContainer
// Size: 0x1B8 (Inherited: 0x108)
struct FPlayerTagStackContainer : FFastArraySerializer
{
	struct TArray<struct FPlayerTagStack> Stacks; // 0x108(0x10)
	uint8_t Pad_0x118[0xA0]; // 0x118(0xA0)
};

// Object: ScriptStruct Solarland.PlayerTagStack
// Size: 0x18 (Inherited: 0xC)
struct FPlayerTagStack : FFastArraySerializerItem
{
	struct FGameplayTag Tag; // 0xC(0x8)
	int32_t StackCount; // 0x14(0x4)
};

// Object: ScriptStruct Solarland.EliminateReportReplicate
// Size: 0x28 (Inherited: 0x0)
struct FEliminateReportReplicate
{
