// @AnubisCheatz
//
// sdk genrated by @crusher_14
//
// https://t.me/AnubisCheatz

#pragma once

namespace SDK
{

// Object: UserDefinedStruct S_KeyPromptKeyBoard.S_KeyPromptKeyBoard
// Size: 0x94 (Inherited: 0x0)
struct FS_KeyPromptKeyBoard
{
	struct FLinearColor BgColor_2_B90AE02F4CB9AD0D665AA28F9A2AC172; // 0x0(0x10)
	int32_t FontSize_5_3519D57C41DC7FD8DC74729EB654DCBA; // 0x10(0x4)
	struct FVector2D BgSize_8_734A1B214070AE4C1235A5A5E6C9846E; // 0x14(0x8)
	struct FLinearColor FrameColor_11_7DC26D3E422D4404F9456E972E80A82C; // 0x1C(0x10)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
	struct FSlateColor FontColor_16_E6BA2266442348FA427E25A3D34A2AF9; // 0x30(0x28)
	int32_t FontOutline_26_9265D86F4D67F122DC69AC8308033B60; // 0x58(0x4)
	struct FLinearColor FontOutlineColor_27_C78787E044D2C7311DCC5EBD0659A055; // 0x5C(0x10)
	struct FVector2D FontShadow_32_18B86C144C1912D6F8714F93283E12DA; // 0x6C(0x8)
	struct FLinearColor FontShadowColor_31_A3BDB7ED47B0DC5B64C7589B7CAE7320; // 0x74(0x10)
	struct FLinearColor ImgColor_19_110032324758E641DC33699848D52BCA; // 0x84(0x10)
};

} // namespace SDK
